{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"nextelement\", \"find\", \"find\"]",
    "src_uid": "5ad16e23e96de111c4974551b859a5ff",
    "prob_desc_notes": null,
    "prob_desc_description": "Autocomplete is a program function that enables inputting the text (in editors, command line shells, browsers etc.) completing the text by its inputted part. Vasya is busy working on a new browser called 'BERowser'. He happens to be working on the autocomplete function in the address line at this very moment. A list consisting of n last visited by the user pages and the inputted part s are known. Your task is to complete s to make it an address of one of the pages from the list. You have to find the lexicographically smallest address having a prefix s.",
    "prob_desc_output_spec": "If s is not the beginning of any of n addresses of the visited pages, print s. Otherwise, print the lexicographically minimal address of one of the visited pages starting from s. The lexicographical order is the order of words in a dictionary. The lexicographical comparison of lines is realized by the '&lt;' operator in the modern programming languages.",
    "prob_desc_input_spec": "The first line contains the s line which is the inputted part. The second line contains an integer n (1 ≤ n ≤ 100) which is the number of visited pages. Then follow n lines which are the visited pages, one on each line. All the lines have lengths of from 1 to 100 symbols inclusively and consist of lowercase Latin letters only.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_001.jsonl",
    "code_uid": "2b77b908f4089c3aa236fb8db2d8636f",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"next\\n2\\nnextpermutation\\nnextelement\", \"find\\n4\\nfind\\nfindfirstof\\nfindit\\nfand\", \"find\\n4\\nfondfind\\nfondfirstof\\nfondit\\nfand\"]",
    "exec_outcome": "PASSED",
    "source_code": "v=[]\nz=input()\nfor i in range(int(input())):\n    x=input()\n    if x[0:len(z)]==z:\n        v.append(x)    \nif len(v)==0:\n     print(z)        \nelse:\n  print(min(v))",
    "prob_desc_created_at": "1294329600",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}