{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"2\", \"7\", \"2\", \"4\"]",
    "src_uid": "b1c7ca90ce9a67605fa058d4fd38c2f2",
    "prob_desc_notes": "NoteThe illustrations to the first three tests are given below.  The last example illustrates that each point in the sequence should be counted as many times as it is presented in the sequence.",
    "prob_desc_description": "Santa Claus has Robot which lives on the infinite grid and can move along its lines. He can also, having a sequence of m points p1, p2, ..., pm with integer coordinates, do the following: denote its initial location by p0. First, the robot will move from p0 to p1 along one of the shortest paths between them (please notice that since the robot moves only along the grid lines, there can be several shortest paths). Then, after it reaches p1, it'll move to p2, again, choosing one of the shortest ways, then to p3, and so on, until he has visited all points in the given order. Some of the points in the sequence may coincide, in that case Robot will visit that point several times according to the sequence order.While Santa was away, someone gave a sequence of points to Robot. This sequence is now lost, but Robot saved the protocol of its unit movements. Please, find the minimum possible length of the sequence.",
    "prob_desc_output_spec": "The only line of input should contain the minimum possible length of the sequence.",
    "prob_desc_input_spec": "The first line of input contains the only positive integer n (1 ≤ n ≤ 2·105) which equals the number of unit segments the robot traveled. The second line contains the movements protocol, which consists of n letters, each being equal either L, or R, or U, or D. k-th letter stands for the direction which Robot traveled the k-th unit segment in: L means that it moved to the left, R — to the right, U — to the top and D — to the bottom. Have a look at the illustrations for better explanation.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_001.jsonl",
    "code_uid": "fdc94bcd8f0ac0173ab98f6a2e37e472",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\nRURD\", \"6\\nRRULDD\", \"26\\nRRRULURURUULULLLDLDDRDRDLD\", \"3\\nRLL\", \"4\\nLRLR\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\ns = input()\n\nans = 0\nlr, ud = '', ''\n\nfor l in s:\n    if l == 'L' or l == 'R':\n        if lr != '' and lr != l:\n            ans += 1\n            ud = ''\n        lr = l\n    else:\n        if ud != '' and ud != l:\n            ans += 1\n            lr = ''\n        ud = l\n\nprint(ans + 1)",
    "prob_desc_created_at": "1482656700",
    "tags": [
        "greedy",
        "shortest paths"
    ],
    "hidden_unit_tests": ""
}