{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"1\"]",
    "src_uid": "3542adc74a41ccfd72008faf983ffab5",
    "prob_desc_notes": "NoteIn the first sample Petya and Vasya are sure that they know how to solve the first problem and all three of them know how to solve the second problem. That means that they will write solutions for these problems. Only Petya is sure about the solution for the third problem, but that isn't enough, so the friends won't take it. In the second sample the friends will only implement the second problem, as Vasya and Tonya are sure about the solution.",
    "prob_desc_description": "One day three best friends Petya, Vasya and Tonya decided to form a team and take part in programming contests. Participants are usually offered several problems during programming contests. Long before the start the friends decided that they will implement a problem if at least two of them are sure about the solution. Otherwise, the friends won't write the problem's solution.This contest offers n problems to the participants. For each problem we know, which friend is sure about the solution. Help the friends find the number of problems for which they will write a solution.",
    "prob_desc_output_spec": "Print a single integer — the number of problems the friends will implement on the contest.",
    "prob_desc_input_spec": "The first input line contains a single integer n (1 ≤ n ≤ 1000) — the number of problems in the contest. Then n lines contain three integers each, each integer is either 0 or 1. If the first number in the line equals 1, then Petya is sure about the problem's solution, otherwise he isn't sure. The second number shows Vasya's view on the solution, the third number shows Tonya's view. The numbers on the lines are separated by spaces.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 800,
    "file_name": "train_001.jsonl",
    "code_uid": "e8cbf01b75835cee59c0e24febf12087",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n1 1 0\\n1 1 1\\n1 0 0\", \"2\\n1 0 0\\n0 1 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n=int(input())\nls=[]\ni=0\nwhile i<n:\n    ipt=input().split()\n    ls.append(ipt)\n    i=i+1\ni=0\nm=0\nwhile i<n:\n    lt=ls[i]\n    j=0\n    k=0\n    while j<3:\n        #print(\"    \",lt[j])\n        if lt[j]==\"1\":\n            k=k+1\n        else:\n            k=k\n        j=j+1\n        #print(\"    \",j,k)\n    if k>1:\n        m=m+1\n    else:\n        m=m\n    #print(m)\n    i=i+1\nprint(m)\n",
    "prob_desc_created_at": "1349623800",
    "tags": [
        "greedy",
        "brute force"
    ],
    "hidden_unit_tests": ""
}