{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"YES\", \"NO\", \"YES\"]",
    "src_uid": "8e0581cce19d6bf5eba30a0aebee9a08",
    "prob_desc_notes": "NoteIn the first sample test you can, for example, choose numbers 1 and 2 from array A and number 3 from array B (1 &lt; 3 and 2 &lt; 3).In the second sample test the only way to choose k elements in the first array and m elements in the second one is to choose all numbers in both arrays, but then not all the numbers chosen in A will be less than all the numbers chosen in B: .",
    "prob_desc_description": "You are given two arrays A and B consisting of integers, sorted in non-decreasing order. Check whether it is possible to choose k numbers in array A and choose m numbers in array B so that any number chosen in the first array is strictly less than any number chosen in the second array.",
    "prob_desc_output_spec": "Print \"YES\" (without the quotes), if you can choose k numbers in array A and m numbers in array B so that any number chosen in array A was strictly less than any number chosen in array B. Otherwise, print \"NO\" (without the quotes).",
    "prob_desc_input_spec": "The first line contains two integers nA, nB (1 ≤ nA, nB ≤ 105), separated by a space — the sizes of arrays A and B, correspondingly. The second line contains two integers k and m (1 ≤ k ≤ nA, 1 ≤ m ≤ nB), separated by a space. The third line contains nA numbers a1, a2, ... anA ( - 109 ≤ a1 ≤ a2 ≤ ... ≤ anA ≤ 109), separated by spaces — elements of array A. The fourth line contains nB integers b1, b2, ... bnB ( - 109 ≤ b1 ≤ b2 ≤ ... ≤ bnB ≤ 109), separated by spaces — elements of array B.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 900,
    "file_name": "train_014.jsonl",
    "code_uid": "f866db75da4736e2ae1993b047799154",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 3\\n2 1\\n1 2 3\\n3 4 5\", \"3 3\\n3 3\\n1 2 3\\n3 4 5\", \"5 2\\n3 1\\n1 1 1 1 1\\n2 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "_ = raw_input()\nk, m = map(int, raw_input().split())\na = list(map(int, raw_input().split()))\nb = list(map(int, raw_input().split()))\n\nif a[k-1] < b[-m]: print 'YES'\nelse: print 'NO'\n",
    "prob_desc_created_at": "1440261000",
    "tags": [
        "sortings"
    ],
    "hidden_unit_tests": ""
}