{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"cslnb\", \"cslnb\", \"sjfnb\", \"sjfnb\"]",
    "src_uid": "dc225c801f55b8d7b40ebcc71b417edb",
    "prob_desc_notes": "NoteIn the first example, Tokitsukaze cannot take any stone, so CSL will win.In the second example, Tokitsukaze can only take a stone from the first pile, and then, even though they have no stone, these two piles will have the same number of stones, which implies CSL will win.In the third example, Tokitsukaze will win. Here is one of the optimal ways:  Firstly, Tokitsukaze can choose the first pile and take a stone from that pile.  Then, CSL can only choose the first pile, because if he chooses the second pile, he will lose immediately.  Finally, Tokitsukaze can choose the second pile, and then CSL will have no choice but to lose. In the fourth example, they only have one good choice at any time, so Tokitsukaze can make the game lasting as long as possible and finally win.",
    "prob_desc_description": "Tokitsukaze and CSL are playing a little game of stones.In the beginning, there are $$$n$$$ piles of stones, the $$$i$$$-th pile of which has $$$a_i$$$ stones. The two players take turns making moves. Tokitsukaze moves first. On each turn the player chooses a nonempty pile and removes exactly one stone from the pile. A player loses if all of the piles are empty before his turn, or if after removing the stone, two piles (possibly empty) contain the same number of stones. Supposing that both players play optimally, who will win the game?Consider an example: $$$n=3$$$ and sizes of piles are $$$a_1=2$$$, $$$a_2=3$$$, $$$a_3=0$$$. It is impossible to choose the empty pile, so Tokitsukaze has two choices: the first and the second piles. If she chooses the first pile then the state will be $$$[1, 3, 0]$$$ and it is a good move. But if she chooses the second pile then the state will be $$$[2, 2, 0]$$$ and she immediately loses. So the only good move for her is to choose the first pile. Supposing that both players always take their best moves and never make mistakes, who will win the game?Note that even if there are two piles with the same number of stones at the beginning, Tokitsukaze may still be able to make a valid first move. It is only necessary that there are no two piles with the same number of stones after she moves.",
    "prob_desc_output_spec": "Print \"sjfnb\" (without quotes) if Tokitsukaze will win, or \"cslnb\" (without quotes) if CSL will win. Note the output characters are case-sensitive.",
    "prob_desc_input_spec": "The first line contains a single integer $$$n$$$ ($$$1 \\le n \\le 10^5$$$) — the number of piles. The second line contains $$$n$$$ integers $$$a_1, a_2, \\ldots, a_n$$$ ($$$0 \\le a_1, a_2, \\ldots, a_n \\le 10^9$$$), which mean the $$$i$$$-th pile has $$$a_i$$$ stones.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_001.jsonl",
    "code_uid": "bc8d6485893bdcedcd427ef36d56197e",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"1\\n0\", \"2\\n1 0\", \"2\\n2 2\", \"3\\n2 3 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "from collections import defaultdict\n\nFIRST = \"sjfnb\"\nSECOND = \"cslnb\" \nn = int(input())\narr = list(map(int, input().split()))\nm = len(set(arr))\n\n\n\nif sum(arr) == 0 or arr.count(0) >= 2:\n  print(SECOND)\n  exit()\n\nelif m <= n - 2:\n  print(SECOND)\n  exit()\n\nelif m == n - 1:\n  d = defaultdict(int)\n  for i in arr:\n    d[i] += 1\n  \n  for i, j in d.items():\n    if j == 2:\n      if i-1 in d:\n        print(SECOND)\n        exit()\n\ns = 0\nfor i, j in enumerate(sorted(arr)):\n  s += j - i \nif s % 2 == 1:\n  print(FIRST)\n  exit()\nelse:\n  print(SECOND)\n  exit()\n\n  \n\n",
    "prob_desc_created_at": "1562942100",
    "tags": [
        "greedy",
        "games"
    ],
    "hidden_unit_tests": ""
}