{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"30 3\", \"1950 2\"]",
    "src_uid": "4ee20979c25c37eed38da902011988d1",
    "prob_desc_notes": "NoteA note to first example: it the first team should be Dracul, Troll and Anka, in the second one Hexadecimal and Snowy, and in the third Cleo и Chapay.",
    "prob_desc_description": "The year of 2012 is coming...According to an ancient choradrican legend in this very year, in 2012, Diablo and his brothers Mephisto and Baal will escape from hell, and innumerable hordes of demons will enslave the human world. But seven brave heroes have already gathered on the top of a mountain Arreat to protect us mere mortals from the effect of this terrible evil.The seven great heroes are: amazon Anka, barbarian Chapay, sorceress Cleo, druid Troll, necromancer Dracul, paladin Snowy and a professional hit girl Hexadecimal. Heroes already know how much experience will be given for each of the three megabosses: a for Mephisto, b for Diablo and c for Baal.Here's the problem: heroes are as much as seven and megabosses are only three! Then our heroes decided to split into three teams, where each team will go to destroy their own megaboss. Each team member will receive a  of experience, rounded down, where x will be the amount of experience for the killed megaboss and y — the number of people in the team.Heroes do not want to hurt each other's feelings, so they want to split into teams so that the difference between the hero who received the maximum number of experience and the hero who received the minimum number of experience were minimal. Since there can be several divisions into teams, then you need to find the one in which the total amount of liking in teams were maximum.It is known that some heroes like others. But if hero p likes hero q, this does not mean that the hero q likes hero p. No hero likes himself.The total amount of liking in teams is the amount of ordered pairs (p, q), such that heroes p and q are in the same group, and hero p likes hero q (but it is not important if hero q likes hero p). In case of heroes p and q likes each other and they are in the same group, this pair should be counted twice, as (p, q) and (q, p).A team can consist even of a single hero, but it is important that every megaboss was destroyed. All heroes must be involved in the campaign against evil. None of the heroes can be in more than one team.It is guaranteed that every hero is able to destroy any megaboss alone.",
    "prob_desc_output_spec": "Print two integers — the minimal difference in the experience between two heroes who will receive the maximum and minimum number of experience points, and the maximal total amount of liking in teams (the number of friendships between heroes that end up in one team). When calculating the second answer, the team division should satisfy the difference-minimizing contraint. I.e. primary you should minimize the difference in the experience and secondary you should maximize the total amount of liking.",
    "prob_desc_input_spec": "The first line contains a single non-negative integer n (0 ≤ n ≤ 42) — amount of liking between the heroes. Next n lines describe liking in the form \"p likes q\", meaning that the hero p likes the hero q (p  ≠  q). Every liking is described in the input exactly once, no hero likes himself. In the last line are given three integers a, b and c (1 ≤ a, b, c ≤ 2·109), separated by spaces: the experience for Mephisto, the experience for Diablo and experience for Baal. In all the pretests, except for examples from the statement, the following condition is satisfied: a = b = c.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_019.jsonl",
    "code_uid": "1400174ce8e85506d7d1504de6054d43",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\nTroll likes Dracul\\nDracul likes Anka\\nSnowy likes Hexadecimal\\n210 200 180\", \"2\\nAnka likes Chapay\\nChapay likes Anka\\n10000 50 50\"]",
    "exec_outcome": "PASSED",
    "source_code": "'''input\n5\nTroll likes Dracul\nAnka likes Chapay\nCleo likes Anka\nChapay likes Cleo\nSnowy likes Hexadecimal\n222 400 400\n\n'''\n\nRI = lambda : [int(x) for x in raw_input().split()]\nrw = lambda : raw_input().strip()\n\nfrom itertools import combinations as com\nimport sys\nsys.setrecursionlimit(10**6)\nn =input()\nHeroes=[\"Anka\", \"Chapay\",  \"Cleo\", \"Troll\",\"Dracul\", \"Snowy\"  ,\"Hexadecimal\"]\nM=set()\n\nfor i in range(n):\n\ts=rw()\n\ta,b=s.split(\" likes \")\n\tM.add((Heroes.index(a), Heroes.index(b)) )\n#print M\nli = range(7)\n\nM2=[]\n\nexpdiff = 99999999999999999999\nl1,l2,l3=RI()\nfor i in range(1,8):\n\tfor j in range(1,8):\n\t\ta=i\n\t\tb=j\n\t\tc=7-i-j\n\t\tif a>0 and b>0 and c>0:\n\t\t\texpdiff = min(expdiff,max(l1/a,l2/b,l3/c)-min(l1/a,l2/b,l3/c))\nallcom=[]\nfor i in range(1,8):\n\tfor j in range(1,8):\n\t\ta=i\n\t\tb=j\n\t\tc=7-i-j\n\t\tif a>0 and b>0 and c>0:\n\t\t\tif max(l1/a,l2/b,l3/c)-min(l1/a,l2/b,l3/c)==expdiff:\n\t\t\t\tallcom.append((a,b,c))\n\nallcom2=list(set(allcom))\nfrom itertools import permutations as p\nalp =list(p(range(7)))\n#print allcom\n\nmxscore = 0\nfor allcom in allcom2:\n\tfor perm in alp:\n\t\tg1=[]\n\t\tg2=[]\n\t\tg3=[]\n\t\tg1 = perm[:allcom[0]]\n\t\tg2 = perm[allcom[0]:allcom[0]+allcom[1]]\n\t\tg3 = perm[allcom[1]+allcom[0]:]\n\t\tscore=0\n\n\t\tfor a,b in M:\n\t\t\t#print a,b\n\t\t\tif (a in g1 and b in g1 ) or (a in g2 and b in g2 ) or (a in g3 and b in g3 ):\n\t\t\t\tscore+=1\n\t\t\n\t\tmxscore=max(mxscore,score)\n\nprint expdiff,mxscore\n\n\t\n\n\n\n\n",
    "prob_desc_created_at": "1303226100",
    "tags": [
        "implementation",
        "brute force"
    ],
    "hidden_unit_tests": ""
}