{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"3\\n2 1\\n3 1\\n3 2\", \"0\"]",
    "src_uid": "bb3e3b51a4eda8fef503952a00777910",
    "prob_desc_notes": null,
    "prob_desc_description": "Petya and Vasya are tossing a coin. Their friend Valera is appointed as a judge. The game is very simple. First Vasya tosses a coin x times, then Petya tosses a coin y times. If the tossing player gets head, he scores one point. If he gets tail, nobody gets any points. The winner is the player with most points by the end of the game. If boys have the same number of points, the game finishes with a draw.At some point, Valera lost his count, and so he can not say exactly what the score is at the end of the game. But there are things he remembers for sure. He remembers that the entire game Vasya got heads at least a times, and Petya got heads at least b times. Moreover, he knows that the winner of the game was Vasya. Valera wants to use this information to know every possible outcome of the game, which do not contradict his memories.",
    "prob_desc_output_spec": "In the first line print integer n — the number of possible outcomes of the game. Then on n lines print the outcomes. On the i-th line print a space-separated pair of integers ci, di — the number of heads Vasya and Petya got in the i-th outcome of the game, correspondingly. Print pairs of integers (ci, di) in the strictly increasing order. Let us remind you that the pair of numbers (p1, q1) is less than the pair of numbers (p2, q2), if p1 &lt; p2, or p1 = p2 and also q1 &lt; q2.",
    "prob_desc_input_spec": "The single line contains four integers x, y, a, b (1 ≤ a ≤ x ≤ 100, 1 ≤ b ≤ y ≤ 100). The numbers on the line are separated by a space.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_004.jsonl",
    "code_uid": "2d86613aade1d64bb8c725f298ce1d7f",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 2 1 1\", \"2 4 2 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "x, y, a, b = map(int, input().split())\nans = []\nfor vasya in range(max(b + 1, a), x + 1):\n  for petya in range(b, min(vasya, y + 1)):\n    ans.append((petya, vasya))\nprint(len(ans))\nprint(\"\\n\".join([\"%d %d\" % (b, a) for a, b in ans]))",
    "prob_desc_created_at": "1352647800",
    "tags": [
        "implementation",
        "brute force"
    ],
    "hidden_unit_tests": ""
}