{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"2\\n2\\n1\\n1\\n1\\n2\", \"2\\n0\\n1\\n1\"]",
    "src_uid": "93437df101a317c2306b37bf020a5012",
    "prob_desc_notes": "NoteNote to the second sample:   Movie jumanji can theoretically have from 1 to 3 Vasya's favourite actors.  Movie theeagle has all three favourite actors, as the actor Vasya failed to remember, can only have identifier 5.  Movie matrix can have exactly one favourite actor.  Movie sourcecode doesn't have any favourite actors. Thus, movie theeagle will surely be favourite, movies matrix and sourcecode won't surely be favourite, and movie jumanji can be either favourite (if it has all three favourite actors), or not favourite.",
    "prob_desc_description": "Overall there are m actors in Berland. Each actor has a personal identifier — an integer from 1 to m (distinct actors have distinct identifiers). Vasya likes to watch Berland movies with Berland actors, and he has k favorite actors. He watched the movie trailers for the next month and wrote the following information for every movie: the movie title, the number of actors who starred in it, and the identifiers of these actors. Besides, he managed to copy the movie titles and how many actors starred there, but he didn't manage to write down the identifiers of some actors. Vasya looks at his records and wonders which movies may be his favourite, and which ones may not be. Once Vasya learns the exact cast of all movies, his favorite movies will be determined as follows: a movie becomes favorite movie, if no other movie from Vasya's list has more favorite actors.Help the boy to determine the following for each movie: whether it surely will be his favourite movie; whether it surely won't be his favourite movie;  can either be favourite or not.",
    "prob_desc_output_spec": "Print n lines in the output. In the i-th line print:    0, if the i-th movie will surely be the favourite;  1, if the i-th movie won't surely be the favourite;  2, if the i-th movie can either be favourite, or not favourite. ",
    "prob_desc_input_spec": "The first line of the input contains two integers m and k (1 ≤ m ≤ 100, 1 ≤ k ≤ m) — the number of actors in Berland and the number of Vasya's favourite actors.  The second line contains k distinct integers ai (1 ≤ ai ≤ m) — the identifiers of Vasya's favourite actors. The third line contains a single integer n (1 ≤ n ≤ 100) — the number of movies in Vasya's list. Then follow n blocks of lines, each block contains a movie's description. The i-th movie's description contains three lines:    the first line contains string si (si consists of lowercase English letters and can have the length of from 1 to 10 characters, inclusive) — the movie's title,  the second line contains a non-negative integer di (1 ≤ di ≤ m) — the number of actors who starred in this movie, the third line has di integers bi, j (0 ≤ bi, j ≤ m) — the identifiers of the actors who star in this movie. If bi, j = 0, than Vasya doesn't remember the identifier of the j-th actor. It is guaranteed that the list of actors for a movie doesn't contain the same actors.  All movies have distinct names. The numbers on the lines are separated by single spaces.",
    "prob_desc_output_to": "output.txt",
    "prob_desc_input_from": "input.txt",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_004.jsonl",
    "code_uid": "0c7d4d7fc9faa8a46cf184b5a5a5497c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5 3\\n1 2 3\\n6\\nfirstfilm\\n3\\n0 0 0\\nsecondfilm\\n4\\n0 0 4 5\\nthirdfilm\\n1\\n2\\nfourthfilm\\n1\\n5\\nfifthfilm\\n1\\n4\\nsixthfilm\\n2\\n1 0\", \"5 3\\n1 3 5\\n4\\njumanji\\n3\\n0 0 0\\ntheeagle\\n5\\n1 2 3 4 0\\nmatrix\\n3\\n2 4 0\\nsourcecode\\n2\\n2 4\"]",
    "exec_outcome": "PASSED",
    "source_code": "def main():\n    file = open(\"input.txt\")\n    file_o = open(\"output.txt\", 'w')\n    m, k = map(int, file.readline().split())\n    fvr = set(map(int, file.readline().split()))\n    n = int(file.readline())\n    img_cnt = []\n    act_cnt = []\n    sur_frv_cut = 0\n    sur_frv_cut_sec = 0\n    sur_not_cut = 0\n    for _ in range(n):\n        name = file.readline()\n        d = int(file.readline())\n        ds = map(int, file.readline().split())\n        f = 0\n        nf = 0\n        for num in ds:\n            if num in fvr:\n                f = f + 1\n            elif num != 0:\n                nf = nf + 1\n        img = d - nf\n        if img > k: img = k\n        act = d - (m - k)\n        if act < f: act = f\n\n        img_cnt.append(img)\n        act_cnt.append(act)\n\n        if img > sur_frv_cut:\n            sur_frv_cut_sec = sur_frv_cut\n            sur_frv_cut = img\n        elif img > sur_frv_cut_sec:\n            sur_frv_cut_sec = img\n\n        if act > sur_not_cut:\n            sur_not_cut = act\n\n    for i in range(n):\n\n        if act_cnt[i] >= sur_frv_cut or (act_cnt[i] >= sur_frv_cut_sec and img_cnt[i] >= sur_frv_cut): file_o.write(\"0\\n\")\n        elif img_cnt[i] < sur_not_cut: file_o.write(\"1\\n\")\n        else: file_o.write(\"2\\n\")\n\n    file_o.close()\n\nmain()",
    "prob_desc_created_at": "1350370800",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}