{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"5\", \"8\"]",
    "src_uid": "0b229ddf583949d43d6f1728e38c3cad",
    "prob_desc_notes": "NoteNotes to sample tests:Magical subarrays are shown with pairs of indices [a;b] of the beginning and the end.In the first sample: [1;1], [2;2], [3;3], [4;4], [2;3].In the second sample: [1;1], [2;2], [3;3], [4;4], [5;5], [1;2], [2;3], [1;3]. ",
    "prob_desc_description": "Valery is very interested in magic. Magic attracts him so much that he sees it everywhere. He explains any strange and weird phenomenon through intervention of supernatural forces. But who would have thought that even in a regular array of numbers Valera manages to see something beautiful and magical.Valera absolutely accidentally got a piece of ancient parchment on which an array of numbers was written. He immediately thought that the numbers in this array were not random. As a result of extensive research Valera worked out a wonderful property that a magical array should have: an array is defined as magic if its minimum and maximum coincide.He decided to share this outstanding discovery with you, but he asks you for help in return. Despite the tremendous intelligence and wit, Valera counts very badly and so you will have to complete his work. All you have to do is count the number of magical subarrays of the original array of numbers, written on the parchment. Subarray is defined as non-empty sequence of consecutive elements.",
    "prob_desc_output_spec": "Print on the single line the answer to the problem: the amount of subarrays, which are magical. Please do not use the %lld specificator to read or write 64-bit numbers in C++. It is recommended to use cin, cout streams (you can also use the %I64d specificator).",
    "prob_desc_input_spec": "The first line of the input data contains an integer n (1 ≤ n ≤ 105). The second line contains an array of original integers a1, a2, ..., an ( - 109 ≤ ai ≤ 109). ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_004.jsonl",
    "code_uid": "e45e19f5f10fc3e079dd5ddcfb94c7df",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\n2 1 1 4\", \"5\\n-2 -2 -2 0 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = raw_input()\nst = map(int, raw_input().split())\ngl = 0\nloc = 0\nprev = 0\nfor i in st:\n    if prev != i:\n        loc = 1\n    else:\n        loc += 1\n    gl += loc\n    prev = i\nprint gl\n        \n\n",
    "prob_desc_created_at": "1305299400",
    "tags": [
        "math"
    ],
    "hidden_unit_tests": ""
}