{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"-1\"]",
    "src_uid": "0f49b4a5696ee71ebbc8f83d1ec3b901",
    "prob_desc_notes": "NoteIn the second example Vasya is not able to determine items count uniquely because 3 items, as well as 4 items, can be displayed on two pages.",
    "prob_desc_description": "Vasya plays The Elder Trolls III: Morrowindows. He has a huge list of items in the inventory, however, there is no limits on the size of things. Vasya does not know the total amount of items but he is sure that are not more than x and not less than 2 items in his inventory. A new patch for the game appeared to view inventory in n different modes. Displaying in mode i is a partition of all inventory items on pages, each of which (except for maybe the last one) shows exactly ai items. In addition, each mode shows how many pages bi is in a complete list. Great! Perhaps this information will be enough for Vasya to find the required number. Moreover, it is very interesting, what is the fewest number of modes in which Vasya can see inventory to determine the number of items in it?Vasya cannot use the information that was received while looking on inventory in some mode for selection of next actions. I. e. Vasya chooses some set of modes first, and then sees all the results and determines the size.Knowing the number of ai, x and assuming that Vasya is very smart, check whether he can uniquely determine the number of items in his inventory, and how many modes he will need to do that if he knows numbers ai, x and he is able to know number bi after viewing items in mode i.",
    "prob_desc_output_spec": "Output the fewest amount of modes required to uniquely determine amount of items in the inventory. If there is no solution output  - 1.",
    "prob_desc_input_spec": "The first line contains two integers n and x (0 ≤ n ≤ 105, 2 ≤ x ≤ 109). The second line contains integers ai (1 ≤ ai ≤ 109). Some numbers among all ai may be equal.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 2400,
    "file_name": "train_010.jsonl",
    "code_uid": "da2963669469d481ec2f814b811f58e4",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2 4\\n2 3\", \"1 4\\n2\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,x = map(int,raw_input().split())\na = set(map(int,raw_input().split()))\nif 1 in a and x>2: print 1\nelif x>1300000: print -1\nelse:\n    pr = range(x)\n    for i in xrange(2,x):\n        if not pr[i]: continue\n        ii=i*i\n        if ii>x: break\n        pr[ii::i]=[0]*len(pr[ii::i])     \n    pr = set(filter(None,pr)[1:])\n    print -1 if len(pr-a) else len(pr)    \n\n",
    "prob_desc_created_at": "1302422400",
    "tags": [
        "number theory",
        "math"
    ],
    "hidden_unit_tests": ""
}