{
    "prob_desc_time_limit": "5 seconds",
    "prob_desc_sample_outputs": "[\"1\\n[:||||||:]\", \"Brand new problem!\", \"1\\n[:||||:]\", \"3\\n[:|||:]\"]",
    "src_uid": "18f44ab990ef841c947e2da831321845",
    "prob_desc_notes": "NoteLet us remind you that the number of inversions is the number of pairs of words that follow in the permutation not in their original order. Thus, for example, if the original problem is \"add two numbers\", then permutation \"numbers add two\" contains two inversions — pairs of words \"numbers\" and \"add\", \"numbers\" and \"two\". Sequence b1,  b2,  ...,  bk is a subsequence of sequence a1, a2,  ...,  an if there exists such a set of indices 1 ≤ i1 &lt;  i2 &lt; ...   &lt; ik ≤ n that aij  =  bj (in other words, if sequence b can be obtained from a by deleting some of its elements).In the first test case the first problem contains the \"find the palindrome next\" permutation as a subsequence, in which the number of inversions equals 1 (words \"palindrome\" and \"next\").In the second test case there is no problem that contains a permutation of words from Lesha's problem as a subsequence.",
    "prob_desc_description": "A widely known among some people Belarusian sport programmer Lesha decided to make some money to buy a one square meter larger flat. To do this, he wants to make and carry out a Super Rated Match (SRM) on the site Torcoder.com. But there's a problem — a severe torcoder coordinator Ivan does not accept any Lesha's problem, calling each of them an offensive word \"duped\" (that is, duplicated). And one day they nearely quarrelled over yet another problem Ivan wouldn't accept.You are invited to act as a fair judge and determine whether the problem is indeed brand new, or Ivan is right and the problem bears some resemblance to those used in the previous SRMs.You are given the descriptions of Lesha's problem and each of Torcoder.com archive problems. The description of each problem is a sequence of words. Besides, it is guaranteed that Lesha's problem has no repeated words, while the description of an archive problem may contain any number of repeated words.The \"similarity\" between Lesha's problem and some archive problem can be found as follows. Among all permutations of words in Lesha's problem we choose the one that occurs in the archive problem as a subsequence. If there are multiple such permutations, we choose the one with the smallest number of inversions. Then the \"similarity\" of a problem can be written as , where n is the number of words in Lesha's problem and x is the number of inversions in the chosen permutation. Note that the \"similarity\" p is always a positive integer.The problem is called brand new if there is not a single problem in Ivan's archive which contains a permutation of words from Lesha's problem as a subsequence.Help the boys and determine whether the proposed problem is new, or specify the problem from the archive which resembles Lesha's problem the most, otherwise.",
    "prob_desc_output_spec": "If Lesha's problem is brand new, print string \"Brand new problem!\" (without quotes).  Otherwise, on the first line print the index of the archive problem which resembles Lesha's problem most. If there are multiple such problems, print the one with the smallest index. On the second line print a string consisting of characters [:, character | repeated p times, and characters :], where p is the \"similarity\" between this problem and Lesha's one. The archive problems are numbered starting from one in the order in which they are given in the input.",
    "prob_desc_input_spec": "The first line contains a single integer n (1 ≤ n ≤ 15) — the number of words in Lesha's problem. The second line contains n space-separated words — the short description of the problem. The third line contains a single integer m (1 ≤ m ≤ 10) — the number of problems in the Torcoder.com archive. Next m lines contain the descriptions of the problems as \"k s1 s2 ... sk\", where k (1 ≤ k ≤ 500000) is the number of words in the problem and si is a word of the problem description. All words from all problem descriptions contain no more than 10 lowercase English letters. It is guaranteed that the total length of words in all problem descriptions does not exceed 500015.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1700,
    "file_name": "train_068.jsonl",
    "code_uid": "40580259ac8aa0e1f354c48b3061f711",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\nfind the next palindrome\\n1\\n10 find the previous palindrome or print better luck next time\", \"3\\nadd two numbers\\n3\\n1 add\\n2 two two\\n3 numbers numbers numbers\", \"4\\nthese papers are formulas\\n3\\n6 what are these formulas and papers\\n5 papers are driving me crazy\\n4 crazy into the night\", \"3\\nadd two decimals\\n5\\n4 please two decimals add\\n5 decimals want to be added\\n4 two add decimals add\\n4 add one two three\\n7 one plus two plus three equals six\"]",
    "exec_outcome": "PASSED",
    "source_code": "import itertools\n\ndef check(curr_words, line):\n    if curr_words == []: \n        return True\n    for i in range(len(line)):\n        if line[i] == curr_words[0]:\n            return check(curr_words[1:], line[i+1:])\n    return False\n\nn = int(input())\nwords = input().split()\nm = int(input())\nres, idx = 0, 0\nfor i in range(m):\n    line = input().split()[1:]\n    for p in itertools.permutations(range(n)):\n        curr_words = [words[j] for j in p]\n        cnt = 0\n        for j in range(n):\n            cnt += len([k for k in range(j+1, n) if p[k] < p[j]])\n        v = n * (n-1) // 2 - cnt + 1\n        if check(curr_words, line[:]) and v > res: \n            res, idx = v, i+1\nif res > 0:\n    print(idx)\n    print('[:'+str('|'*res)+':]')\nelse:\n    print('Brand new problem!')",
    "prob_desc_created_at": "1340983800",
    "tags": [
        "brute force"
    ],
    "hidden_unit_tests": ""
}