{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"4\"]",
    "src_uid": "38bee9c2b21d2e91fdda931c8cacf204",
    "prob_desc_notes": "NoteIn the sample the longest chain the Donkey can build consists of four stars. Note that the Donkey can't choose the stars that lie on the rays he imagines.  ",
    "prob_desc_description": "In the evenings Donkey would join Shrek to look at the stars. They would sit on a log, sipping tea and they would watch the starry sky. The sky hung above the roof, right behind the chimney. Shrek's stars were to the right of the chimney and the Donkey's stars were to the left. Most days the Donkey would just count the stars, so he knew that they are exactly n. This time he wanted a challenge. He imagined a coordinate system: he put the origin of the coordinates at the intersection of the roof and the chimney, directed the OX axis to the left along the roof and the OY axis — up along the chimney (see figure). The Donkey imagined two rays emanating from he origin of axes at angles α1 and α2 to the OX axis.  Now he chooses any star that lies strictly between these rays. After that he imagines more rays that emanate from this star at the same angles α1 and α2 to the OX axis and chooses another star that lies strictly between the new rays. He repeats the operation as long as there still are stars he can choose between the rays that emanate from a star.   As a result, the Donkey gets a chain of stars. He can consecutively get to each star if he acts by the given rules.Your task is to find the maximum number of stars m that the Donkey's chain can contain.Note that the chain must necessarily start in the point of the origin of the axes, that isn't taken into consideration while counting the number m of stars in the chain.",
    "prob_desc_output_spec": "In a single line print number m — the answer to the problem.",
    "prob_desc_input_spec": "The first line contains an integer n (1 ≤ n ≤ 105) — the number of stars. The second line contains simple fractions representing relationships \"a/b c/d\", such that  and  (0 ≤ a, b, c, d ≤ 105; ; ; ). The given numbers a, b, c, d are integers. Next n lines contain pairs of integers xi, yi (1 ≤ xi, yi ≤ 105)— the stars' coordinates. It is guaranteed that all stars have distinct coordinates.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2700,
    "file_name": "train_024.jsonl",
    "code_uid": "f7de2c566f0a15379fec35e1945f4fe1",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"15\\n1/3 2/1\\n3 1\\n6 2\\n4 2\\n2 5\\n4 5\\n6 6\\n3 4\\n1 6\\n2 1\\n7 4\\n9 3\\n5 3\\n1 3\\n15 5\\n12 4\"]",
    "exec_outcome": "PASSED",
    "source_code": "import bisect\n\ndef INPUT():\n\tglobal n, a, b, c, d\n\tn = int(input())\n\ta, b, c, d = [int(j) for i in input().split() for j in i.split(\"/\")]\n\tglobal y_alpha\n\ty_alpha = []\n\tfor _ in range(n):\n\t\tx, y = [int(x) for x in input().split()]\n\t\ty_alpha.append((b * y - a * x, c * x - d * y))\n\n\nif __name__ == '__main__':\n\tINPUT()\n\ty_alpha = sorted([(x, y) for x, y in y_alpha if x > 0 and y > 0], key = lambda x: (x[0], -x[1]))\n\tdp = []\n\tfor x, y in y_alpha:\n\t\ti = bisect.bisect_left(dp, y)\n\t\tif i == len(dp):\n\t\t\tdp.append(y)\n\t\telse:\n\t\t\tdp[i] = y;\n\n\tprint(len(dp));\n\n\n",
    "prob_desc_created_at": "1353857400",
    "tags": [
        "dp",
        "geometry",
        "math",
        "sortings",
        "data structures"
    ],
    "hidden_unit_tests": ""
}