{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"word\\nl10n\\ni18n\\np43s\"]",
    "src_uid": "6639d6c53951f8c1a8324fb24ef68f7a",
    "prob_desc_notes": null,
    "prob_desc_description": "Sometimes some words like \"localization\" or \"internationalization\" are so long that writing them many times in one text is quite tiresome.Let's consider a word too long, if its length is strictly more than 10 characters. All too long words should be replaced with a special abbreviation.This abbreviation is made like this: we write down the first and the last letter of a word and between them we write the number of letters between the first and the last letters. That number is in decimal system and doesn't contain any leading zeroes.Thus, \"localization\" will be spelt as \"l10n\", and \"internationalization» will be spelt as \"i18n\".You are suggested to automatize the process of changing the words with abbreviations. At that all too long words should be replaced by the abbreviation and the words that are not too long should not undergo any changes.",
    "prob_desc_output_spec": "Print n lines. The i-th line should contain the result of replacing of the i-th word from the input data.",
    "prob_desc_input_spec": "The first line contains an integer n (1 ≤ n ≤ 100). Each of the following n lines contains one word. All the words consist of lowercase Latin letters and possess the lengths of from 1 to 100 characters.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 800,
    "file_name": "train_000.jsonl",
    "code_uid": "f46fe9561cb2f7414d7bdee6ff990c7d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\nword\\nlocalization\\ninternationalization\\npneumonoultramicroscopicsilicovolcanoconiosis\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\nfor i in range(n):\n\tword = input()\n\tif len(word)>10:\n\t\tprint(word[0]+str(len(word)-2)+word[-1])\n\telse:\n\t\tprint(word)",
    "prob_desc_created_at": "1301410800",
    "tags": [
        "strings"
    ],
    "hidden_unit_tests": ""
}