{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"3\\n3 1 3 4\\n3 2 5 6\\n1 7\", \"-1\"]",
    "src_uid": "37b34461876af7f2e845417268b55ffa",
    "prob_desc_notes": null,
    "prob_desc_description": "Oleg writes down the history of the days he lived. For each day he decides if it was good or bad. Oleg calls a non-empty sequence of days a zebra, if it starts with a bad day, ends with a bad day, and good and bad days are alternating in it. Let us denote bad days as 0 and good days as 1. Then, for example, sequences of days 0, 010, 01010 are zebras, while sequences 1, 0110, 0101 are not.Oleg tells you the story of days he lived in chronological order in form of string consisting of 0 and 1. Now you are interested if it is possible to divide Oleg's life history into several subsequences, each of which is a zebra, and the way it can be done. Each day must belong to exactly one of the subsequences. For each of the subsequences, days forming it must be ordered chronologically. Note that subsequence does not have to be a group of consecutive days. ",
    "prob_desc_output_spec": "If there is a way to divide history into zebra subsequences, in the first line of output you should print an integer k (1 ≤ k ≤ |s|), the resulting number of subsequences. In the i-th of following k lines first print the integer li (1 ≤ li ≤ |s|), which is the length of the i-th subsequence, and then li indices of days forming the subsequence. Indices must follow in ascending order. Days are numbered starting from 1. Each index from 1 to n must belong to exactly one subsequence. If there is no way to divide day history into zebra subsequences, print -1. Subsequences may be printed in any order. If there are several solutions, you may print any of them. You do not have to minimize nor maximize the value of k.",
    "prob_desc_input_spec": "In the only line of input data there is a non-empty string s consisting of characters 0 and 1, which describes the history of Oleg's life. Its length (denoted as |s|) does not exceed 200 000 characters.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_001.jsonl",
    "code_uid": "61dd5c3376d02c9bf292301968dce802",
    "prob_desc_memory_limit": "512 megabytes",
    "prob_desc_sample_inputs": "[\"0010100\", \"111\"]",
    "exec_outcome": "PASSED",
    "source_code": "p=[[],[]]\nv=[]\nfor u,x in enumerate(map(int,raw_input())):\n    if x:\n        if not p[0]:\n            print -1\n            break\n    else:\n        if not p[1]:\n            p[1]+=len(v),\n            v+=[],\n    i=p[1-x].pop()\n    v[i]+=u,\n    p[x]+=i,\nelse:\n    if p[1]:\n        print -1\n    else:\n        print len(v)\n        for x in v:\n            print len(x),\n            for y in x:\n                print y+1,\n            print",
    "prob_desc_created_at": "1520583000",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}