{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"ccccc\\ncccc\\nkekeke\"]",
    "src_uid": "b8ffd93a80c840ea645c6797f8ee269c",
    "prob_desc_notes": "NoteIn the first test case, \"aaaaa\" and \"bbbbb\" exchanged all positions, and \"ccccc\" is the stolen string.In the second test case, \"aaaa\" and \"bbbb\" exchanged two first positions, and \"cccc\" is the stolen string.This is the first test in the hack format: 33 5aaaaabbbbbccccc1 2 5 1 2 3 4 52 1 33 4aaaabbbbcccc1 2 2 1 22 1 35 6abcdefuuuuuukekekeekekekxyzklm1 5 3 2 3 62 4 3 2 4 65 4 1 2 3",
    "prob_desc_description": "AquaMoon had $$$n$$$ strings of length $$$m$$$ each. $$$n$$$ is an odd number.When AquaMoon was gone, Cirno tried to pair these $$$n$$$ strings together. After making $$$\\frac{n-1}{2}$$$ pairs, she found out that there was exactly one string without the pair!In her rage, she disrupted each pair of strings. For each pair, she selected some positions (at least $$$1$$$ and at most $$$m$$$) and swapped the letters in the two strings of this pair at the selected positions.For example, if $$$m = 6$$$ and two strings \"abcdef\" and \"xyzklm\" are in one pair and Cirno selected positions $$$2$$$, $$$3$$$ and $$$6$$$ she will swap 'b' with 'y', 'c' with 'z' and 'f' with 'm'. The resulting strings will be \"ayzdem\" and \"xbcklf\".Cirno then stole away the string without pair and shuffled all remaining strings in arbitrary order.AquaMoon found the remaining $$$n-1$$$ strings in complete disarray. Also, she remembers the initial $$$n$$$ strings. She wants to know which string was stolen, but she is not good at programming. Can you help her?",
    "prob_desc_output_spec": "For each test case print a single line with the stolen string.",
    "prob_desc_input_spec": "This problem is made as interactive. It means, that your solution will read the input, given by the interactor. But the interactor will give you the full input at the beginning and after that, you should print the answer. So you should solve the problem, like as you solve the usual, non-interactive problem because you won't have any interaction process. The only thing you should not forget is to flush the output buffer, after printing the answer. Otherwise, you can get an \"Idleness limit exceeded\" verdict. Refer to the interactive problems guide for the detailed information about flushing the output buffer. The input consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\leq t \\leq 100$$$) — the number of test cases. The first line of each test case contains two integers $$$n$$$, $$$m$$$ ($$$1 \\leq n \\leq 10^5$$$, $$$1 \\leq m \\leq 10^5$$$) — the number of strings and the length of each string, respectively. The next $$$n$$$ lines each contain a string with length $$$m$$$, describing the original $$$n$$$ strings. All string consists of lowercase Latin letters. The next $$$n-1$$$ lines each contain a string with length $$$m$$$, describing the strings after Cirno exchanged and reordered them. It is guaranteed that $$$n$$$ is odd and that the sum of $$$n \\cdot m$$$ over all test cases does not exceed $$$10^5$$$. Hack format: The first line should contain a single integer $$$t$$$. After that $$$t$$$ test cases should follow in the following format: The first line should contain two integers $$$n$$$ and $$$m$$$. The following $$$n$$$ lines should contain $$$n$$$ strings of length $$$m$$$, describing the original strings. The following $$$\\frac{n-1}{2}$$$ lines should describe the pairs. They should contain, in the following order: the index of the first string $$$i$$$ ($$$1 \\leq i \\leq n$$$), the index of the second string $$$j$$$ ($$$1 \\leq j \\leq n$$$, $$$i \\neq j$$$), the number of exchanged positions $$$k$$$ ($$$1 \\leq k \\leq m$$$), and the list of $$$k$$$ positions that are exchanged ($$$k$$$ distinct indices from $$$1$$$ to $$$m$$$ in any order). The final line should contain a permutation of integers from $$$1$$$ to $$$n$$$, describing the way the strings should be reordered. The strings will be placed in the order indices placed in this permutation, the stolen string index will be ignored.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3-64",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_086.jsonl",
    "code_uid": "2c40c76404794e5e6d40c596c8e74062",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n3 5\\naaaaa\\nbbbbb\\nccccc\\naaaaa\\nbbbbb\\n3 4\\naaaa\\nbbbb\\ncccc\\naabb\\nbbaa\\n5 6\\nabcdef\\nuuuuuu\\nkekeke\\nekekek\\nxyzklm\\nxbcklf\\neueueu\\nayzdem\\nukukuk\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys;input=sys.stdin.readline\r\nfor i in' '*int(input()):\r\n    n,m=map(int,input().split())\r\n    l=[set()for i in' '*m]\r\n    for i in range(n+n-1):\r\n        s=input().strip()\r\n        for i in range(m):\r\n            l[i]^={s[i]}\r\n    for i in l:print(*i,end='')\r\n    print()\r\n",
    "prob_desc_created_at": "1626012300",
    "tags": [
        "interactive",
        "math"
    ],
    "hidden_unit_tests": ""
}