{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"codeforces round letter round\", \"hbnyiyc joll joll un joll\"]",
    "src_uid": "edd556d60de89587f1b8daa893538530",
    "prob_desc_notes": null,
    "prob_desc_description": "You have a new professor of graph theory and he speaks very quickly. You come up with the following plan to keep up with his lecture and make notes.You know two languages, and the professor is giving the lecture in the first one. The words in both languages consist of lowercase English characters, each language consists of several words. For each language, all words are distinct, i.e. they are spelled differently. Moreover, the words of these languages have a one-to-one correspondence, that is, for each word in each language, there exists exactly one word in the other language having has the same meaning.You can write down every word the professor says in either the first language or the second language. Of course, during the lecture you write down each word in the language in which the word is shorter. In case of equal lengths of the corresponding words you prefer the word of the first language.You are given the text of the lecture the professor is going to read. Find out how the lecture will be recorded in your notes.",
    "prob_desc_output_spec": "Output exactly n words: how you will record the lecture in your notebook. Output the words of the lecture in the same order as in the input.",
    "prob_desc_input_spec": "The first line contains two integers, n and m (1 ≤ n ≤ 3000, 1 ≤ m ≤ 3000) — the number of words in the professor's lecture and the number of words in each of these languages. The following m lines contain the words. The i-th line contains two strings ai, bi meaning that the word ai belongs to the first language, the word bi belongs to the second language, and these two words have the same meaning. It is guaranteed that no word occurs in both languages, and each word occurs in its language exactly once. The next line contains n space-separated strings c1, c2, ..., cn — the text of the lecture. It is guaranteed that each of the strings ci belongs to the set of strings {a1, a2, ... am}. All the strings in the input are non-empty, each consisting of no more than 10 lowercase English letters.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_000.jsonl",
    "code_uid": "40a2a72adab2d9497e4db77cd8db391c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 3\\ncodeforces codesecrof\\ncontest round\\nletter message\\ncodeforces contest letter contest\", \"5 3\\njoll wuqrd\\neuzf un\\nhbnyiyc rsoqqveh\\nhbnyiyc joll joll euzf joll\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m = map(int, raw_input().split())\na = dict()\n\nfor i in xrange(m):\n        s1, s2 = raw_input().split()\n        if len(s2) < len(s1):\n                a[s1] = s2\n        else:\n                a[s1] = s1\n\nfor s in raw_input().split():\n        print a[s],\n",
    "prob_desc_created_at": "1419438600",
    "tags": [
        "implementation",
        "strings"
    ],
    "hidden_unit_tests": ""
}