{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1\", \"3\", \"11\", \"589\"]",
    "src_uid": "81ad3bb3d58a33016221d60a601790d4",
    "prob_desc_notes": "NoteIn the first sample the population can never change since all bacteria are of the same type.In the second sample three configurations are possible: \"ab\" (no attacks), \"aa\" (the first colony conquers the second colony), and \"bb\" (the second colony conquers the first colony).To get the answer for the third sample, note that more than one attack can happen.",
    "prob_desc_description": "Julia is conducting an experiment in her lab. She placed several luminescent bacterial colonies in a horizontal testtube. Different types of bacteria can be distinguished by the color of light they emit. Julia marks types of bacteria with small Latin letters \"a\", ..., \"z\".The testtube is divided into n consecutive regions. Each region is occupied by a single colony of a certain bacteria type at any given moment. Hence, the population of the testtube at any moment can be described by a string of n Latin characters.Sometimes a colony can decide to conquer another colony in one of the adjacent regions. When that happens, the attacked colony is immediately eliminated and replaced by a colony of the same type as the attacking colony, while the attacking colony keeps its type. Note that a colony can only attack its neighbours within the boundaries of the testtube. At any moment, at most one attack can take place.For example, consider a testtube with population \"babb\". There are six options for an attack that may happen next: the first colony attacks the second colony (1 → 2), the resulting population is \"bbbb\"; 2 → 1, the result is \"aabb\"; 2 → 3, the result is \"baab\"; 3 → 2, the result is \"bbbb\" (note that the result is the same as the first option); 3 → 4 or 4 → 3, the population does not change.The pattern of attacks is rather unpredictable. Julia is now wondering how many different configurations of bacteria in the testtube she can obtain after a sequence of attacks takes place (it is possible that no attacks will happen at all). Since this number can be large, find it modulo 109 + 7.",
    "prob_desc_output_spec": "Print one number — the answer to the problem modulo 109 + 7.",
    "prob_desc_input_spec": "The first line contains an integer n — the number of regions in the testtube (1 ≤ n ≤ 5 000). The second line contains n small Latin letters that describe the initial population of the testtube.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 2400,
    "file_name": "train_002.jsonl",
    "code_uid": "e204d0794eccffb22775a95fcc034f3c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\naaa\", \"2\\nab\", \"4\\nbabb\", \"7\\nabacaba\"]",
    "exec_outcome": "PASSED",
    "source_code": "from sys import stdin, stdout\nrr = lambda: stdin.readline().strip()\n\nMOD = 10**9 + 7\nfrom string import ascii_lowercase as alpha\nfrom itertools import groupby\nN = int(rr())\nS = rr()\nA = []\nfor k,v in groupby(S):\n    A.append(k)\nG = len(A)\n\nlast = {c: -1 for c in alpha}\nprev = [0]*G\nfor i, u in enumerate(A):\n    prev[i] = last[u]\n    last[u] = i\ndp = [+(prev[i] == -1) for i in xrange(G)]\ndps = [0]\nfor x in dp:\n    dps.append((dps[-1] + x)%MOD)\n\nfor i in xrange(N - 1):\n    for j in xrange(G):\n        dp[j] = (dp[j] + dps[j] - dps[prev[j] + 1]) % MOD\n    for j in xrange(G):\n        dps[j + 1] = (dps[j] + dp[j]) % MOD\n\nprint reduce(lambda x,y: (x+y)%MOD, dp)\n",
    "prob_desc_created_at": "1485108900",
    "tags": [
        "dp",
        "combinatorics",
        "string suffix structures",
        "brute force"
    ],
    "hidden_unit_tests": ""
}