{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"Yes\", \"No\", \"No\"]",
    "src_uid": "ac718922461f3187d8b7587c360b05fc",
    "prob_desc_notes": "NoteFor the first example, the desired setup can be produced by 3 operations, as is shown below.  For the second example, the desired setup cannot be produced, since in order to colour the center row, the third row and all columns must be selected in one operation, but after that no column can be selected again, hence it won't be possible to colour the other cells in the center column.",
    "prob_desc_description": "There is a rectangular grid of n rows of m initially-white cells each.Arkady performed a certain number (possibly zero) of operations on it. In the i-th operation, a non-empty subset of rows Ri and a non-empty subset of columns Ci are chosen. For each row r in Ri and each column c in Ci, the intersection of row r and column c is coloured black.There's another constraint: a row or a column can only be chosen at most once among all operations. In other words, it means that no pair of (i, j) (i &lt; j) exists such that  or , where  denotes intersection of sets, and  denotes the empty set.You are to determine whether a valid sequence of operations exists that produces a given final grid.",
    "prob_desc_output_spec": "If the given grid can be achieved by any valid sequence of operations, output \"Yes\"; otherwise output \"No\" (both without quotes). You can print each character in any case (upper or lower).",
    "prob_desc_input_spec": "The first line contains two space-separated integers n and m (1 ≤ n, m ≤ 50) — the number of rows and columns of the grid, respectively. Each of the following n lines contains a string of m characters, each being either '.' (denoting a white cell) or '#' (denoting a black cell), representing the desired setup.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_000.jsonl",
    "code_uid": "456f652ae22c55dd276ad82785506675",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5 8\\n.#.#..#.\\n.....#..\\n.#.#..#.\\n#.#....#\\n.....#..\", \"5 5\\n..#..\\n..#..\\n#####\\n..#..\\n..#..\", \"5 9\\n........#\\n#........\\n..##.#...\\n.......#.\\n....#.#.#\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m = map(int, input().split())\nst = []\nfor i in range(n):\n    s = input()\n    x = set()\n    for j in range(m):\n        if s[j] == '#':\n            x.add(j)\n    for i in st:\n        if len(i & x) > 0 and i != x:\n            print('No')\n            exit()\n    st.append(x)\nprint('Yes')\n",
    "prob_desc_created_at": "1521905700",
    "tags": [
        "implementation",
        "greedy"
    ],
    "hidden_unit_tests": ""
}