{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"3\", \"17 12\"]",
    "src_uid": "5dbf91f756fecb004c836a628eb23578",
    "prob_desc_notes": null,
    "prob_desc_description": "There are n cities numbered from 1 to n in Berland. Some of them are connected by two-way roads. Each road has its own length — an integer number from 1 to 1000. It is known that from each city it is possible to get to any other city by existing roads. Also for each pair of cities it is known the shortest distance between them. Berland Government plans to build k new roads. For each of the planned road it is known its length, and what cities it will connect. To control the correctness of the construction of new roads, after the opening of another road Berland government wants to check the sum of the shortest distances between all pairs of cities. Help them — for a given matrix of shortest distances on the old roads and plans of all new roads, find out how the sum of the shortest distances between all pairs of cities changes after construction of each road.",
    "prob_desc_output_spec": "Output k space-separated integers qi (1 ≤ i ≤ k). qi should be equal to the sum of shortest distances between all pairs of cities after the construction of roads with indexes from 1 to i. Roads are numbered from 1 in the input order. Each pair of cities should be taken into account in the sum exactly once, i. e. we count unordered pairs.",
    "prob_desc_input_spec": "The first line contains integer n (2 ≤ n ≤ 300) — amount of cities in Berland. Then there follow n lines with n integer numbers each — the matrix of shortest distances. j-th integer in the i-th row — di, j, the shortest distance between cities i and j. It is guaranteed that di, i = 0, di, j = dj, i, and a given matrix is a matrix of shortest distances for some set of two-way roads with integer lengths from 1 to 1000, such that from each city it is possible to get to any other city using these roads. Next line contains integer k (1 ≤ k ≤ 300) — amount of planned roads. Following k lines contain the description of the planned roads. Each road is described by three space-separated integers ai, bi, ci (1 ≤ ai, bi ≤ n, ai ≠ bi, 1 ≤ ci ≤ 1000) — ai and bi — pair of cities, which the road connects, ci — the length of the road. It can be several roads between a pair of cities, but no road connects the city with itself.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1900,
    "file_name": "train_039.jsonl",
    "code_uid": "b5659e3761998774fe228c5c3b1015fa",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n0 5\\n5 0\\n1\\n1 2 3\", \"3\\n0 4 5\\n4 0 9\\n5 9 0\\n2\\n2 3 8\\n1 2 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\nmt = [[] for _i in range(n)]\n\nfor i in range(n):\n    mt[i] = list(map(int,input().split()))\n\n# print(mt)\n\nkk = int(input())\nfor i in range(kk):\n    a,b,c = map(int,input().split())\n    a-=1\n    b-=1\n    if mt[a][b]>c:\n        mt[a][b] = c\n        mt[b][a] = c\n    \n    for i in range(n):\n        for j in range(n):\n            mt[i][j] = min(mt[i][j],mt[i][a]+mt[b][j]+c,mt[i][b]+mt[a][j]+c)\n    \n\n    ans = 0\n    for i in range(n):\n        ans+= sum(mt[i])\n    print(ans//2)",
    "prob_desc_created_at": "1280761200",
    "tags": [
        "shortest paths",
        "graphs"
    ],
    "hidden_unit_tests": ""
}