{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1\", \"3\"]",
    "src_uid": "a9cd99d74418b5f227b358a910496b02",
    "prob_desc_notes": null,
    "prob_desc_description": "Polycarpus just has been out of luck lately! As soon as he found a job in the \"Binary Cat\" cafe, the club got burgled. All ice-cream was stolen.On the burglary night Polycarpus kept a careful record of all club visitors. Each time a visitor entered the club, Polycarpus put down character \"+\" in his notes. Similarly, each time a visitor left the club, Polycarpus put character \"-\" in his notes. We know that all cases of going in and out happened consecutively, that is, no two events happened at the same time. Polycarpus doesn't remember whether there was somebody in the club at the moment when his shift begun and at the moment when it ended.Right now the police wonders what minimum number of distinct people Polycarpus could have seen. Assume that he sees anybody coming in or out of the club. Each person could have come in or out an arbitrary number of times.",
    "prob_desc_output_spec": "Print the sought minimum number of people",
    "prob_desc_input_spec": "The only line of the input contains a sequence of characters \"+\" and \"-\", the characters are written one after another without any separators. The characters are written in the order, in which the corresponding events occurred. The given sequence has length from 1 to 300 characters, inclusive.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_007.jsonl",
    "code_uid": "22633911b08897bb3e1397d3f2bffd8d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"+-+-+\", \"---\"]",
    "exec_outcome": "PASSED",
    "source_code": "s,l,h=[0]*3\nfor c in raw_input():\n  s+=1 if '+'==c else -1\n  l,h=min(l,s),max(h,s)\nprint h-l\n",
    "prob_desc_created_at": "1353339000",
    "tags": [
        "implementation",
        "greedy"
    ],
    "hidden_unit_tests": ""
}