{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"8 1\\n1\", \"5 2\\n2 5\"]",
    "src_uid": "b3418f53720fb9eb990d6e99b07fd61b",
    "prob_desc_notes": null,
    "prob_desc_description": " — Oh my sweet Beaverette, would you fancy a walk along a wonderful woodland belt with me?   — Of course, my Smart Beaver! Let us enjoy the splendid view together. How about Friday night? At this point the Smart Beaver got rushing. Everything should be perfect by Friday, so he needed to prepare the belt to the upcoming walk. He needed to cut down several trees.Let's consider the woodland belt as a sequence of trees. Each tree i is described by the esthetic appeal ai — some trees are very esthetically pleasing, others are 'so-so', and some trees are positively ugly!The Smart Beaver calculated that he needed the following effects to win the Beaverette's heart:   The first objective is to please the Beaverette: the sum of esthetic appeal of the remaining trees must be maximum possible;  the second objective is to surprise the Beaverette: the esthetic appeal of the first and the last trees in the resulting belt must be the same;  and of course, the walk should be successful: there must be at least two trees in the woodland belt left. Now help the Smart Beaver! Which trees does he need to cut down to win the Beaverette's heart?",
    "prob_desc_output_spec": "In the first line print two integers — the total esthetic appeal of the woodland belt after the Smart Beaver's intervention and the number of the cut down trees k. In the next line print k integers — the numbers of the trees the Beaver needs to cut down. Assume that the trees are numbered from 1 to n from left to right. If there are multiple solutions, print any of them. It is guaranteed that at least two trees have equal esthetic appeal.",
    "prob_desc_input_spec": "The first line contains a single integer n — the initial number of trees in the woodland belt, 2 ≤ n. The second line contains space-separated integers ai — the esthetic appeals of each tree. All esthetic appeals do not exceed 109 in their absolute value.   to get 30 points, you need to solve the problem with constraints: n ≤ 100 (subproblem A1);  to get 100 points, you need to solve the problem with constraints: n ≤ 3·105 (subproblems A1+A2). ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_025.jsonl",
    "code_uid": "7db7b6977c1a3341fc5ac8d61893c9ea",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5\\n1 2 3 1 2\", \"5\\n1 -2 3 1 -2\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\nfin = sys.stdin\n\nn = int(fin.readline())\na = list(map(int, fin.readline().split()))\n\ntable = dict()\ns = [0] * (n + 1)\nfor i in range(n):\n    rec = table.setdefault(a[i], { 'begin' : i, 'end' : i, 'sum' : a[i] })\n    rec['end'] = i\n    if a[i] >= 0:\n        s[i + 1] = s[i] + a[i]\n        rec['sum'] = s[rec['end'] + 1] - s[rec['begin']]\n    else:\n        s[i + 1] += s[i]\n        rec['sum'] = s[rec['end'] + 1] - s[rec['begin']] + 2 * a[i]\n\nms = max(v['sum'] for v in table.values() if v['begin'] != v['end'])\nfor mi in table.keys():\n    if table[mi]['sum'] == ms:\n        break\nmr = [i + 1 for i in range(n) if i < table[mi]['begin'] or i > table[mi]['end'] or table[mi]['begin'] < i < table[mi]['end'] and a[i] < 0]\n    \nprint(ms, len(mr))\nprint(' '.join(map(str, mr)))",
    "prob_desc_created_at": "1374075000",
    "tags": [
        "implementation",
        "brute force"
    ],
    "hidden_unit_tests": ""
}