{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"5\\n2002 2005 2006 2007 2010\", \"0\"]",
    "src_uid": "499ddfd7e0563e3ca8c71219e408650f",
    "prob_desc_notes": null,
    "prob_desc_description": "Petya works as a PR manager for a successful Berland company BerSoft. He needs to prepare a presentation on the company income growth since 2001 (the year of its founding) till now. Petya knows that in 2001 the company income amounted to a1 billion bourles, in 2002 — to a2 billion, ..., and in the current (2000 + n)-th year — an billion bourles. On the base of the information Petya decided to show in his presentation the linear progress history which is in his opinion perfect. According to a graph Petya has already made, in the first year BerSoft company income must amount to 1 billion bourles, in the second year — 2 billion bourles etc., each following year the income increases by 1 billion bourles. Unfortunately, the real numbers are different from the perfect ones. Among the numbers ai can even occur negative ones that are a sign of the company’s losses in some years. That is why Petya wants to ignore some data, in other words, cross some numbers ai from the sequence and leave only some subsequence that has perfect growth.Thus Petya has to choose a sequence of years y1, y2, ..., yk,so that in the year y1 the company income amounted to 1 billion bourles, in the year y2 — 2 billion bourles etc., in accordance with the perfect growth dynamics. Help him to choose the longest such sequence.",
    "prob_desc_output_spec": "Output k — the maximum possible length of a perfect sequence. In the next line output the sequence of years y1, y2, ..., yk. Separate the numbers by spaces. If the answer is not unique, output any. If no solution exist, output one number 0.",
    "prob_desc_input_spec": "The first line contains an integer n (1 ≤ n ≤ 100). The next line contains n integers ai ( - 100 ≤ ai ≤ 100). The number ai determines the income of BerSoft company in the (2000 + i)-th year. The numbers in the line are separated by spaces.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_004.jsonl",
    "code_uid": "6fcdacd147df4dc00a93a60b52858bf7",
    "prob_desc_memory_limit": "64 megabytes",
    "prob_desc_sample_inputs": "[\"10\\n-2 1 1 3 2 3 4 -10 -2 5\", \"3\\n-1 -2 -3\"]",
    "exec_outcome": "PASSED",
    "source_code": "n=int(input())\na=list(map(int,input().split()))\nx=1\nb=[]\nold=0\nwhile True:\n    f=False\n    for i in range(old,n):\n        if x==a[i]:\n            old=i\n            f=True\n            break\n    if not f:\n        break    \n    b.append(old+2001)\n    x+=1\nprint(len(b))\nprint(*b)\n",
    "prob_desc_created_at": "1287904200",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}