{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1\", \"1\"]",
    "src_uid": "8d7355b3f6aebe43c7975744263f5cf8",
    "prob_desc_notes": null,
    "prob_desc_description": "Vasya thinks that lucky tickets are the tickets whose numbers are divisible by 3. He gathered quite a large collection of such tickets but one day his younger brother Leonid was having a sulk and decided to destroy the collection. First he tore every ticket exactly in two, but he didn’t think it was enough and Leonid also threw part of the pieces away. Having seen this, Vasya got terrified but still tried to restore the collection. He chose several piece pairs and glued each pair together so that each pair formed a lucky ticket. The rest of the pieces Vasya threw away reluctantly. Thus, after the gluing of the 2t pieces he ended up with t tickets, each of which was lucky.When Leonid tore the tickets in two pieces, one piece contained the first several letters of his number and the second piece contained the rest.Vasya can glue every pair of pieces in any way he likes, but it is important that he gets a lucky ticket in the end. For example, pieces 123 and 99 can be glued in two ways: 12399 and 99123.What maximum number of tickets could Vasya get after that?",
    "prob_desc_output_spec": "Print the single number — the maximum number of lucky tickets that will be able to be restored. Don't forget that every lucky ticket is made of exactly two pieces glued together.",
    "prob_desc_input_spec": "The first line contains integer n (1 ≤ n ≤ 104) — the number of pieces. The second line contains n space-separated numbers ai (1 ≤ ai ≤ 108) — the numbers on the pieces. Vasya can only glue the pieces in pairs. Even if the number of a piece is already lucky, Vasya should glue the piece with some other one for it to count as lucky. Vasya does not have to use all the pieces. The numbers on the pieces an on the resulting tickets may coincide.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_012.jsonl",
    "code_uid": "7fc59604bf2c320452508c2331a579b7",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n123 123 99\", \"6\\n1 1 1 23 10 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "I=lambda:map(int, raw_input().split())\nn = input()\na = I()\nc0, c1, c2 = 0, 0, 0\nfor x in a:\n    if x % 3 == 0: c0 += 1\n    elif x %3 == 1: c1 += 1\n    else: c2 += 1\nprint c0 / 2 + min(c1, c2)\n",
    "prob_desc_created_at": "1291046400",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}