{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"3\", \"6\", \"3\"]",
    "src_uid": "d02e8f3499c4eca03e0ae9c23f80dc95",
    "prob_desc_notes": "NoteIn the first sample the editor contains four lines. Let's represent the cursor's possible positions in the line as numbers. Letter s represents the cursor's initial position, letter t represents the last one. Then all possible positions of the cursor in the text editor are described by the following table.12312123s5671t345One of the possible answers in the given sample is: \"Left\", \"Down\", \"Left\".",
    "prob_desc_description": "Vasya is pressing the keys on the keyboard reluctantly, squeezing out his ideas on the classical epos depicted in Homer's Odysseus... How can he explain to his literature teacher that he isn't going to become a writer? In fact, he is going to become a programmer. So, he would take great pleasure in writing a program, but none — in writing a composition.As Vasya was fishing for a sentence in the dark pond of his imagination, he suddenly wondered: what is the least number of times he should push a key to shift the cursor from one position to another one?Let's describe his question more formally: to type a text, Vasya is using the text editor. He has already written n lines, the i-th line contains ai characters (including spaces). If some line contains k characters, then this line overall contains (k + 1) positions where the cursor can stand: before some character or after all characters (at the end of the line). Thus, the cursor's position is determined by a pair of integers (r, c), where r is the number of the line and c is the cursor's position in the line (the positions are indexed starting from one from the beginning of the line).Vasya doesn't use the mouse to move the cursor. He uses keys \"Up\", \"Down\", \"Right\" and \"Left\". When he pushes each of these keys, the cursor shifts in the needed direction. Let's assume that before the corresponding key is pressed, the cursor was located in the position (r, c), then Vasya pushed key: \"Up\": if the cursor was located in the first line (r = 1), then it does not move. Otherwise, it moves to the previous line (with number r - 1), to the same position. At that, if the previous line was short, that is, the cursor couldn't occupy position c there, the cursor moves to the last position of the line with number r - 1; \"Down\": if the cursor was located in the last line (r = n), then it does not move. Otherwise, it moves to the next line (with number r + 1), to the same position. At that, if the next line was short, that is, the cursor couldn't occupy position c there, the cursor moves to the last position of the line with number r + 1; \"Right\": if the cursor can move to the right in this line (c &lt; ar + 1), then it moves to the right (to position c + 1). Otherwise, it is located at the end of the line and doesn't move anywhere when Vasya presses the \"Right\" key; \"Left\": if the cursor can move to the left in this line (c &gt; 1), then it moves to the left (to position c - 1). Otherwise, it is located at the beginning of the line and doesn't move anywhere when Vasya presses the \"Left\" key.You've got the number of lines in the text file and the number of characters, written in each line of this file. Find the least number of times Vasya should push the keys, described above, to shift the cursor from position (r1, c1) to position (r2, c2).",
    "prob_desc_output_spec": "Print a single integer — the minimum number of times Vasya should push a key to move the cursor from position (r1, c1) to position (r2, c2).",
    "prob_desc_input_spec": "The first line of the input contains an integer n (1 ≤ n ≤ 100) — the number of lines in the file. The second line contains n integers a1, a2, ..., an (0 ≤ ai ≤ 105), separated by single spaces. The third line contains four integers r1, c1, r2, c2 (1 ≤ r1, r2 ≤ n, 1 ≤ c1 ≤ ar1 + 1, 1 ≤ c2 ≤ ar2 + 1).",
    "prob_desc_output_to": "output.txt",
    "prob_desc_input_from": "input.txt",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_020.jsonl",
    "code_uid": "a01148c00811822eb4c96527236a3705",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\n2 1 6 4\\n3 4 4 2\", \"4\\n10 5 6 4\\n1 11 4 2\", \"3\\n10 1 10\\n1 10 1 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "from collections import deque\n\n\ndef read(line):\n    return [int(c) for c in line.split()]\n\n\ndef solve(n, lines, r1, c1, r2, c2):\n    queue = deque([(r1, c1, 0)])\n    visited = {}\n    while queue:\n        r, c, cost = queue.pop()\n\n        if (r, c) not in visited:\n            visited[(r, c)] = cost\n        else:\n            if cost < visited[(r, c)]:\n                visited[(r, c)] = cost\n            else:\n                continue\n\n        # left or right to the target column\n        if c2 <= lines[r - 1] + 1:\n            queue.appendleft((r, c2, cost + abs(c - c2)))\n\n        # right to last column\n        last_pos = lines[r - 1] + 1\n        if c < last_pos:\n            queue.appendleft((r, last_pos, cost + abs(c - last_pos)))\n\n        # up\n        if r - 1 >= 1:\n            last_pos_prev = lines[r - 2] + 1\n            if last_pos_prev >= c:\n                queue.appendleft((r - 1, c, cost + 1))\n            else:\n                queue.appendleft((r - 1, last_pos_prev, cost + 1))\n\n        # down\n        if r + 1 <= n:\n            last_pos_next = lines[r] + 1\n            if last_pos_next >= c:\n                queue.appendleft((r + 1, c, cost + 1))\n            else:\n                queue.appendleft((r + 1, last_pos_next, cost + 1))\n\n    return visited[(r2, c2)]\n\n\ndef main():\n    with open('input.txt') as f:\n        test = f.readlines()\n\n    n, = read(test[0])\n    lines = read(test[1])\n    r1, c1, r2, c2 = read(test[2])\n    ans = solve(n, lines, r1, c1, r2, c2)\n    with open('output.txt', 'w') as f:\n        f.write(str(ans))\n\n\nif __name__ == \"__main__\":\n    main()\n",
    "prob_desc_created_at": "1354960800",
    "tags": [
        "greedy",
        "graphs",
        "shortest paths",
        "data structures",
        "dfs and similar"
    ],
    "hidden_unit_tests": ""
}