{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\", \"0\", \"0\", \"999999999999999999\"]",
    "src_uid": "b34846d90dc011f2ef37a8256202528a",
    "prob_desc_notes": "NoteIn the first sample, Vasiliy could have missed one supper, for example, in case he have arrived before breakfast, have been in the sanatorium for two days (including the day of arrival) and then have left after breakfast on the third day. In the second sample, Vasiliy could have arrived before breakfast, have had it, and immediately have left the sanatorium, not missing any meal.In the third sample, Vasiliy could have been in the sanatorium for one day, not missing any meal. ",
    "prob_desc_description": "Vasiliy spent his vacation in a sanatorium, came back and found that he completely forgot details of his vacation! Every day there was a breakfast, a dinner and a supper in a dining room of the sanatorium (of course, in this order). The only thing that Vasiliy has now is a card from the dining room contaning notes how many times he had a breakfast, a dinner and a supper (thus, the card contains three integers). Vasiliy could sometimes have missed some meal, for example, he could have had a breakfast and a supper, but a dinner, or, probably, at some days he haven't been at the dining room at all.Vasiliy doesn't remember what was the time of the day when he arrived to sanatorium (before breakfast, before dinner, before supper or after supper), and the time when he left it (before breakfast, before dinner, before supper or after supper). So he considers any of these options. After Vasiliy arrived to the sanatorium, he was there all the time until he left. Please note, that it's possible that Vasiliy left the sanatorium on the same day he arrived.According to the notes in the card, help Vasiliy determine the minimum number of meals in the dining room that he could have missed. We shouldn't count as missed meals on the arrival day before Vasiliy's arrival and meals on the departure day after he left.",
    "prob_desc_output_spec": "Print single integer — the minimum possible number of meals which Vasiliy could have missed during his vacation. ",
    "prob_desc_input_spec": "The only line contains three integers b, d and s (0 ≤ b, d, s ≤ 1018,  b + d + s ≥ 1) — the number of breakfasts, dinners and suppers which Vasiliy had during his vacation in the sanatorium. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_002.jsonl",
    "code_uid": "b2b1b781e3731b44602a8a7c4b25bb8b",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 2 1\", \"1 0 0\", \"1 1 1\", \"1000000000000000000 0 1000000000000000000\"]",
    "exec_outcome": "PASSED",
    "source_code": "m = map(long, raw_input().split())\nmaxV = max(m)\na = [maxV-1] * 3\nidx = 0\nfor i in range(3):\n    if maxV == m[i]:\n        idx = i\n        break\n\na[idx] = maxV\n\nret = 0\nfor i in range(3):\n    if a[i] - m[i] > 0:\n        ret += a[i] - m[i]\nprint ret",
    "prob_desc_created_at": "1476714900",
    "tags": [
        "greedy",
        "constructive algorithms",
        "math",
        "implementation",
        "binary search"
    ],
    "hidden_unit_tests": ""
}