{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"4\", \"9\"]",
    "src_uid": "016e00b2b960be792d4ec7fcfb7976e2",
    "prob_desc_notes": null,
    "prob_desc_description": "Many computer strategy games require building cities, recruiting army, conquering tribes, collecting resources. Sometimes it leads to interesting problems. Let's suppose that your task is to build a square city. The world map uses the Cartesian coordinates. The sides of the city should be parallel to coordinate axes. The map contains mines with valuable resources, located at some points with integer coordinates. The sizes of mines are relatively small, i.e. they can be treated as points. The city should be built in such a way that all the mines are inside or on the border of the city square. Building a city takes large amount of money depending on the size of the city, so you have to build the city with the minimum area. Given the positions of the mines find the minimum possible area of the city.",
    "prob_desc_output_spec": "Print the minimum area of the city that can cover all the mines with valuable resources.",
    "prob_desc_input_spec": "The first line of the input contains number n — the number of mines on the map (2 ≤ n ≤ 1000). Each of the next n lines contains a pair of integers xi and yi — the coordinates of the corresponding mine ( - 109 ≤ xi, yi ≤ 109). All points are pairwise distinct.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_003.jsonl",
    "code_uid": "4a92d0ba52617b5ad406854d11bb33b4",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n0 0\\n2 2\", \"2\\n0 0\\n0 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "a, b = [], []\n\nfor i in range(int(input())):\n    x, y = map(int, input().split())\n    a.append(x)\n    b.append(y)\n    \nprint(max(max(a)-min(a), max(b)-min(b))**2)",
    "prob_desc_created_at": "1415205000",
    "tags": [
        "greedy",
        "brute force"
    ],
    "hidden_unit_tests": ""
}