{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"2 home car \\n1 brother\", \"2 armchair quetzalcoatl \\n2 pilotage defibrillator\"]",
    "src_uid": "2733797c5dd5b9d9e0bf9fe786c3120a",
    "prob_desc_notes": null,
    "prob_desc_description": "Let's consider the famous game called Boom (aka Hat) with simplified rules.There are n teams playing the game. Each team has two players. The purpose of the game is to explain the words to the teammate without using any words that contain the same root or that sound similarly. Player j from team i (1 ≤ i ≤ n, 1 ≤ j ≤ 2) is characterized by two numbers: aij and bij. The numbers correspondingly represent the skill of explaining and the skill of understanding this particular player has. Besides, m cards are used for the game. Each card has a word written on it. The card number k (1 ≤ k ≤ m) is characterized by number ck — the complexity of the word it contains.Before the game starts the cards are put in a deck and shuffled. Then the teams play in turns like that: the 1-st player of the 1-st team, the 1-st player of the 2-nd team, ... , the 1-st player of the n-th team, the 2-nd player of the 1-st team, ... , the 2-nd player of the n-th team, the 1-st player of the 1-st team and so on.Each turn continues for t seconds. It goes like that: Initially the time for each turn is t. While the time left to a player is more than 0, a player takes a card from the top of the deck and starts explaining the word it has to his teammate. The time needed for the j-th player of the i-th team to explain the word from the card k to his teammate (the q-th player of the i-th team) equals max(1, ck - (aij + biq) - dik) (if j = 1,  then q = 2,  else q = 1). The value dik is the number of seconds the i-th team has already spent explaining the word k during the previous turns. Initially, all dik equal 0. If a team manages to guess the word before the end of the turn, then the time given above is substracted from the duration of the turn, the card containing the guessed word leaves the game, the team wins one point and the game continues. If the team doesn't manage to guess the word, then the card is put at the bottom of the deck, dik increases on the amount of time of the turn, spent on explaining the word. Thus, when this team gets the very same word, they start explaining it not from the beginning, but from the point where they stopped. The game ends when words from all m cards are guessed correctly.You are given n teams and a deck of m cards. You should determine for each team, how many points it will have by the end of the game and which words the team will have guessed.",
    "prob_desc_output_spec": "Print n lines. On the i-th line first print number si the number of points the i-th team wins. Then print si space-separated words — the words from the cards guessed by team i in the order in which they were guessed.",
    "prob_desc_input_spec": "The first line contains two integers n, t (1 ≤ n, t ≤ 100), which correspondingly denote the number of teams and a turn's duration. Next n lines of the input file contain four integers each: ai1, bi1, ai2, bi2 (1 ≤ aij, bij ≤ 100) — the skills of the first and the second player of the i-th team. The teams are given in the order in which they play. The next line of the input file contains integer m (1 ≤ m ≤ 100) the number of cards. Next 2m lines contain the cards' descriptions. Two lines describe each card. The first line of the description contains the word that consists of no more than 20 characters. The words only contain small Latin letters. The second line of the description contains an integer ck (1 ≤ ck ≤ 100) — the complexity of the word written on the k-th card. The cards are listed in the order in which the lie in the deck from top to bottom. The words on all cards are different.",
    "prob_desc_output_to": "output.txt",
    "prob_desc_input_from": "input.txt",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_050.jsonl",
    "code_uid": "aae84f2e2a41624e44f806c142d81b92",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2 2\\n1 1 1 1\\n1 1 1 1\\n3\\nhome\\n1\\ncar\\n1\\nbrother\\n1\", \"2 4\\n1 2 2 1\\n2 3 2 2\\n4\\narmchair\\n3\\nquetzalcoatl\\n10\\npilotage\\n5\\ndefibrillator\\n7\"]",
    "exec_outcome": "PASSED",
    "source_code": "from collections import deque\n\nstdin = open('input.txt', 'r')\nstdout = open('output.txt', 'w')\n\nn,t = [int(x) for x in stdin.readline().split()]\n\nteams = []\n\nfor x in range(n):\n    a1,b1,a2,b2 = [int(x) for x in stdin.readline().split()]\n    teams.append([(a1,b1), (a2,b2)])\n\nm = int(stdin.readline())\n\ndeck = deque()\n\ncs = {}\n\nfor x in range(m):\n    word = stdin.readline().strip()\n    c = int(stdin.readline())\n\n    cs[word] = [c for y in range(n)]\n    deck.append(word)\n\nteam = 0\nexp = 0\nund = 1\n\nwins = [[] for x in range(n)]\n\nwhile deck:\n    time = t\n    cTeam = teams[team]\n    while time > 0 and deck:\n        word = deck.popleft()\n        c = cs[word][team]\n        val = max(c - cTeam[exp][0] - cTeam[und][1], 1)\n        #print(time,c,word,cTeam, exp, val)\n        if val <= time:\n            #print('win', team, word)\n            wins[team].append(word)\n            time -= val\n        else:\n            cs[word][team] -= time\n            deck.append(word)\n            time = 0\n    team += 1\n    if team == n:\n        team = 0\n        exp = (exp+1)%2\n        und = (und+1)%2\n\nfor x in wins:\n    stdout.write(str(len(x)) + ' ' + ' '.join(x) + '\\n')\n",
    "prob_desc_created_at": "1318919400",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}