{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[]",
    "src_uid": "d163975cdad000ce89ee251ef9129779",
    "prob_desc_notes": null,
    "prob_desc_description": "The Smart Beaver from ABBYY came up with another splendid problem for the ABBYY Cup participants! This time the Beaver invites the contest participants to check out a problem on sorting documents by their subjects. Let's describe the problem:You've got some training set of documents. For each document you know its subject. The subject in this problem is an integer from 1 to 3. Each of these numbers has a physical meaning. For instance, all documents with subject 3 are about trade.You can download the training set of documents at the following link: http://download4.abbyy.com/a2/X2RZ2ZWXBG5VYWAL61H76ZQM/train.zip. The archive contains three directories with names \"1\", \"2\", \"3\". Directory named \"1\" contains documents on the 1-st subject, directory \"2\" contains documents on the 2-nd subject, and directory \"3\" contains documents on the 3-rd subject. Each document corresponds to exactly one file from some directory.All documents have the following format: the first line contains the document identifier, the second line contains the name of the document, all subsequent lines contain the text of the document. The document identifier is used to make installing the problem more convenient and has no useful information for the participants.You need to write a program that should indicate the subject for a given document. It is guaranteed that all documents given as input to your program correspond to one of the three subjects of the training set.",
    "prob_desc_output_spec": "Print an integer from 1 to 3, inclusive — the number of the subject the given document corresponds to.",
    "prob_desc_input_spec": "The first line contains integer id (0 ≤ id ≤ 106) — the document identifier. The second line contains the name of the document. The third and the subsequent lines contain the text of the document. It is guaranteed that the size of any given document will not exceed 10 kilobytes. The tests for this problem are divided into 10 groups. Documents of groups 1 and 2 are taken from the training set, but their identifiers will not match the identifiers specified in the training set. Groups from the 3-rd to the 10-th are roughly sorted by the author in ascending order of difficulty (these groups contain documents which aren't present in the training set).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 2000,
    "file_name": "train_039.jsonl",
    "code_uid": "15c2f8b4b62a99d5d7bd6faccc4239ad",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[]",
    "exec_outcome": "PASSED",
    "source_code": "#path = \"D:\\\\train\\\\\"\n#res = {}\n#for i in xrange(1, 4):\n    #for j in xrange(1, 51):\n        #file = open(path + str(i) + '\\\\' + (\"%.03d\" % j) + '.txt')\n        #s1 = file.readline()\n        #s1 = file.readline()\n        #res[s1[:-1]] = i\n#print res\n\ns = {'U.S. M-1 MONEY SUPPLY RISES 1.2 BILLION DLR': 2, 'BRITISH, FRENCH MINISTERS DISCUSS PUBLIC SPENDING': 1, 'U.S. BUSINESS LOANS FELL 822 MLN DLRS': 2, 'TREASURY BALANCES AT FED ROSE ON FEB 27': 2, 'BANK OF SPAIN SUSPENDS ASSISTANCE': 1, 'TOKYO BIDS TO STOP CHIP ROW TURNING INTO TRADE WAR': 3, \"U.S./JAPAN TRADE WAR NOT IN UK'S INTEREST - LAWSON\": 3, 'THAI M-1 MONEY SUPPLY RISES IN JANUARY': 2, 'OFFICIAL WANTS ARAB FUND TO HELP LEBANESE POUND': 1, \"TREASURY'S BAKER SEES SMALLER TRADE DEFICIT\": 3, 'U.K. MONEY MARKET DEFICIT REVISED DOWNWARDS': 1, 'EUROPEAN COMMUNITY TO SET UP OFFICE IN PEKING': 3, 'WHITE HOUSE DISCOUNTS THREAT OF TRADE WAR': 3, 'TOKYO BIDS TO STOP CHIP ROW BECOMING TRADE WAR': 3, 'UK MONEY MARKET GIVEN FURTHER 570 MLN STG HELP': 1, 'BALDRIGE PREDICTS END OF U.S.-JAPAN TRADE DISPUTE': 3, 'JAPAN TO CUT MICROCHIP OUTPUT, BOOST IMPORTS': 3, 'CANADIAN MONEY SUPPLY FALLS IN WEEK': 2, 'U.K. EXPORTS BODY GETS NEW EXECUTIVE DIRECTOR': 3, 'U.S. OFFICIAL TO VISIT JAPAN AS TRADE ROW GROWS': 3, 'SOVIET UNION SEEN WATCHING CHINA GATT APPLICATION': 3, 'CHINA POSTPONES PLAN TO SCRAP PARALLEL CURRENCY': 1, 'N.Z. CENTRAL BANK SEES SLOWER MONEY, CREDIT GROWTH': 2, \"JAPAN'S CHIP MAKERS ANGERED BY U.S. SANCTION PLANS\": 3, 'FED ADDS RESERVES VIA CUSTOMER REPURCHASES': 1, 'BALDRIGE SAYS U.S. TO IMPOSE JAPANESE SANCTIONS': 3, 'N.Z. TRADING BANK DEPOSIT GROWTH RISES SLIGHTLY': 2, \"TREASURY'S BAKER PURSUING S. ASIAN REVALUATIONS\": 1, 'FORMER TREASURY OFFICIAL URGES CURRENCY REFORMS': 1, 'U.S. BANK DISCOUNT BORROWINGS 310 MLN DLRS': 2, 'U.S. BUSINESS LOANS FALL 618 MLN DLRS': 2, 'BANK OF FRANCE AGAIN BUYING DOLLARS, SOURCES SAY': 1, 'WHITE HOUSE UNIT DECIDES ON SEMICONDUCTORS': 3, 'FRENCH JANUARY M-3 MONEY SUPPLY RISES ONE PCT': 2, 'TREASURY BALANCES AT FED ROSE ON APRIL 6': 2, 'INDIA STEPS UP COUNTERTRADE DEALS TO CUT TRADE GAP': 3, \"TREASURY'S BAKER NOT CONCERNED BY BOND DECLINES\": 3, 'ASIAN DOLLAR MARKET ASSETS FALL IN JANUARY': 1, 'TRADE FRICTION THREATENS TO TOPPLE NAKASONE': 3, 'U.S. M-1 MONEY SUPPLY FALLS 600 MLN DLRS': 2, 'NAKASONE TO VISIT WASHINGTON IN LATE APRIL': 3, 'U.K. MONEY MARKET GIVEN 265 MLN STG ASSISTANCE': 1, 'U.S. TRADE OFFICIAL SAYS JAPAN ACTION FOOLISH': 3, 'U.S. FED EXPLORES COMMODITY BASKET INDEX': 1, 'ARAB FOREX ASSOCIATION ELECTS NEW CHAIRMAN': 1, \"TRADE WAR FEARS MAY PROMPT STOCK MARKETS' DOWNTURN\": 3, 'ENVOY ADVISES NAKASONE TO PREPARE FOR U.S. VISIT': 3, 'U.S. STOCK MARKET OVERREACTS TO TARIFFS - YEUTTER': 3, 'SENIOR U.S. OFFICIAL TO VISIT JAPAN AS TRADE ROW GROWS': 3, 'U.K. CONFIRMS JANUARY STERLING M3 RISE': 2, 'U.S. CREDIT MARKETS END UNDER EXTREME PRESSURE': 1, 'TREASURY BALANCES AT FED FELL ON MARCH 27': 1, ' EUROPE ON SIDELINES IN U.S-JAPAN MICROCHIP ROW': 3, 'THATCHER SAYS TRADE TARGETS SET WITH MOSCOW': 3, 'JAPAN PERSONAL SAVINGS SOAR IN 1986': 2, 'CALL MONEY PRESSURE FROM LARGE GERMAN BANKS': 1, 'NEW YORK BUSINESS LOANS FALL 718 MLN DLRS': 2, 'REAGAN READY TO IMPOSE TRADE CURBS AGAINST JAPAN': 3, 'U.S. BUSINESS LOANS RISE 377 MLN DLRS': 2, 'ARAB BANKER SAYS TOO SOON FOR SINGLE CURRENCY': 1, 'GATT WARNS U.S. ON FEDERAL BUDGET, PROTECTIONISM': 3, 'UK MAY REVOKE JAPANESE FINANCIAL LICENSES': 3, 'U.K. MONEY MARKET GIVEN FURTHER 663 MLN STG HELP': 1, 'BROADER U.S. EEP SOUGHT BY REPUBLICAN LAWMAKERS': 3, 'CHIRAC, REAGAN DISCUSS ARMS CONTROL, TRADE': 3, 'FED BUYS ONE BILLION DLRS OF BILLS FOR CUSTOMER': 1, 'SOUTH KOREAN MONEY SUPPLY RISES IN FEBRUARY': 2, 'H.K. M3 MONEY SUPPLY RISES 1.4 PCT IN FEBRUARY': 2, 'N.Z. MONEY SUPPLY RISES 3.6 PCT IN DECEMBER': 2, 'SOUTH KOREAN MONEY SUPPLY FALLS IN MARCH': 2, 'BUNDESBANK BOUGHT DOLLARS AGAINST YEN, DEALERS SAY': 1, 'TREASURY BALANCES AT FED FELL ON MARCH 10': 2, 'FED DATA SUGGEST STABLE U.S. MONETARY POLICY': 2, 'BELGIAN SAYS EC WOULD REACT TO TEXTILE BILL': 3, 'WORLD BANK CHIEF URGES MORE JAPANESE INVESTMENT': 3, 'ASSETS OF U.S. MONEY FUNDS ROSE IN WEEK': 2, 'YUGOSLAV TRADE FALLS SHARPLY  STATISTICS SHOW': 3, 'WHITE HOUSE PANEL SAID URGING JAPAN RETALIATION': 3, 'SINGAPORE BANK CREDIT RISES IN JANUARY': 2, 'CURRENCY FUTURES CLIMB LIKELY TO BE CHECKED': 1, 'FORMER HERSTATT DEALER CAN BE SUED, COURT RULES': 1, 'U.S. MONEY GROWTH SLOWS SHARPLY, ECONOMISTS SAY': 2, 'U.S.-JAPAN NOT IN TRADE WAR, YEUTTER SAYS': 3, 'NAKASONE HARD-PRESSED TO SOOTHE U.S ANGER ON TRADE': 3, 'U.K. MONEY MARKET DEFICIT FORECAST AT 700 MLN STG': 1, 'ROSTENKOWSKI OPPOSES PROTECTIONIST TRADE BILL': 3, 'DUTCH MONEY SUPPLY HARDLY CHANGED IN DECEMBER': 2, 'BANK OF ENGLAND FORECASTS SURPLUS IN MONEY MARKET': 1, 'U.K. MONEY MARKET OFFERED EARLY ASSISTANCE': 1, \"TAIWAN'S SECOND QUARTER IMPORTS SEEN RISING\": 3, 'TREASURY BALANCES AT FED FELL ON MARCH 5': 2, 'FEBRUARY FOMC VOTES UNCHANGED MONETARY POLICY': 2, 'U.K. MONEY MARKET SHORTAGE FORECAST REVISED UP': 1, 'JAPAN CONDUCTS CURRENCY SURVEY OF BIG INVESTORS': 1, \"SPAIN RAISES BANKS' RESERVE REQUIREMENT\": 2, 'EC APPROVES MEDITERRANEAN FINANCIAL PACKAGES': 3, 'JAPANESE SEEN LIGHTENING U.S. BOND HOLDINGS': 1, 'BANGLADESH MONEY SUPPLY RISES IN DECEMBER': 2, 'ITALY M-2 UP 2.8 PCT IN 3 MONTHS TO END JANUARY': 2, 'CHINA CALLS FOR BETTER TRADE DEAL WITH U.S.': 3, 'BELGIAN MONEY SUPPLY RISES IN FOURTH QUARTER 1986': 2, 'JAPAN WILL ASK COMPANIES TO BOOST IMPORTS': 3, 'U.K. MONEY MARKET GIVEN 129 MLN STG ASSISTANCE': 1, 'NAKASONE SOUNDS CONCILIATORY NOTE IN CHIP DISPUTE': 3, 'U.S. M-1 MONEY SUPPLY RISES 1.9 BILLION DLRS': 2, 'TREASURY BALANCES AT FED ROSE ON MARCH 6': 2, 'U.K. MONEY MARKET GIVEN 689 MLN STG EARLY HELP': 1, 'GERMAN FEBRUARY CENTRAL BANK MONEY GROWTH STEADY': 2, 'U.K. CONFIRMS FEBRUARY STERLING M3 RISE': 2, 'JAPAN CAREFULLY CONSIDERING MONEY POLICY -- SUMITA': 1, 'U.S. M-1 MONEY SUPPLY ROSE 2.1 BILLION DLRS': 2, \"TREASURY'S BAKER SAYS COOPERATION WORKING\": 1, \"PHILIPPINES' LIQUIDITY RISES, LOAN DEMAND FALLS\": 2, 'BANGEMANN CALLS FOR CURRENCY CALM': 1, 'AUSTRIA DOES NOT INTERVENE TO SUPPORT DOLLAR': 1, 'ISLAMIC BANKS ESTABLISH 50 MLN DLR TRADE PORTFOLIO': 3, 'AUSTRALIAN BROAD MONEY GROWTH 10.3 PCT IN FEBRUARY': 2, 'TAIWAN ISSUES MORE CERTIFICATES OF DEPOSIT': 2, 'GERMAN CAPITAL ACCOUNT IN DEFICIT IN FEBRUARY': 2, \"TREASURY'S BAKER SAYS U.S. BACKS STABILITY\": 1, 'U.K. MONEY MARKET GIVEN 215 MLN STG LATE HELP': 1, 'JAPAN FEBRUARY MONEY SUPPLY RISES 8.8 PCT': 2, 'U.S. SENATE LEADERS SEE NO TRADE WAR BREWING': 3, 'SINGAPORE M-1 MONEY SUPPLY 2.7 PCT UP IN JANUARY': 2, 'CANADIAN MONEY SUPPLY RISES IN WEEK': 2, 'TAIWAN ISSUES MORE CDS TO CURB MONEY SUPPLY GROWTH': 2, 'FED WILL BUY BILLS FOR CUSTOMER AFTER AUCTION': 1, 'TAIWAN TO STUDY SUSPENDING FOREX CONTROLS': 1, 'ECONOMIC SPOTLIGHT - U.S. CONGRESS RAPS JAPAN': 3, 'BAHRAIN INTRODUCES NEW MONEY MARKET REGIME': 1, \"SPAIN'S MONEY SUPPLY GROWTH DOUBLES IN FEBRUARY\": 2, 'JAPAN HAS LITTLE NEW TO OFFER IN MICROCHIP DISPUTE': 3, 'U.S. OFFICIAL SEES EVIDENCE OF EXPORT GROWTH': 3, 'NEW YORK BUSINESS LOANS FALL 222 MLN DLRS': 2, 'BANK OF ENGLAND DOES NOT OPERATE IN MONEY MARKET': 1, \"U.S. TREASURY'S BAKER SEES RATE STABILITY\": 1, 'SINGAPORE M-1 MONEY SUPPLY UP 3.7 PCT IN DECEMBER': 2, 'JAPAN CAREFULLY CONSIDERING MONEY POLICY - SUMITA': 1, 'PHILADELPHIA EXCHANGE TO EXTEND HOURS FOR ASIA': 1}\na = raw_input()\na = raw_input()\nif a in s:\n    print s[a]\nelse:\n    print 3\n\n\n",
    "prob_desc_created_at": "1341730800",
    "tags": [],
    "hidden_unit_tests": ""
}