{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"5\", \"3\"]",
    "src_uid": "482b3ebbbadd583301f047181c988114",
    "prob_desc_notes": "NoteIn the first sample case if one will decrease the second element value to 2 and the fifth element value to 4 then the mex value of resulting array 1 2 3 3 4 will be equal to 5.To reach the answer to the second sample case one must not decrease any of the array elements.",
    "prob_desc_description": "Someone gave Alyona an array containing n positive integers a1, a2, ..., an. In one operation, Alyona can choose any element of the array and decrease it, i.e. replace with any positive integer that is smaller than the current one. Alyona can repeat this operation as many times as she wants. In particular, she may not apply any operation to the array at all.Formally, after applying some operations Alyona will get an array of n positive integers b1, b2, ..., bn such that 1 ≤ bi ≤ ai for every 1 ≤ i ≤ n. Your task is to determine the maximum possible value of mex of this array.Mex of an array in this problem is the minimum positive integer that doesn't appear in this array. For example, mex of the array containing 1, 3 and 4 is equal to 2, while mex of the array containing 2, 3 and 2 is equal to 1.",
    "prob_desc_output_spec": "Print one positive integer — the maximum possible value of mex of the array after Alyona applies some (possibly none) operations.",
    "prob_desc_input_spec": "The first line of the input contains a single integer n (1 ≤ n ≤ 100 000) — the number of elements in the Alyona's array. The second line of the input contains n integers a1, a2, ..., an (1 ≤ ai ≤ 109) — the elements of the array.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_040.jsonl",
    "code_uid": "28a2cad75fee64d14dbf2fb888ae0ac0",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5\\n1 3 3 3 6\", \"2\\n2 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n=int(input())\np=list(map(int,input().split()))\np.sort()\np[0]=1\nfor x in range(1,n):\n    if p[x]>p[x-1]:\n        p[x]=p[x-1]+1\n    else:\n        pass\nprint(p[-1]+1)",
    "prob_desc_created_at": "1466181300",
    "tags": [
        "sortings"
    ],
    "hidden_unit_tests": ""
}