{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\"]",
    "src_uid": "c8dcb6c938e75eeb7b1d0ae87e9089c5",
    "prob_desc_notes": null,
    "prob_desc_description": "There is unrest in the Galactic Senate. Several thousand solar systems have declared their intentions to leave the Republic. Master Heidi needs to select the Jedi Knights who will go on peacekeeping missions throughout the galaxy. It is well-known that the success of any peacekeeping mission depends on the colors of the lightsabers of the Jedi who will go on that mission. Heidi has n Jedi Knights standing in front of her, each one with a lightsaber of one of m possible colors. She knows that for the mission to be the most effective, she needs to select some contiguous interval of knights such that there are exactly k1 knights with lightsabers of the first color, k2 knights with lightsabers of the second color, ..., km knights with lightsabers of the m-th color.However, since the last time, she has learned that it is not always possible to select such an interval. Therefore, she decided to ask some Jedi Knights to go on an indefinite unpaid vacation leave near certain pits on Tatooine, if you know what I mean. Help Heidi decide what is the minimum number of Jedi Knights that need to be let go before she is able to select the desired interval from the subsequence of remaining knights.",
    "prob_desc_output_spec": "Output one number: the minimum number of Jedi Knights that need to be removed from the sequence so that, in what remains, there is an interval with the prescribed counts of lightsaber colors. If this is not possible, output  - 1.",
    "prob_desc_input_spec": "The first line of the input contains n (1 ≤ n ≤ 2·105) and m (1 ≤ m ≤ n). The second line contains n integers in the range {1, 2, ..., m} representing colors of the lightsabers of the subsequent Jedi Knights. The third line contains m integers k1, k2, ..., km (with ) – the desired counts of Jedi Knights with lightsabers of each color from 1 to m.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_011.jsonl",
    "code_uid": "7ee16c3e941b4676b0b4d3f2e0a9bf60",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"8 3\\n3 3 1 2 2 1 1 3\\n3 1 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m = map(int, input().split())\nc = list(map(int, input().split()))\nk = list(map(int, input().split()))\np = [0] * m\nc = [o - 1 for o in c]\ns = sum(k)\nok = k.count(0)\ni1 = 0\ni2 = 0\nwhile i2 < n and ok < m:\n    p[c[i2]] += 1\n    if p[c[i2]] == k[c[i2]]:\n        ok += 1\n    i2 += 1\nif ok != m:\n    print(-1)\n    exit(0)\nans = i2 - i1\nwhile i1 < n:\n    p[c[i1]] -= 1\n    while i2 < n and p[c[i1]] < k[c[i1]]:\n        p[c[i2]] += 1\n        i2 += 1\n    if p[c[i1]] >= k[c[i1]]:\n        ans = min(ans, i2 - i1 - 1)\n    elif i2 == n:\n        break\n    i1 += 1\nprint(ans - s)\n",
    "prob_desc_created_at": "1523689500",
    "tags": [
        "two pointers",
        "binary search"
    ],
    "hidden_unit_tests": ""
}