{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1 1 2 \\n1 2 1\", \"-1\"]",
    "src_uid": "4dddcf0ded11672a4958fb0d391dbaf5",
    "prob_desc_notes": "NoteNote that two students become close friends only if they share a bus each day. But the bus they share can differ from day to day.",
    "prob_desc_description": "Recently Pashmak has been employed in a transportation company. The company has k buses and has a contract with a school which has n students. The school planned to take the students to d different places for d days (each day in one place). Each day the company provides all the buses for the trip. Pashmak has to arrange the students in the buses. He wants to arrange the students in a way that no two students become close friends. In his ridiculous idea, two students will become close friends if and only if they are in the same buses for all d days.Please help Pashmak with his weird idea. Assume that each bus has an unlimited capacity.",
    "prob_desc_output_spec": "If there is no valid arrangement just print -1. Otherwise print d lines, in each of them print n integers. The j-th integer of the i-th line shows which bus the j-th student has to take on the i-th day. You can assume that the buses are numbered from 1 to k.",
    "prob_desc_input_spec": "The first line of input contains three space-separated integers n, k, d (1 ≤ n, d ≤ 1000; 1 ≤ k ≤ 109).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1900,
    "file_name": "train_025.jsonl",
    "code_uid": "f3867638f2d5dc9ddd1bfeca4451685c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 2 2\", \"3 2 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,k,d=map(int,input().split())\nif n>k**d:print(-1);exit()\nK=1\nfor j in range(d):\n    print(\" \".join([str(i//K%k +1) for i in range(n)]))\n    K*=k",
    "prob_desc_created_at": "1408116600",
    "tags": [
        "constructive algorithms",
        "math",
        "combinatorics"
    ],
    "hidden_unit_tests": ""
}