{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"YES\", \"NO\", \"YES\"]",
    "src_uid": "f110b9351fe8ff20676d11ecfc92aee3",
    "prob_desc_notes": "NoteIn the first sample testcase, 1st group only contains the Rick from universe number 3, so in case he's a traitor, then all members of this group are traitors and so Summer should cancel the event.",
    "prob_desc_description": "Since the giant heads have appeared in the sky all humanity is in danger, so all Ricks and Mortys from all parallel universes are gathering in groups to find a solution to get rid of them. There are n parallel universes participating in this event (n Ricks and n Mortys). I. e. each of n universes has one Rick and one Morty. They're gathering in m groups. Each person can be in many groups and a group can contain an arbitrary number of members.Ricks and Mortys have registered online in these groups. So, a person can have joined a group more than once (developer of this website hadn't considered this possibility).  Summer from universe #1 knows that in each parallel universe (including hers) exactly one of Rick and Morty from that universe is a traitor and is loyal, but no one knows which one. She knows that we are doomed if there's a group such that every member in that group is a traitor (they will plan and destroy the world). Summer knows that if there's a possibility that world ends (there's a group where all members are traitors) she should immediately cancel this event. So she wants to know if she should cancel the event. You have to tell her yes if and only if there's at least one scenario (among all 2n possible scenarios, 2 possible scenarios for who a traitor in each universe) such that in that scenario the world will end.",
    "prob_desc_output_spec": "In a single line print the answer to Summer's question. Print \"YES\" if she should cancel the event and \"NO\" otherwise.",
    "prob_desc_input_spec": "The first line of input contains two integers n and m (1 ≤ n, m ≤ 104) — number of universes and number of groups respectively. The next m lines contain the information about the groups. i-th of them first contains an integer k (number of times someone joined i-th group, k &gt; 0) followed by k integers vi, 1, vi, 2, ..., vi, k. If vi, j is negative, it means that Rick from universe number  - vi, j has joined this group and otherwise it means that Morty from universe number vi, j has joined it. Sum of k for all groups does not exceed 104.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_004.jsonl",
    "code_uid": "50bf784254eb3f10682b6f9529468e73",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 2\\n1 -3\\n4 -2 3 2 -3\", \"5 2\\n5 3 -2 1 -1 5\\n3 -5 2 5\", \"7 2\\n3 -1 6 7\\n7 -5 4 2 4 7 -3 4\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m = map(int, input().split())\n\nfor i in range(m):\n    bad = True\n    l = set(map(int, input().split()[1:]))\n    for j in l:\n        if -j in l:\n            bad = False\n            break\n            \n    if bad:\n        break\n        \nprint(\"YES\" if bad else \"NO\")",
    "prob_desc_created_at": "1490281500",
    "tags": [
        "implementation",
        "greedy",
        "math"
    ],
    "hidden_unit_tests": ""
}