{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"MC 25 70\\nMC 42 82\\nCSKA 13 90\"]",
    "src_uid": "b1f78130d102aa5f425e95f4b5b3a9fb",
    "prob_desc_notes": null,
    "prob_desc_description": "Vasya has started watching football games. He has learned that for some fouls the players receive yellow cards, and for some fouls they receive red cards. A player who receives the second yellow card automatically receives a red card.Vasya is watching a recorded football match now and makes notes of all the fouls that he would give a card for. Help Vasya determine all the moments in time when players would be given red cards if Vasya were the judge. For each player, Vasya wants to know only the first moment of time when he would receive a red card from Vasya.",
    "prob_desc_output_spec": "For each event when a player received his first red card in a chronological order print a string containing the following information:   The name of the team to which the player belongs;  the player's number in his team;  the minute when he received the card.  If no player received a card, then you do not need to print anything. It is possible case that the program will not print anything to the output (if there were no red cards).",
    "prob_desc_input_spec": "The first line contains the name of the team playing at home. The second line contains the name of the team playing away. Both lines are not empty. The lengths of both lines do not exceed 20. Each line contains only of large English letters. The names of the teams are distinct. Next follows number n (1 ≤ n ≤ 90) — the number of fouls.  Each of the following n lines contains information about a foul in the following form:    first goes number t (1 ≤ t ≤ 90) — the minute when the foul occurs;  then goes letter \"h\" or letter \"a\" — if the letter is \"h\", then the card was given to a home team player, otherwise the card was given to an away team player;  then goes the player's number m (1 ≤ m ≤ 99);  then goes letter \"y\" or letter \"r\" — if the letter is \"y\", that means that the yellow card was given, otherwise the red card was given.  The players from different teams can have the same number. The players within one team have distinct numbers. The fouls go chronologically, no two fouls happened at the same minute.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_042.jsonl",
    "code_uid": "0da43e8e4a9b02463c2cc4dd4d3cc92a",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"MC\\nCSKA\\n9\\n28 a 3 y\\n62 h 25 y\\n66 h 42 y\\n70 h 25 y\\n77 a 4 y\\n79 a 25 y\\n82 h 42 r\\n89 h 16 y\\n90 a 13 r\"]",
    "exec_outcome": "PASSED",
    "source_code": "h = input()\na = input()\nn = int(input())\nd = dict()\nfor i in range(n):\n    arr = input().split()\n    mark = (h if arr[1] == 'h' else a) + ' ' + arr[2]\n    if mark not in d:\n        d[mark] = 0\n    if d[mark] < 2:\n        d[mark] += 1 if arr[3] == 'y' else 2\n        if d[mark] >= 2:\n            print(mark, arr[0])",
    "prob_desc_created_at": "1417618800",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}