{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1 1\\n-1\\n4 6\\n166374058999707392 249561088499561088\"]",
    "src_uid": "1cc628b4e03c8b8e0c5086dc4e0e3254",
    "prob_desc_notes": "NoteIn the first test case the total number of wheels is $$$4$$$. It means that there is the only one bus with two axles in the bus fleet.In the second test case it's easy to show that there is no suitable number of buses with $$$7$$$ wheels in total.In the third test case the total number of wheels is $$$24$$$. The following options are possible:  Four buses with three axles.  Three buses with two axles and two buses with three axles.  Six buses with two axles. So the minimum number of buses is $$$4$$$ and the maximum number of buses is $$$6$$$.",
    "prob_desc_description": "Spring has come, and the management of the AvtoBus bus fleet has given the order to replace winter tires with summer tires on all buses.You own a small bus service business and you have just received an order to replace $$$n$$$ tires. You know that the bus fleet owns two types of buses: with two axles (these buses have $$$4$$$ wheels) and with three axles (these buses have $$$6$$$ wheels).You don't know how many buses of which type the AvtoBus bus fleet owns, so you wonder how many buses the fleet might have. You have to determine the minimum and the maximum number of buses that can be in the fleet if you know that the total number of wheels for all buses is $$$n$$$.",
    "prob_desc_output_spec": "For each test case print the answer in a single line using the following format. Print two integers $$$x$$$ and $$$y$$$ ($$$1 \\le x \\le y$$$) — the minimum and the maximum possible number of buses that can be in the bus fleet. If there is no suitable number of buses for the given $$$n$$$, print the number $$$-1$$$ as the answer.",
    "prob_desc_input_spec": "The first line contains an integer $$$t$$$ ($$$1 \\le t \\le 1\\,000$$$) — the number of test cases. The following lines contain description of test cases. The only line of each test case contains one integer $$$n$$$ ($$$1 \\le n \\le 10^{18}$$$) — the total number of wheels for all buses.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 900,
    "file_name": "train_099.jsonl",
    "code_uid": "f73adefa2e3bd6b736050cb083fdeb57",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\n\\n4\\n\\n7\\n\\n24\\n\\n998244353998244352\"]",
    "exec_outcome": "PASSED",
    "source_code": "for i in range(int(input())):\r\n    n = int(input())\r\n    if n%2 != 0 or n < 3:\r\n        print(-1)\r\n    \r\n    else:\r\n        minimum = n // 6\r\n        maximum = n//4\r\n        if minimum * 6 != n:\r\n            minimum += 1\r\n        print(minimum, maximum)",
    "prob_desc_created_at": "1652520900",
    "tags": [
        "brute force",
        "greedy",
        "math",
        "number theory"
    ],
    "hidden_unit_tests": ""
}