{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"3.500000000000\", \"4.958333333333\", \"1.750000000000\"]",
    "src_uid": "f70ac2c4e0f62f9d6ad1e003aedd86b2",
    "prob_desc_notes": "NoteConsider the third test example. If you've made two tosses:  You can get 1 in the first toss, and 2 in the second. Maximum equals to 2.  You can get 1 in the first toss, and 1 in the second. Maximum equals to 1.  You can get 2 in the first toss, and 1 in the second. Maximum equals to 2.  You can get 2 in the first toss, and 2 in the second. Maximum equals to 2. The probability of each outcome is 0.25, that is expectation equals to: You can read about expectation using the following link: http://en.wikipedia.org/wiki/Expected_value",
    "prob_desc_description": "Twilight Sparkle was playing Ludo with her friends Rainbow Dash, Apple Jack and Flutter Shy. But she kept losing. Having returned to the castle, Twilight Sparkle became interested in the dice that were used in the game.The dice has m faces: the first face of the dice contains a dot, the second one contains two dots, and so on, the m-th face contains m dots. Twilight Sparkle is sure that when the dice is tossed, each face appears with probability . Also she knows that each toss is independent from others. Help her to calculate the expected maximum number of dots she could get after tossing the dice n times.",
    "prob_desc_output_spec": "Output a single real number corresponding to the expected maximum. The answer will be considered correct if its relative or absolute error doesn't exceed 10  - 4.",
    "prob_desc_input_spec": "A single line contains two integers m and n (1 ≤ m, n ≤ 105).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_011.jsonl",
    "code_uid": "05a23b579b77eff8fb269d6721c53d91",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"6 1\", \"6 3\", \"2 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,m = map(int, input().split())\ns=0\nfor i in range(n):\n    s+=(i+1)*(pow((i+1)/n,m)-pow(i/n,m))\nprint(s)",
    "prob_desc_created_at": "1406907000",
    "tags": [
        "probabilities"
    ],
    "hidden_unit_tests": ""
}