{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"3\", \"2\", \"0\"]",
    "src_uid": "66b2d21d8ddd6b3ba30b7850fe1a7228",
    "prob_desc_notes": "NoteA note to the first example: all correct ways to make Domino Carpet are represented below:  And this way is incorrect:  ",
    "prob_desc_description": "...Mike the TV greets you again! Tired of the monotonous furniture? Sick of gray routine? Dreaming about dizzying changes in your humble abode? We have something to offer you! This domino carpet for only $99.99 will change your life! You can lay it on the floor, hang it on the wall or even on the ceiling! Among other things ... Having watched the commercial, virus Hexadecimal also wanted to get a Domino Carpet and wanted badly to be photographed in front of it. But of course, a virus will never consent to buying a licensed Carpet! So she ordered a truck of dominoes and decided to make such a Carpet herself. The original Domino Carpet is a field of squares n × m in size. Each square is half of a domino, and can be rotated either vertically or horizontally, independently from its neighbors. Vertically rotated domino halves look like this:    And horizontally rotated halves look like this:   Notice, that some halves looks the same in both rotations, but other halves differ.Dominoes bought by Hexadecimal are represented by uncuttable chips 1 × 2 in size, which can be laid either vertically or horizontally. If the chip is laid vertically, then both of it's halves should be laid vertically orientated; if the chip is laid horizontally, then both of it's halves should be laid horizontally.The samples of valid and invalid dominoes laid vertically and horizontally are:    Virus Hexadecimal assembles her own Domino Carpet so that the following conditions are satisfied:  each carpet square is covered by a domino chip, i.e. there are no empty squares;  all domino chips lie entirely within the carpet and don't overlap with each other;  if there is a horizontal domino chip with its left half in column j then there are no horizontal domino chips with their left halves in columns j - 1 or j + 1. Before starting to assemble her own Domino Carpet, the virus wants to know the number of ways to achieve the intended purpose modulo 109 + 7.You can assume that the virus has an infinitely large number of dominoes of each type.",
    "prob_desc_output_spec": "Print a single number, the number of ways to assemble the Domino Carpet modulo 109 + 7, using only standard dominoes of size 1 × 2.",
    "prob_desc_input_spec": "The first line contains two integers n and m, separated by a space — the size of the Domino Carpet (1 ≤ n, m ≤ 250). Next 4n + 1 lines contain 4m + 1 symbols.  Each square of the Domino Carpet, which is a domino half, is described by a 3 × 3 square. Symbol 'O' in this square indicates the presence of a point, symbol '.' — its absence.  Each 3 × 3 square is delineated from adjacent squares by symbols '#' as shown in the examples.  It is guaranteed that every box describes the correct half of a domino.  In all pretests the Domino Carpets have the size of 2 × 2 and 4 × 4.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 2300,
    "file_name": "train_023.jsonl",
    "code_uid": "694b5629c0de76fdd577c29d0bcaed46",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 4\\n#################\\n#O..#...#O.O#...#\\n#.O.#.O.#.O.#...#\\n#..O#...#O.O#...#\\n#################\\n#O.O#OOO#O.O#...#\\n#.O.#...#...#.O.#\\n#O.O#OOO#O.O#...#\\n#################\\n#O.O#...#O.O#...#\\n#...#...#...#.O.#\\n#O.O#...#O.O#...#\\n#################\", \"2 2\\n#########\\n#O.O#O.O#\\n#.O.#...#\\n#O.O#O.O#\\n#########\\n#...#O.O#\\n#...#...#\\n#...#O.O#\\n#########\", \"2 2\\n#########\\n#..O#O..#\\n#...#...#\\n#O..#..O#\\n#########\\n#O..#..O#\\n#...#...#\\n#..O#O..#\\n#########\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,m=map(int,raw_input().split())\nP=10**9+7\nH={\n    ('O..','...','..O'):3,('O..','.O.','..O'):3,('OOO','...','OOO'):3,\n    ('..O','...','O..'):1,('..O','.O.','O..'):1,('O.O','O.O','O.O'):1}\nd=[]\nfor _ in xrange(n):\n    raw_input()\n    r = zip(*[tuple(raw_input().split('#')[1:-1]) for _ in xrange(3)])    \n    d.append([H.get(x,0) for x in r])\na,b,p=0,1,[False]*n\nu = lambda l: any(i==3 for i in l)\nfor r in zip(*d):\n    c = 0 if n&1 or u(r) else (b if u(p) else b-a)\n    q = map(lambda x,y:[0,1,1,3,4,4,3][x+y],p,r)        \n    if any(x==4 for x in q): f=0\n    else:\n        j,e,f = 3,0,1        \n        for i in q:\n            if i==3: a*=f;e,f=0,1\n            else: e,f = f,[f,0][i]+[e,0][j==3]\n            j=i\n    a,b,p=b,(c+a*f)%P,r    \nprint b\n",
    "prob_desc_created_at": "1303226100",
    "tags": [
        "dp",
        "implementation"
    ],
    "hidden_unit_tests": ""
}