{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"5\", \"0\"]",
    "src_uid": "6b4242ae9a52d36548dda79d93fe0aef",
    "prob_desc_notes": "NoteIn the first sample, the ball will fall from the field if starts at position 1 or position 2.In the second sample, any starting position will result in the ball falling from the field.",
    "prob_desc_description": "In a new version of the famous Pinball game, one of the most important parts of the game field is a sequence of n bumpers. The bumpers are numbered with integers from 1 to n from left to right. There are two types of bumpers. They are denoted by the characters '&lt;' and '&gt;'. When the ball hits the bumper at position i it goes one position to the right (to the position i + 1) if the type of this bumper is '&gt;', or one position to the left (to i - 1) if the type of the bumper at position i is '&lt;'. If there is no such position, in other words if i - 1 &lt; 1 or i + 1 &gt; n, the ball falls from the game field.Depending on the ball's starting position, the ball may eventually fall from the game field or it may stay there forever. You are given a string representing the bumpers' types. Calculate the number of positions such that the ball will eventually fall from the game field if it starts at that position.",
    "prob_desc_output_spec": "Print one integer — the number of positions in the sequence such that the ball will eventually fall from the game field if it starts at that position.",
    "prob_desc_input_spec": "The first line of the input contains a single integer n (1 ≤ n ≤ 200 000) — the length of the sequence of bumpers. The second line contains the string, which consists of the characters '&lt;' and '&gt;'. The character at the i-th position of this string corresponds to the type of the i-th bumper.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_000.jsonl",
    "code_uid": "c00ea4c25f25ae761d8752505f7874fa",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\n&lt;&lt;&gt;&lt;\", \"5\\n&gt;&gt;&gt;&gt;&gt;\", \"4\\n&gt;&gt;&lt;&lt;\"]",
    "exec_outcome": "PASSED",
    "source_code": "raw_input()\nseq = raw_input()\nprint len(seq)*2 - len(seq.lstrip('<')) - len(seq.rstrip('>'))",
    "prob_desc_created_at": "1477148700",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}