{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"0\", \"2\"]",
    "src_uid": "2dca11b202d7adbe22a404a52d627eed",
    "prob_desc_notes": "NoteIn the first example Polycarp should say he didn't notice the \"speed limit\" sign with the limit of 70 and the second \"speed limit\" sign with the limit of 120.In the second example Polycarp didn't make any rule violation.In the third example Polycarp should say he didn't notice both \"no overtake allowed\" that came after \"overtake is allowed\" sign.",
    "prob_desc_description": "Polycarp has just attempted to pass the driving test. He ran over the straight road with the signs of four types.  speed limit: this sign comes with a positive integer number — maximal speed of the car after the sign (cancel the action of the previous sign of this type);  overtake is allowed: this sign means that after some car meets it, it can overtake any other car;  no speed limit: this sign cancels speed limit if any (car can move with arbitrary speed after this sign);  no overtake allowed: some car can't overtake any other car after this sign. Polycarp goes past the signs consequentially, each new sign cancels the action of all the previous signs of it's kind (speed limit/overtake). It is possible that two or more \"no overtake allowed\" signs go one after another with zero \"overtake is allowed\" signs between them. It works with \"no speed limit\" and \"overtake is allowed\" signs as well.In the beginning of the ride overtake is allowed and there is no speed limit.You are given the sequence of events in chronological order — events which happened to Polycarp during the ride. There are events of following types:  Polycarp changes the speed of his car to specified (this event comes with a positive integer number);  Polycarp's car overtakes the other car;  Polycarp's car goes past the \"speed limit\" sign (this sign comes with a positive integer);  Polycarp's car goes past the \"overtake is allowed\" sign;  Polycarp's car goes past the \"no speed limit\";  Polycarp's car goes past the \"no overtake allowed\"; It is guaranteed that the first event in chronological order is the event of type 1 (Polycarp changed the speed of his car to specified).After the exam Polycarp can justify his rule violations by telling the driving instructor that he just didn't notice some of the signs. What is the minimal number of signs Polycarp should say he didn't notice, so that he would make no rule violations from his point of view?",
    "prob_desc_output_spec": "Print the minimal number of road signs Polycarp should say he didn't notice, so that he would make no rule violations from his point of view.",
    "prob_desc_input_spec": "The first line contains one integer number n (1 ≤ n ≤ 2·105) — number of events. Each of the next n lines starts with integer t (1 ≤ t ≤ 6) — the type of the event. An integer s (1 ≤ s ≤ 300) follows in the query of the first and the third type (if it is the query of first type, then it's new speed of Polycarp's car, if it is the query of third type, then it's new speed limit). It is guaranteed that the first event in chronological order is the event of type 1 (Polycarp changed the speed of his car to specified).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_044.jsonl",
    "code_uid": "deb92a1574cdf17b73feaa21c62d7c69",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"11\\n1 100\\n3 70\\n4\\n2\\n3 120\\n5\\n3 120\\n6\\n1 150\\n4\\n3 300\", \"5\\n1 100\\n3 200\\n2\\n4\\n5\", \"7\\n1 20\\n2\\n6\\n4\\n6\\n6\\n2\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\n\nevents = []\nfor i in range(n):\n    events.append(list(map(lambda s: int(s), input().split())))\n\nmax_speeds = []\novertaking_forbidden = 0\n\ncurrent_speed = 0\n\nignores = 0\n\nfor event in events:\n    if event[0] == 1:\n        current_speed = event[1]\n\n        while max_speeds and current_speed > max_speeds[-1]:\n            max_speeds.pop()\n            ignores += 1\n\n    elif event[0] == 2:\n        ignores += overtaking_forbidden\n        overtaking_forbidden = 0\n\n    elif event[0] == 3:\n        if current_speed > event[1]:\n            ignores += 1\n        else:\n            max_speeds.append(event[1])\n\n    elif event[0] == 4:\n        overtaking_forbidden = 0\n    elif event[0] == 5:\n        max_speeds = []\n    elif event[0] == 6:\n        overtaking_forbidden += 1\n\nprint(ignores)\n\n",
    "prob_desc_created_at": "1503327900",
    "tags": [
        "dp",
        "greedy",
        "data structures"
    ],
    "hidden_unit_tests": ""
}