{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"Ya Ya Tidak Tidak\\nTidak Ya Tidak Tidak\"]",
    "src_uid": "189d6b94e2e7d11803d2873d03459c97",
    "prob_desc_notes": "NoteFor the first case, here is a scenario where the first box is the special box:   The first box had toys with fun values $$$\\{-3\\}$$$.  The second box had toys with fun values $$$\\{ -0.5, -0.5 \\}$$$  The fourth box had toys with fun values $$$\\{ 3 \\}$$$ The sewing sequence:   Chaneka sews the toy with fun $$$-0.5$$$ and $$$-0.5$$$ to a toy with fun $$$0.25$$$ and then put it in the third box.  Chaneka sews the toy with fun $$$-3$$$ and $$$0.25$$$ to a toy with fun $$$-0.75$$$ and then put it in the second box.  Chaneka sews the toy with fun $$$-0.75$$$ and $$$3$$$ to a toy with fun $$$-1.25$$$ and then put it in the first box, which then became the special box. Here is a scenario where the second box ends up being the special box:   The first box had toys with fun values $$$\\{-3\\}$$$  The second box had toys with fun values $$$\\{ -0.33, -0.25 \\}$$$.  The fourth box had toys with fun values $$$\\{ 3 \\}$$$. The sewing sequence:   Chaneka sews the toy with fun $$$-3$$$ and $$$-0.33$$$ to a toy with fun $$$0.99$$$ and then put it in the third box.  Chaneka sews the toy with fun $$$0.99$$$ and $$$3$$$ to a toy with fun $$$2.97$$$ and then put in it the fourth box.  Chaneka sews the toy with fun $$$2.97$$$ and $$$-0.25$$$ to a toy with fun $$$-0.7425$$$ and then put it in the second box, which then became the special box.  There is only one toy for the second case, so Chaneka does not have to sew anything because that toy, by definition, is the super toy.",
    "prob_desc_description": "Chaneka has a hobby of playing with animal toys. Every toy has a different fun value, a real number. Chaneka has four boxes to store the toys with specification:   The first box stores toys with fun values in range of $$$(-\\infty,-1]$$$.  The second box stores toys with fun values in range of $$$(-1, 0)$$$.  The third box stores toys with fun values in range of $$$(0, 1)$$$.  The fourth box stores toys with fun value in range of $$$[1, \\infty)$$$. Chaneka has $$$A$$$, $$$B$$$, $$$C$$$, $$$D$$$ toys in the first, second, third, and fourth box, respectively. One day she decides that she only wants one toy, a super toy. So she begins to create this super toy by sewing all the toys she has.While the number of toys Chaneka has is more than 1, she takes two different toys randomly and then sews them together, creating a new toy. The fun value of this new toy is equal to the multiplication of fun values of the sewn toys. She then puts this new toy in the appropriate box. She repeats this process until she only has one toy. This last toy is the super toy, and the box that stores this toy is the special box.As an observer, you only know the number of toys in each box initially but do not know their fun values. You also don't see the sequence of Chaneka's sewing. Determine which boxes can be the special box after Chaneka found her super toy.",
    "prob_desc_output_spec": "For each case, print four space-separated strings. Each string represents the possibility that the first, second, third, and fourth box can be the special box from left to right. For each box, print \"Ya\" (Without quotes, Indonesian for yes) if that box can be the special box. Print \"Tidak\" (Without quotes, Indonesian for No) otherwise.",
    "prob_desc_input_spec": "The first line has an integer $$$T$$$ $$$(1 \\le T \\le 5 \\cdot 10^4)$$$, the number of test cases. Every case contains a line with four space-separated integers $$$A$$$ $$$B$$$ $$$C$$$ $$$D$$$ $$$(0 \\le A, B, C, D \\le 10^6, A + B + C + D &gt; 0)$$$, which denotes the number of toys in the first, second, third, and fourth box, respectively.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_026.jsonl",
    "code_uid": "234b99283683fe89b5068480e8a49e1d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n1 2 0 1\\n0 1 0 0\"]",
    "exec_outcome": "PASSED",
    "source_code": "def hi(a):\n\tif sum(a)==1:\n\t\tp = a.index(1)\n\t\tb = [\"Tidak\"]*4\n\t\tb[p] = \"Ya\"\n\t\treturn b\n\tp = (-1)**(a[0]+a[1])\n\tb = [-2]*4\n\tif p<0:\n\t\tb[2],b[3] = \"Tidak\",\"Tidak\"\n\t\tif a[0]==0 and a[3]==0:\n\t\t\tb[0],b[1] = \"Tidak\",\"Ya\"\n\t\t\treturn b\n\t\tif a[1]==0 and a[2]==0:\n\t\t\tb[1],b[0] = \"Tidak\",\"Ya\"\n\t\t\treturn b\n\t\telse:\n\t\t\tb[0],b[1] = \"Ya\",\"Ya\"\n\t\t\treturn b\n\tif p>0:\n\t\tb[0],b[1] = \"Tidak\",\"Tidak\"\n\t\tif a[0]==0 and a[3]==0:\n\t\t\tb[3],b[2] = \"Tidak\",\"Ya\"\n\t\t\treturn b\n\t\tif a[1]==0 and a[2]==0:\n\t\t\tb[2],b[3] = \"Tidak\",\"Ya\"\n\t\t\treturn b\n\t\telse:\n\t\t\tb[2],b[3] = \"Ya\",\"Ya\"\n\t\t\treturn b\n\t\n\t\t\nt = int(input())\nb = []\nfor i in range(t):\n\ta = list(map(int,input().split()))\n\tb.append(hi(a))\nfor i in range(len(b)):\n\tb[i] = \" \".join(b[i])\n\tprint(b[i])\n",
    "prob_desc_created_at": "1601182800",
    "tags": [
        "constructive algorithms"
    ],
    "hidden_unit_tests": ""
}