{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1.000000000000\", \"1.714285714286\"]",
    "src_uid": "a69b342ef5f6e11f7aa4fee71e149aa2",
    "prob_desc_notes": "NoteIn the first sample you can put a police station in one of the capitals, then each path will have exactly one safe road. If we place the station not in the capital, then the average number of safe roads will also make .In the second sample we can obtain the maximum sought value if we put the station in city 4, then 6 paths will have 2 safe roads each, and one path will have 0 safe roads, so the answer will equal .",
    "prob_desc_description": "The Berland road network consists of n cities and of m bidirectional roads. The cities are numbered from 1 to n, where the main capital city has number n, and the culture capital — number 1. The road network is set up so that it is possible to reach any city from any other one by the roads. Moving on each road in any direction takes the same time.All residents of Berland are very lazy people, and so when they want to get from city v to city u, they always choose one of the shortest paths (no matter which one).The Berland government wants to make this country's road network safer. For that, it is going to put a police station in one city. The police station has a rather strange property: when a citizen of Berland is driving along the road with a police station at one end of it, the citizen drives more carefully, so all such roads are considered safe. The roads, both ends of which differ from the city with the police station, are dangerous.Now the government wonders where to put the police station so that the average number of safe roads for all the shortest paths from the cultural capital to the main capital would take the maximum value.",
    "prob_desc_output_spec": "Print the maximum possible value of the average number of safe roads among all shortest paths from the culture capital to the main one. The answer will be considered valid if its absolute or relative inaccuracy does not exceed 10 - 6.",
    "prob_desc_input_spec": "The first input line contains two integers n and m (2 ≤ n ≤ 100, ) — the number of cities and the number of roads in Berland, correspondingly. Next m lines contain pairs of integers vi, ui (1 ≤ vi, ui ≤ n, vi ≠ ui) — the numbers of cities that are connected by the i-th road. The numbers on a line are separated by a space.  It is guaranteed that each pair of cities is connected with no more than one road and that it is possible to get from any city to any other one along Berland roads.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1900,
    "file_name": "train_005.jsonl",
    "code_uid": "227b05e69a1f3a53ca8a05b2636cc83c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 4\\n1 2\\n2 4\\n1 3\\n3 4\", \"11 14\\n1 2\\n1 3\\n2 4\\n3 4\\n4 5\\n4 6\\n5 11\\n6 11\\n1 8\\n8 9\\n9 7\\n11 7\\n1 10\\n10 4\"]",
    "exec_outcome": "PASSED",
    "source_code": "from collections import deque\n\nn, m = [int(i) for i in input().split()]\ng = [[] for i in range(n)]\nfor i in range(m):\n    u, v = [int(i) - 1 for i in input().split()]\n    g[u].append(v)\n    g[v].append(u)\n\n\ndef bfs(s):\n    d = [-1] * n\n    ct = [0.0] * n\n    q = deque()\n    \n    d[s] = 0\n    ct[s] = 1.0\n    q.append(s)\n    while q:\n        v = q.popleft()\n        for u in g[v]:\n            if d[u] == -1:\n                q.append(u)\n                d[u] = d[v] + 1\n                ct[u] += ct[v]\n            elif d[u] == d[v] + 1:\n                ct[u] += ct[v]\n    return d, ct\n\nds = []\ncts = []\nfor i in range(n):\n    d, ct = bfs(i)\n    ds.append(d)\n    cts.append(ct)\nx = cts[0][n - 1]\nr = 1.0\nfor i in range(1, n - 1):\n    if ds[0][i] + ds[i][n - 1] == ds[0][n - 1]:\n        r = max(r, 2.0 * cts[0][i] * cts[i][n - 1] / x)\nprint('{0:.10f}'.format(r))\n    \n\n\n",
    "prob_desc_created_at": "1343057400",
    "tags": [
        "dp",
        "graphs",
        "shortest paths"
    ],
    "hidden_unit_tests": ""
}