{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"void*\\nerrtype\\nvoid\", \"void*\\nvoid**\\nvoid\\nvoid**\\nerrtype\\nvoid\\nerrtype\\nerrtype\\nerrtype\"]",
    "src_uid": "b260eb188103758a74b600d8bb46fffe",
    "prob_desc_notes": "NoteLet's look at the second sample.After the first two queries typedef the b type is equivalent to void*, and с — to void**.The next query typedef redefines b — it is now equal to &amp;b = &amp;void* = void. At that, the с type doesn't change.After that the с type is defined as &amp;&amp;b* = &amp;&amp;void* = &amp;void = errtype. It doesn't influence the b type, that's why the next typedef defines c as &amp;void* = void.Then the b type is again redefined as &amp;void = errtype. Please note that the c type in the next query is defined exactly as errtype******* = errtype, and not &amp;void******* = void******. The same happens in the last typedef.",
    "prob_desc_description": "Programmer Vasya is studying a new programming language &amp;K*. The &amp;K* language resembles the languages of the C family in its syntax. However, it is more powerful, which is why the rules of the actual C-like languages are unapplicable to it. To fully understand the statement, please read the language's description below carefully and follow it and not the similar rules in real programming languages.There is a very powerful system of pointers on &amp;K* — you can add an asterisk to the right of the existing type X — that will result in new type X * . That is called pointer-definition operation. Also, there is the operation that does the opposite — to any type of X, which is a pointer, you can add an ampersand — that will result in a type &amp;X, to which refers X. That is called a dereference operation.The &amp;K* language has only two basic data types — void and errtype. Also, the language has operators typedef and typeof. The operator \"typedef A B\" defines a new data type B, which is equivalent to A. A can have asterisks and ampersands, and B cannot have them. For example, the operator typedef void** ptptvoid will create a new type ptptvoid, that can be used as void**. The operator \"typeof A\" returns type of A, brought to void, that is, returns the type void**...*, equivalent to it with the necessary number of asterisks (the number can possibly be zero). That is, having defined the ptptvoid type, as shown above, the typeof ptptvoid operator will return void**.An attempt of dereferencing of the void type will lead to an error: to a special data type errtype. For errtype the following equation holds true: errtype* = &amp;errtype = errtype. An attempt to use the data type that hasn't been defined before that will also lead to the errtype.Using typedef, we can define one type several times. Of all the definitions only the last one is valid. However, all the types that have been defined earlier using this type do not change.Let us also note that the dereference operation has the lower priority that the pointer operation, in other words &amp;T *  is always equal to T.Note, that the operators are executed consecutively one by one. If we have two operators \"typedef &amp;void a\" and \"typedef a* b\", then at first a becomes errtype, and after that b becomes errtype* = errtype, but not &amp;void* = void (see sample 2).Vasya does not yet fully understand this powerful technology, that's why he asked you to help him. Write a program that analyzes these operators. ",
    "prob_desc_output_spec": "For every typeof operator print on the single line the answer to that operator — the type that the given operator returned.",
    "prob_desc_input_spec": "The first line contains an integer n (1 ≤ n ≤ 100) — the number of operators. Then follow n lines with operators. Each operator is of one of two types: either \"typedef A B\", or \"typeof A\". In the first case the B type differs from void and errtype types, and besides, doesn't have any asterisks and ampersands. All the data type names are non-empty lines of no more than 20 lowercase Latin letters. The number of asterisks and ampersands separately in one type in any operator does not exceed 10, however if we bring some types to void with several asterisks, their number may exceed 10.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_005.jsonl",
    "code_uid": "64f6bd64f0fd50067e8e6b48f395754c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5\\ntypedef void* ptv\\ntypeof ptv\\ntypedef &amp;&amp;ptv node\\ntypeof node\\ntypeof &amp;ptv\", \"17\\ntypedef void* b\\ntypedef b* c\\ntypeof b\\ntypeof c\\ntypedef &amp;b b\\ntypeof b\\ntypeof c\\ntypedef &amp;&amp;b* c\\ntypeof c\\ntypedef &amp;b* c\\ntypeof c\\ntypedef &amp;void b\\ntypeof b\\ntypedef b******* c\\ntypeof c\\ntypedef &amp;&amp;b* c\\ntypeof c\"]",
    "exec_outcome": "PASSED",
    "source_code": "def tr(v):\n    a = v.count('&')\n    b = v.count('*')\n    v = v.replace('&', '').replace('*', '')\n    if a > b:\n        a -= b\n        b = 0\n    else:\n        b -= a\n        a = 0\n    return '&' * a + v + '*' * b\n\ndef go(v):\n    i = v.replace('&', '').replace('*', '')\n    global val, err\n    if i not in val:\n        return 'errtype'\n    sub = val[i]\n    v = v.replace(i, sub)\n    v = tr(v)\n    for e in err:\n        if v.startswith(e) or v.endswith(e):\n            v = 'errtype'\n            break\n    return v\n\n\n\nval = dict()\nval['void'] = 'void'\nerr = ['&void', 'errtype', '&errtype', 'errtype*']\n\nfor i in range(int(input())):\n    cmd = input().split()\n    if cmd[0] == 'typeof':\n        v = cmd[1]\n        clean = tr(v)\n        print(go(v))\n    else:\n        fr, to = cmd[1], cmd[2]\n        val[to] = go(tr(fr))\n",
    "prob_desc_created_at": "1307458800",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}