{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"4\\n1 1 4 5\", \"3\\n1 3 5\"]",
    "src_uid": "113997707143a57f7e81fb14d9bbde96",
    "prob_desc_notes": null,
    "prob_desc_description": "A new Berland businessman Vitaly is going to open a household appliances' store. All he's got to do now is to hire the staff.The store will work seven days a week, but not around the clock. Every day at least k people must work in the store.Berland has a law that determines the order of working days and non-working days. Namely, each employee must work for exactly n consecutive days, then rest for exactly m days, then work for n more days and rest for m more, and so on. Vitaly doesn't want to break the law. Fortunately, there is a loophole: the law comes into force on the day when the employee is hired. For example, if an employee is hired on day x, then he should work on days [x, x + 1, ..., x + n - 1], [x + m + n, x + m + n + 1, ..., x + m + 2n - 1], and so on. Day x can be chosen arbitrarily by Vitaly.There is one more thing: the key to the store. Berland law prohibits making copies of keys, so there is only one key. Vitaly is planning to entrust the key to the store employees. At the same time on each day the key must be with an employee who works that day — otherwise on this day no one can get inside the store. During the day the key holder can give the key to another employee, if he also works that day. The key will handed to the first hired employee at his first working day.Each employee has to be paid salary. Therefore, Vitaly wants to hire as few employees as possible provided that the store can operate normally on each day from 1 to infinity. In other words, on each day with index from 1 to infinity, the store must have at least k working employees, and one of the working employees should have the key to the store.Help Vitaly and determine the minimum required number of employees, as well as days on which they should be hired.",
    "prob_desc_output_spec": "In the first line print a single integer z — the minimum required number of employees. In the second line print z positive integers, separated by spaces: the i-th integer ai (1 ≤ ai ≤ 104) should represent the number of the day, on which Vitaly should hire the i-th employee. If there are multiple answers, print any of them.",
    "prob_desc_input_spec": "The first line contains three integers n, m and k (1 ≤ m ≤ n ≤ 1000, n ≠ 1, 1 ≤ k ≤ 1000).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_003.jsonl",
    "code_uid": "d0b3234bc03593db8c46ae73948be2b7",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 3 2\", \"3 3 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m, k = [int(i) for i in raw_input().split()]\n\nct = k\nday = 1\nloop = n+m\nworkers = [1]*k\nwhile True:\n    day += n-1\n    if day > loop: break\n    workers.append(day)\n    ct += 1\n    if k > 1:\n        day += 1\n        if day > loop: break\n        workers.extend([day]*(k-1))\n        ct += (k-1)\nprint ct\nfor w in workers: print w,\n",
    "prob_desc_created_at": "1344958200",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}