{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"2\\n3 3 -1\", \"3\\n1 2 4\"]",
    "src_uid": "03c70b7ed260a886a7771c117a94c995",
    "prob_desc_notes": null,
    "prob_desc_description": "Perhaps many have heard that the World Biathlon Championship has finished. Although our hero Valera was not present at this spectacular event himself and only watched it on TV, it excited him so much that he decided to enroll in a biathlon section.Of course, biathlon as any sport, proved very difficult in practice. It takes much time and effort. Workouts, workouts, and workouts, — that's what awaited Valera on his way to great achievements in biathlon.As for the workouts, you all probably know that every professional biathlete should ski fast and shoot precisely at the shooting range. Only in this case you can hope to be successful, because running and shooting are the two main components of biathlon. Valera has been diligent in his ski trainings, which is why he runs really fast, however, his shooting accuracy is nothing to write home about.On a biathlon base where Valera is preparing for the competition, there is a huge rifle range with n targets. Each target have shape of a circle, and the center of each circle is located on the Ox axis. At the last training session Valera made the total of m shots. To make monitoring of his own results easier for him, one rather well-known programmer (of course it is you) was commissioned to write a program that would reveal how many and which targets Valera hit. More specifically, for each target the program must print the number of the first successful shot (in the target), or \"-1\" if this was not hit. The target is considered hit if the shot is inside the circle or on its boundary. Valera is counting on you and perhaps, thanks to you he will one day win international competitions.",
    "prob_desc_output_spec": "Print on the first line a single number, the number of targets hit by Valera. Print on the second line for each of the targets the number of its first hit or \"-1\" (without quotes) if this number does not exist. Separate numbers with spaces.",
    "prob_desc_input_spec": "The first line of the input file contains the integer n (1 ≤ n ≤ 104), which is the number of targets. The next n lines contain descriptions of the targets. Each target is a circle whose center is located on the Ox axis. Each circle is given by its coordinate of the center x ( - 2·104 ≤ x ≤ 2·104) and its radius r (1 ≤ r ≤ 1000). It is guaranteed that no two targets coincide, intersect or are nested into each other, but they can touch each other.  The next line contains integer m (1 ≤ m ≤ 2·105), which is the number of shots. Next m lines contain descriptions of the shots, which are points on the plane, given by their coordinates x and y ( - 2·104 ≤ x, y ≤ 2·104). All the numbers in the input are integers.  Targets and shots are numbered starting from one in the order of the input.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1700,
    "file_name": "train_033.jsonl",
    "code_uid": "a93824cfebef8130eba05148cf0a8868",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n2 1\\n5 2\\n10 1\\n5\\n0 1\\n1 3\\n3 0\\n4 0\\n4 0\", \"3\\n3 2\\n7 1\\n11 2\\n4\\n2 1\\n6 0\\n6 4\\n11 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "from bisect import bisect_left\n\nn = int(raw_input())\nxs = []\nfor i in xrange(n):\n  x, r = map(int, raw_input().split())\n  xs.append([x, r, i])\nxs.sort()\nm = int(raw_input())\nans = [-1 for i in xrange(n)]\nfor i in xrange(m):\n  x, y = map(int, raw_input().split())\n  pos = bisect_left(xs, [x, y])\n  if (pos < n) and (ans[xs[pos][2]] == -1):\n    if (x - xs[pos][0]) ** 2 + y ** 2 <= xs[pos][1] ** 2:\n      ans[xs[pos][2]] = i + 1\n  pos -= 1    \n  if (pos >= 0) and (ans[xs[pos][2]] == -1):\n    if (x - xs[pos][0]) ** 2 + y ** 2 <= xs[pos][1] ** 2:\n      ans[xs[pos][2]] = i + 1\n  \nprint len(filter(lambda x: x > 0, ans))\nprint ' '.join(map(str, ans))",
    "prob_desc_created_at": "1305299400",
    "tags": [
        "binary search",
        "implementation"
    ],
    "hidden_unit_tests": ""
}