{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"8\\n123\", \"1\\n3\"]",
    "src_uid": "1985566215ea5a7f22ef729bac7205ed",
    "prob_desc_notes": "NoteIn the first test sample B first corrects the error number 8, then the error number 123.In the second test sample B first corrects the error number 1, then the error number 3. Note that if there are multiple errors with the same number, B can correct only one of them in one step. ",
    "prob_desc_description": "A and B are preparing themselves for programming contests.B loves to debug his code. But before he runs the solution and starts debugging, he has to first compile the code.Initially, the compiler displayed n compilation errors, each of them is represented as a positive integer. After some effort, B managed to fix some mistake and then another one mistake.However, despite the fact that B is sure that he corrected the two errors, he can not understand exactly what compilation errors disappeared — the compiler of the language which B uses shows errors in the new order every time! B is sure that unlike many other programming languages, compilation errors for his programming language do not depend on each other, that is, if you correct one error, the set of other error does not change.Can you help B find out exactly what two errors he corrected?",
    "prob_desc_output_spec": "Print two numbers on a single line: the numbers of the compilation errors that disappeared after B made the first and the second correction, respectively. ",
    "prob_desc_input_spec": "The first line of the input contains integer n (3 ≤ n ≤ 105) — the initial number of compilation errors. The second line contains n space-separated integers a1, a2, ..., an (1 ≤ ai ≤ 109) — the errors the compiler displayed for the first time.  The third line contains n - 1 space-separated integers b1, b2, ..., bn - 1 — the errors displayed at the second compilation. It is guaranteed that the sequence in the third line contains all numbers of the second string except for exactly one.  The fourth line contains n - 2 space-separated integers с1, с2, ..., сn - 2 — the errors displayed at the third compilation. It is guaranteed that the sequence in the fourth line contains all numbers of the third line except for exactly one. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_004.jsonl",
    "code_uid": "2d6f9392ef66d06e372caa5283337a02",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5\\n1 5 8 123 7\\n123 7 5 1\\n5 1 7\", \"6\\n1 4 3 3 5 7\\n3 7 5 4 3\\n4 3 7 5\"]",
    "exec_outcome": "PASSED",
    "source_code": "\nn=int(input())\ns1=input().split()\ns1=sorted(s1)\ns2=input().split()\ns2=sorted(s2)\ns2.append(0)\ns3=input().split()\ns3=sorted(s3)\ns3.append(0)\nfor i in range(len(s1)):\n        if int(s1[i])-int(s2[i])!=0:\n            print(s1[i])\n            break\n\n\nfor i in range(len(s2)):\n        if int(s2[i])-int(s3[i])!=0:\n            print(s2[i])\n            break\n",
    "prob_desc_created_at": "1425128400",
    "tags": [
        "data structures",
        "implementation",
        "sortings"
    ],
    "hidden_unit_tests": ""
}