{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"YES\", \"NO\"]",
    "src_uid": "c659bdeda1c1da08cfc7f71367222332",
    "prob_desc_notes": "Note  First example: you can simply swap two letters in string \"ab\". So we get \"ba\".  Second example: we can't change string \"aa\" into string \"ab\", because \"aa\" does not contain letter \"b\". ",
    "prob_desc_description": "Some dwarves that are finishing the StUDY (State University for Dwarven Youngsters) Bachelor courses, have been told \"no genome, no degree\". That means that all dwarves should write a thesis on genome. Dwarven genome is far from simple. It is represented by a string that consists of lowercase Latin letters.Dwarf Misha has already chosen the subject for his thesis: determining by two dwarven genomes, whether they belong to the same race. Two dwarves belong to the same race if we can swap two characters in the first dwarf's genome and get the second dwarf's genome as a result. Help Dwarf Misha and find out whether two gnomes belong to the same race or not.",
    "prob_desc_output_spec": "Print \"YES\", if the dwarves belong to the same race. Otherwise, print \"NO\".",
    "prob_desc_input_spec": "The first line contains the first dwarf's genome: a non-empty string, consisting of lowercase Latin letters. The second line contains the second dwarf's genome: a non-empty string, consisting of lowercase Latin letters. The number of letters in each genome doesn't exceed 105. It is guaranteed that the strings that correspond to the genomes are different. The given genomes may have different length.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_005.jsonl",
    "code_uid": "74f9f2db9474289817555c34f9037caf",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"ab\\nba\", \"aa\\nab\"]",
    "exec_outcome": "PASSED",
    "source_code": "p=input()\np=p.replace('',' ')\np=p.split()\nq=input()\nq=q.replace('',' ')\nq=q.split()\nif len(p)==len(q):\n    c=0\n    l=[]\n    for i in range(len(p)):\n        if p[i]!=q[i]:\n            c+=1\n            l.append(p[i])\n            l.append(q[i])\n    if c==2:\n        d=0\n        for i in range(4):\n            if l.count(l[i])!=2:\n                d=1\n                break\n        if d==0:\n            print('YES')\n        else:\n            print('NO')\n    else:\n        print('NO')\nelse:\n    print('NO')",
    "prob_desc_created_at": "1336145400",
    "tags": [
        "implementation",
        "strings"
    ],
    "hidden_unit_tests": ""
}