{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"OK\", \"2 2\", \"4 0\"]",
    "src_uid": "30c4f155336cf762699a1bbc55a60d27",
    "prob_desc_notes": "NoteKeep in mind that in the second sample the mistake occurs not only on the second day, but also on the sixth day, when nobody waters the flowers. However, you have to print the second day, i.e. the day with the minimal number.",
    "prob_desc_description": "School holidays come in Berland. The holidays are going to continue for n days. The students of school №N are having the time of their lives and the IT teacher Marina Sergeyevna, who has spent all the summer busy checking the BSE (Berland State Examination) results, has finally taken a vacation break! Some people are in charge of the daily watering of flowers in shifts according to the schedule. However when Marina Sergeyevna was making the schedule, she was so tired from work and so lost in dreams of the oncoming vacation that she perhaps made several mistakes. In fact, it is possible that according to the schedule, on some days during the holidays the flowers will not be watered or will be watered multiple times. Help Marina Sergeyevna to find a mistake.",
    "prob_desc_output_spec": "Print \"OK\" (without quotes), if the schedule does not contain mistakes. Otherwise you have to find the minimal number of a day when the flowers will not be watered or will be watered multiple times, and output two integers — the day number and the number of times the flowers will be watered that day.",
    "prob_desc_input_spec": "The first input line contains two numbers n and m (1 ≤ n, m ≤ 100) — the number of days in Berland holidays and the number of people in charge of the watering respectively. The next m lines contain the description of the duty schedule. Each line contains two integers ai and bi (1 ≤ ai ≤ bi ≤ n), meaning that the i-th person in charge should water the flowers from the ai-th to the bi-th day inclusively, once a day. The duty shifts are described sequentially, i.e. bi ≤ ai + 1 for all i from 1 to n - 1 inclusively. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_007.jsonl",
    "code_uid": "29bfbdc318093c146b683410da242a3d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"10 5\\n1 2\\n3 3\\n4 6\\n7 7\\n8 10\", \"10 5\\n1 2\\n2 3\\n4 5\\n7 8\\n9 10\", \"10 5\\n1 2\\n3 3\\n5 7\\n7 7\\n7 10\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,m = map(int,raw_input().split())\na = [0]*n\nfor _ in xrange(m):\n\tb,c = map(int,raw_input().split())\n\tfor i in xrange(b,c+1,1):\n\t\ta[i-1]+=1\nfor i in xrange(n):\n\tif a[i]<>1:\n\t\tprint i+1,a[i]\n\t\texit(0)\nprint 'OK'",
    "prob_desc_created_at": "1289041200",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}