{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"Yes\\nNo\\nYes\"]",
    "src_uid": "34aa41871ee50f06e8acbd5eee94b493",
    "prob_desc_notes": "NoteThe first two sets are desribed in the statement.The third set produces garland \"RBRG\", for example.",
    "prob_desc_description": "Polycarp is sad — New Year is coming in few days but there is still no snow in his city. To bring himself New Year mood, he decided to decorate his house with some garlands.The local store introduced a new service this year, called \"Build your own garland\". So you can buy some red, green and blue lamps, provide them and the store workers will solder a single garland of them. The resulting garland will have all the lamps you provided put in a line. Moreover, no pair of lamps of the same color will be adjacent to each other in this garland!For example, if you provide $$$3$$$ red, $$$3$$$ green and $$$3$$$ blue lamps, the resulting garland can look like this: \"RGBRBGBGR\" (\"RGB\" being the red, green and blue color, respectively). Note that it's ok to have lamps of the same color on the ends of the garland.However, if you provide, say, $$$1$$$ red, $$$10$$$ green and $$$2$$$ blue lamps then the store workers won't be able to build any garland of them. Any garland consisting of these lamps will have at least one pair of lamps of the same color adjacent to each other. Note that the store workers should use all the lamps you provided.So Polycarp has bought some sets of lamps and now he wants to know if the store workers can build a garland from each of them.",
    "prob_desc_output_spec": "Print $$$t$$$ lines — for each set of lamps print \"Yes\" if the store workers can build a garland from them and \"No\" otherwise.",
    "prob_desc_input_spec": "The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 100$$$) — the number of sets of lamps Polycarp has bought. Each of the next $$$t$$$ lines contains three integers $$$r$$$, $$$g$$$ and $$$b$$$ ($$$1 \\le r, g, b \\le 10^9$$$) — the number of red, green and blue lamps in the set, respectively.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 900,
    "file_name": "train_000.jsonl",
    "code_uid": "d53ffbdbe544d9997b359900cde00fa8",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n3 3 3\\n1 10 2\\n2 1 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "t=int(input())\nfor _ in range(t):\n    l=list(map(int,input().split()))\n    if 2*max(l)<=sum(l)+1:\n        print('Yes')\n    else:\n        print('No')",
    "prob_desc_created_at": "1577457600",
    "tags": [
        "math"
    ],
    "hidden_unit_tests": ""
}