{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"6\"]",
    "src_uid": "f5acd95067656fa7667210af2c9bec81",
    "prob_desc_notes": "NoteIn the first sample, if the students switch their tasks, they will be able to finish them in 3 + 3 = 6 time units.",
    "prob_desc_description": "Harry Water, Ronaldo, Her-my-oh-knee and their friends have started a new school year at their MDCS School of Speechcraft and Misery. At the time, they are very happy to have seen each other after a long time. The sun is shining, birds are singing, flowers are blooming, and their Potions class teacher, professor Snipe is sulky as usual. Due to his angst fueled by disappointment in his own life, he has given them a lot of homework in Potions class. Each of the n students has been assigned a single task. Some students do certain tasks faster than others. Thus, they want to redistribute the tasks so that each student still does exactly one task, and that all tasks are finished. Each student has their own laziness level, and each task has its own difficulty level. Professor Snipe is trying hard to improve their work ethics, so each student’s laziness level is equal to their task’s difficulty level. Both sets of values are given by the sequence a, where ai represents both the laziness level of the i-th student and the difficulty of his task. The time a student needs to finish a task is equal to the product of their laziness level and the task’s difficulty. They are wondering, what is the minimum possible total time they must spend to finish all tasks if they distribute them in the optimal way. Each person should receive one task and each task should be given to one person. Print the answer modulo 10 007.",
    "prob_desc_output_spec": "Print the minimum total time to finish all tasks modulo 10 007.",
    "prob_desc_input_spec": "The first line of input contains integer n (1 ≤ n ≤ 100 000) — the number of tasks. The next n lines contain exactly one integer number ai (1 ≤ ai ≤ 100 000) — both the difficulty of the initial task and the laziness of the i-th students.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_023.jsonl",
    "code_uid": "956f60d561e586b2b9746c6e56871610",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n1\\n3\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(raw_input())\na = [0] * n\nfor i in xrange(n):\n    a[i] = int(raw_input())\na.sort()\nans = 0\nfor i in xrange(n):\n    ans += a[i] * a[n - i - 1]\nprint ans % 10007\n",
    "prob_desc_created_at": "1473584400",
    "tags": [
        "implementation",
        "sortings"
    ],
    "hidden_unit_tests": ""
}