{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"0\", \"1\", \"2\"]",
    "src_uid": "bdd86c8bc54bbac6e2bb5a9d68b6eb1c",
    "prob_desc_notes": "NoteThe first sample contains the permutation, which is why no replacements are required.In the second sample it is enough to replace the first element with the number 1 and that will make the sequence the needed permutation.In the third sample we can replace the second element with number 4 and the fourth element with number 2.",
    "prob_desc_description": "\"Hey, it's homework time\" — thought Polycarpus and of course he started with his favourite subject, IT. Polycarpus managed to solve all tasks but for the last one in 20 minutes. However, as he failed to solve the last task after some considerable time, the boy asked you to help him.The sequence of n integers is called a permutation if it contains all integers from 1 to n exactly once.You are given an arbitrary sequence a1, a2, ..., an containing n integers. Each integer is not less than 1 and not greater than 5000. Determine what minimum number of elements Polycarpus needs to change to get a permutation (he should not delete or add numbers). In a single change he can modify any single sequence element (i. e. replace it with another integer).",
    "prob_desc_output_spec": "Print the only number — the minimum number of changes needed to get the permutation.",
    "prob_desc_input_spec": "The first line of the input data contains an integer n (1 ≤ n ≤ 5000) which represents how many numbers are in the sequence. The second line contains a sequence of integers ai (1 ≤ ai ≤ 5000, 1 ≤ i ≤ n).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_003.jsonl",
    "code_uid": "971792f9d89d208f7e305f134812e6be",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n3 1 2\", \"2\\n2 2\", \"5\\n5 3 3 3 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "# prob B\n\nn = input()\nseq = raw_input()\n\nseq = [int(i) for i in seq.split()]\nseq.sort()\n\ntot = 0\nright_seq = range(1, n+1)\nfor num in seq:\n    if num in right_seq:\n        right_seq.remove(num)\n    else:\n        tot += 1\n\nprint tot\n",
    "prob_desc_created_at": "1324015200",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}