{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"18\", \"40\", \"400\"]",
    "src_uid": "913925f7b43ad737809365eba040e8da",
    "prob_desc_notes": null,
    "prob_desc_description": "'Jeopardy!' is an intellectual game where players answer questions and earn points. Company Q conducts a simplified 'Jeopardy!' tournament among the best IT companies. By a lucky coincidence, the old rivals made it to the finals: company R1 and company R2. The finals will have n questions, m of them are auction questions and n - m of them are regular questions. Each question has a price. The price of the i-th question is ai points. During the game the players chose the questions. At that, if the question is an auction, then the player who chose it can change the price if the number of his current points is strictly larger than the price of the question. The new price of the question cannot be less than the original price and cannot be greater than the current number of points of the player who chose the question. The correct answer brings the player the points equal to the price of the question. The wrong answer to the question reduces the number of the player's points by the value of the question price.The game will go as follows. First, the R2 company selects a question, then the questions are chosen by the one who answered the previous question correctly. If no one answered the question, then the person who chose last chooses again.All R2 employees support their team. They want to calculate what maximum possible number of points the R2 team can get if luck is on their side during the whole game (they will always be the first to correctly answer questions). Perhaps you are not going to be surprised, but this problem was again entrusted for you to solve.",
    "prob_desc_output_spec": "In the single line, print the answer to the problem — the maximum points the R2 company can get if it plays optimally well. It is guaranteed that the answer fits into the integer 64-bit signed type.",
    "prob_desc_input_spec": "The first line contains two space-separated integers n and m (1 ≤ n, m ≤ 100; m ≤ min(n, 30)) — the total number of questions and the number of auction questions, correspondingly. The second line contains n space-separated integers a1, a2, ..., an (1 ≤ ai ≤ 107) — the prices of the questions. The third line contains m distinct integers bi (1 ≤ bi ≤ n) — the numbers of auction questions. Assume that the questions are numbered from 1 to n.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_017.jsonl",
    "code_uid": "6f8953652b5dd02d1d4786b5764a669c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 1\\n1 3 7 5\\n3\", \"3 2\\n10 3 8\\n2 3\", \"2 2\\n100 200\\n1 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m = map(int, input().split())\nprices = list(map(int, input().split()))\nnormal = []\nauct = []\nq = list(map(int, input().split()))\nsum = 0\nfor i in range(n):\n    if i + 1 in q:\n        auct.append(prices[i])\n    else:\n        sum += prices[i]\nauct = sorted(auct, reverse=True)\nfor elem in auct:\n    sum += max(elem, sum)\nprint(sum)",
    "prob_desc_created_at": "1397977200",
    "tags": [
        "greedy",
        "math"
    ],
    "hidden_unit_tests": ""
}