{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"3\"]",
    "src_uid": "6ddf0be1cc8c0ed6b86eb9e901189bf1",
    "prob_desc_notes": "NoteNote to the first example: DravDe leaves the second and the third animal on the farm. The second animal will eat one ton of food on the second day and one ton on the third day. The third animal will eat one ton of food on the third day.",
    "prob_desc_description": "Once upon a time DravDe, an outstanding person famous for his professional achievements (as you must remember, he works in a warehouse storing Ogudar-Olok, a magical but non-alcoholic drink) came home after a hard day. That day he had to drink 9875 boxes of the drink and, having come home, he went to bed at once.DravDe dreamt about managing a successful farm. He dreamt that every day one animal came to him and asked him to let it settle there. However, DravDe, being unimaginably kind, could send the animal away and it went, rejected. There were exactly n days in DravDe’s dream and the animal that came on the i-th day, ate exactly ci tons of food daily starting from day i. But if one day the animal could not get the food it needed, it got really sad. At the very beginning of the dream there were exactly X tons of food on the farm.DravDe woke up terrified...When he retold the dream to you, he couldn’t remember how many animals were on the farm by the end of the n-th day any more, but he did remember that nobody got sad (as it was a happy farm) and that there was the maximum possible amount of the animals. That’s the number he wants you to find out. It should be noticed that the animals arrived in the morning and DravDe only started to feed them in the afternoon, so that if an animal willing to join them is rejected, it can’t eat any farm food. But if the animal does join the farm, it eats daily from that day to the n-th.",
    "prob_desc_output_spec": "Output the only number — the maximum possible amount of animals on the farm by the end of the n-th day given that the food was enough for everybody.",
    "prob_desc_input_spec": "The first input line contains integers n and X (1 ≤ n ≤ 100, 1 ≤ X ≤ 104) — amount of days in DravDe’s dream and the total amount of food (in tons) that was there initially. The second line contains integers ci (1 ≤ ci ≤ 300). Numbers in the second line are divided by a space.",
    "prob_desc_output_to": "output.txt",
    "prob_desc_input_from": "input.txt",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1700,
    "file_name": "train_073.jsonl",
    "code_uid": "f490333fa6d714f32397a8fa951e217c",
    "prob_desc_memory_limit": "64 megabytes",
    "prob_desc_sample_inputs": "[\"3 4\\n1 1 1\", \"3 6\\n1 1 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\nsys.stdin = open('input.txt')\nsys.stdout = open('output.txt', 'w')\nf = lambda: map(int, input().split())\nn, s = f()\nk = 0\nfor q in sorted(q * (n - i) for i, q in enumerate(f())):\n\ts -= q\n\tif s < 0: break\n\tk += 1\nprint(k)",
    "prob_desc_created_at": "1287471600",
    "tags": [
        "dp",
        "greedy"
    ],
    "hidden_unit_tests": ""
}