{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1 1\", \"4 1\", \"2 4\"]",
    "src_uid": "eb2d1072c5308d9ef686315a122d9d3c",
    "prob_desc_notes": "NoteIn the third sample the maximum beauty difference is 2 and there are 4 ways to do this:  choosing the first and the second flowers;  choosing the first and the fifth flowers;  choosing the fourth and the second flowers;  choosing the fourth and the fifth flowers. ",
    "prob_desc_description": "Pashmak decided to give Parmida a pair of flowers from the garden. There are n flowers in the garden and the i-th of them has a beauty number bi. Parmida is a very strange girl so she doesn't want to have the two most beautiful flowers necessarily. She wants to have those pairs of flowers that their beauty difference is maximal possible!Your task is to write a program which calculates two things:  The maximum beauty difference of flowers that Pashmak can give to Parmida.  The number of ways that Pashmak can pick the flowers. Two ways are considered different if and only if there is at least one flower that is chosen in the first way and not chosen in the second way. ",
    "prob_desc_output_spec": "The only line of output should contain two integers. The maximum beauty difference and the number of ways this may happen, respectively.",
    "prob_desc_input_spec": "The first line of the input contains n (2 ≤ n ≤ 2·105). In the next line there are n space-separated integers b1, b2, ..., bn (1 ≤ bi ≤ 109).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_003.jsonl",
    "code_uid": "e2272ae5b8019295cf9a51c8eba4b3e6",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n1 2\", \"3\\n1 4 5\", \"5\\n3 1 2 3 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "b=int(input())\na=list(map(int, input().split()))\nx,n=max(a),min(a)\nprint(x-n,b*(b-1)//2 if x==n else a.count(x)*a.count(n)) ",
    "prob_desc_created_at": "1408116600",
    "tags": [
        "combinatorics",
        "implementation",
        "sortings"
    ],
    "hidden_unit_tests": ""
}