{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"11\", \"9\", \"10\"]",
    "src_uid": "6b30d2599e2aeabc7a6b7e6ab003982d",
    "prob_desc_notes": "NoteIn the first sample test all the five tasks can be complemented with four questions and joined into one quest.In the second sample test it is impossible to use all the five tasks, but you can take two of them, the most interesting ones.In the third sample test the optimal strategy is to include only the second task into the quest.Here is the picture that illustrates the answers to the sample tests. The blue circles represent the questions, the two arrows that go from every circle represent where a person goes depending on his answer to that question. The tasks are the red ovals.  ",
    "prob_desc_description": "Polycarp is making a quest for his friends. He has already made n tasks, for each task the boy evaluated how interesting it is as an integer qi, and the time ti in minutes needed to complete the task. An interesting feature of his quest is: each participant should get the task that is best suited for him, depending on his preferences. The task is chosen based on an interactive quiz that consists of some questions. The player should answer these questions with \"yes\" or \"no\". Depending on the answer to the question, the participant either moves to another question or goes to one of the tasks that are in the quest. In other words, the quest is a binary tree, its nodes contain questions and its leaves contain tasks. We know that answering any of the questions that are asked before getting a task takes exactly one minute from the quest player. Polycarp knows that his friends are busy people and they can't participate in the quest for more than T minutes. Polycarp wants to choose some of the n tasks he made, invent the corresponding set of questions for them and use them to form an interactive quiz as a binary tree so that no matter how the player answers quiz questions, he spends at most T minutes on completing the whole quest (that is, answering all the questions and completing the task). Specifically, the quest can contain zero questions and go straight to the task. Each task can only be used once (i.e., the people who give different answers to questions should get different tasks).Polycarp wants the total \"interest\" value of the tasks involved in the quest to be as large as possible. Help him determine the maximum possible total interest value of the task considering that the quest should be completed in T minutes at any variant of answering questions.",
    "prob_desc_output_spec": "Print a single integer — the maximum possible total interest value of all the tasks in the quest.",
    "prob_desc_input_spec": "The first line contains two integers n and T (1 ≤ n ≤ 1000, 1 ≤ T ≤ 100) — the number of tasks made by Polycarp and the maximum time a quest player should fit into. Next n lines contain two integers ti, qi (1 ≤ ti ≤ T, 1 ≤ qi ≤ 1000) each — the time in minutes needed to complete the i-th task and its interest value.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 2100,
    "file_name": "train_012.jsonl",
    "code_uid": "c92c7ffc677f98007f197469de40196a",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5 5\\n1 1\\n1 1\\n2 2\\n3 3\\n4 4\", \"5 5\\n4 1\\n4 2\\n4 3\\n4 4\\n4 5\", \"2 2\\n1 1\\n2 10\"]",
    "exec_outcome": "PASSED",
    "source_code": "import zlib\nimport bz2\n\nN=105\nM=1005\nx = [[0 for x in range(M)] for x in range(N)]\n\ndef upd(a, b):\n\tx[a][0]=x[a][0]+1\n\tx[a][x[a][0]]=b\n\ndef dot(n,T):\n\tfor i in range(n):\n\t\tt,q=raw_input().split(\" \")\n\t\tupd(int(t),int(q))\n\tfor i in range(T):\n\t\tx[i+1][1:x[i+1][0]+1]=sorted(x[i+1][1:x[i+1][0]+1])\n\t\tj=x[i+1][0]\n\t\twhile True:\n\t\t\tif(j>1):\n\t\t\t\tupd(i+2,x[i+1][j]+x[i+1][j-1])\n\t\t\telse:\n\t\t\t\tupd(i+2,x[i+1][j])\n\t\t\tj=j-2\n\t\t\tif(j<=0):\n\t\t\t\tbreak\n\tprint x[T][x[T][0]]\n\nn,T=raw_input().split(' ')\ndot(int(n),int(T))\n\ndef comptest(s):\n    print 'original length:', len(s)\n    print 'zlib compressed length:', zlib.compress(s)\n    print 'bz2 compressed length:', bz2.compress(s)\n",
    "prob_desc_created_at": "1430668800",
    "tags": [
        "dp",
        "greedy"
    ],
    "hidden_unit_tests": ""
}