{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"17\"]",
    "src_uid": "3b4100b844e925af971061df42521712",
    "prob_desc_notes": "NoteIn the sample test the most effective way is to make a workgroup from employees number 1, 2, 4, 5, 6.",
    "prob_desc_description": "One Big Software Company has n employees numbered from 1 to n. The director is assigned number 1. Every employee of the company except the director has exactly one immediate superior. The director, of course, doesn't have a superior.We will call person a a subordinates of another person b, if either b is an immediate supervisor of a, or the immediate supervisor of a is a subordinate to person b. In particular, subordinates of the head are all other employees of the company.To solve achieve an Important Goal we need to form a workgroup. Every person has some efficiency, expressed by a positive integer ai, where i is the person's number. The efficiency of the workgroup is defined as the total efficiency of all the people included in it.The employees of the big software company are obsessed with modern ways of work process organization. Today pair programming is at the peak of popularity, so the workgroup should be formed with the following condition. Each person entering the workgroup should be able to sort all of his subordinates who are also in the workgroup into pairs. In other words, for each of the members of the workgroup the number of his subordinates within the workgroup should be even.Your task is to determine the maximum possible efficiency of the workgroup formed at observing the given condition. Any person including the director of company can enter the workgroup.",
    "prob_desc_output_spec": "Print a single integer — the maximum possible efficiency of the workgroup.",
    "prob_desc_input_spec": "The first line contains integer n (1 ≤ n ≤ 2·105) — the number of workers of the Big Software Company.  Then n lines follow, describing the company employees. The i-th line contains two integers pi, ai (1 ≤ ai ≤ 105) — the number of the person who is the i-th employee's immediate superior and i-th employee's efficiency. For the director p1 =  - 1, for all other people the condition 1 ≤ pi &lt; i is fulfilled.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2000,
    "file_name": "train_006.jsonl",
    "code_uid": "4594880860d878e618f5a0dbaa035fd7",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"7\\n-1 3\\n1 2\\n1 1\\n1 4\\n4 5\\n4 3\\n5 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\nt = [list(map(int, input().split())) for q in range(n)]\nn += 1\nu = [-1e7] * n\nv = [0] * n\nfor i, (j, a) in list(enumerate(t, 1))[::-1]:\n    u[i] = max(u[i], v[i] + a)\n    v[j], u[j] = max(v[j] + v[i], u[j] + u[i]), max(v[j] + u[i], u[j] + v[i])\nprint(u[1])",
    "prob_desc_created_at": "1429286400",
    "tags": [
        "dp",
        "graphs",
        "dfs and similar",
        "trees",
        "strings"
    ],
    "hidden_unit_tests": ""
}