{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"0\", \"1\", \"2\", \"3\", \"3\", \"12345678901234567890\", \"GOTO Vasilisa.\"]",
    "src_uid": "3060ecad253a2b4d4fac39e91fcd6c95",
    "prob_desc_notes": null,
    "prob_desc_description": "In a far away kingdom lived the King, the Prince, the Shoemaker, the Dressmaker and many other citizens. They lived happily until great trouble came into the Kingdom. The ACMers settled there.Most damage those strange creatures inflicted upon the kingdom was that they loved high precision numbers. As a result, the Kingdom healers had already had three appointments with the merchants who were asked to sell, say, exactly 0.273549107 beer barrels. To deal with the problem somehow, the King issued an order obliging rounding up all numbers to the closest integer to simplify calculations. Specifically, the order went like this: If a number's integer part does not end with digit 9 and its fractional part is strictly less than 0.5, then the rounded up number coincides with the number’s integer part.  If a number's integer part does not end with digit 9 and its fractional part is not less than 0.5, the rounded up number is obtained if we add 1 to the last digit of the number’s integer part. If the number’s integer part ends with digit 9, to round up the numbers one should go to Vasilisa the Wise. In the whole Kingdom she is the only one who can perform the tricky operation of carrying into the next position. Merchants found the algorithm very sophisticated and they asked you (the ACMers) to help them. Can you write a program that would perform the rounding according to the King’s order?",
    "prob_desc_output_spec": "If the last number of the integer part is not equal to 9, print the rounded-up number without leading zeroes. Otherwise, print the message \"GOTO Vasilisa.\" (without the quotes).",
    "prob_desc_input_spec": "The first line contains a single number to round up — the integer part (a non-empty set of decimal digits that do not start with 0 — with the exception of a case when the set consists of a single digit — in this case 0 can go first), then follows character «.» (a dot), and then follows the fractional part (any non-empty set of decimal digits). The number's length does not exceed 1000 characters, including the dot. There are no other characters in the input data.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 800,
    "file_name": "train_003.jsonl",
    "code_uid": "77591e8070f7dfe0343f22b3d30ba52e",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"0.0\", \"1.49\", \"1.50\", \"2.71828182845904523536\", \"3.14159265358979323846\", \"12345678901234567890.1\", \"123456789123456789.999\"]",
    "exec_outcome": "PASSED",
    "source_code": "import decimal\nD=decimal.Decimal\ns = input()\nplace = s.index(\".\")\nlast = s[place-1]\nnext = s[place+1]\n#print(last,int(next)<5)\n\nif last == \"9\": #and int(next)>=5:\n        print(\"GOTO Vasilisa.\")\n#elif last==\"9\" and int(next)<5:\n        #print(\"HI\")\n        #print(s[:place])\nelif last!=\"9\" and int(next)>=5:\n        #print(\"HO\")\n        print(s[:place-1]+str((int(s[place-1])+1)))\nelse:\n        #print(\"NEATO\")\n        print(s[:place])\n\n\n\n",
    "prob_desc_created_at": "1311346800",
    "tags": [
        "strings"
    ],
    "hidden_unit_tests": ""
}