{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1 1\\n1 2\\n2 1\\n2 2\\n-1 -1\", \"1 1\\n1 1\\n1 1\\n1 1\"]",
    "src_uid": "44d45a7e21418470bda396d91c65e736",
    "prob_desc_notes": null,
    "prob_desc_description": "Once upon a time, when the world was more beautiful, the sun shone brighter, the grass was greener and the sausages tasted better Arlandia was the most powerful country. And its capital was the place where our hero DravDe worked. He couldn’t program or make up problems (in fact, few people saw a computer those days) but he was nevertheless happy. He worked in a warehouse where a magical but non-alcoholic drink Ogudar-Olok was kept. We won’t describe his work in detail and take a better look at a simplified version of the warehouse.The warehouse has one set of shelving. It has n shelves, each of which is divided into m sections. The shelves are numbered from top to bottom starting from 1 and the sections of each shelf are numbered from left to right also starting from 1. Each section can contain exactly one box of the drink, and try as he might, DravDe can never put a box in a section that already has one. In the course of his work DravDe frequently notices that he has to put a box in a filled section. In that case his solution is simple. DravDe ignores that section and looks at the next one to the right. If it is empty, he puts the box there. Otherwise he keeps looking for the first empty section to the right. If no empty section is found by the end of the shelf, he looks at the shelf which is under it, then the next one, etc. Also each time he looks at a new shelf he starts from the shelf’s beginning. If DravDe still can’t find an empty section for the box, he immediately drinks it all up and throws the empty bottles away not to be caught.After one great party with a lot of Ogudar-Olok drunk DravDe asked you to help him. Unlike him, you can program and therefore modeling the process of counting the boxes in the warehouse will be easy work for you.The process of counting contains two types of query messages:   «+1 x y id» (where x, y are integers, 1 ≤ x ≤ n, 1 ≤ y ≤ m, and id is a string of lower case Latin letters — from 1 to 10 characters long). That query means that the warehouse got a box identified as id, which should be put in the section y on the shelf x. If the section is full, use the rules described above. It is guaranteed that every moment of the process the identifiers of all the boxes in the warehouse are different. You don’t have to answer this query.  «-1 id» (where id is a string of lower case Latin letters — from 1 to 10 characters long). That query means that a box identified as id is removed from the warehouse. You have to answer this query (see output format). ",
    "prob_desc_output_spec": "For each query of the «-1 id» type output two numbers in a separate line — index of the shelf and index of the section where the box with this identifier lay. If there was no such box in the warehouse when the query was made, output «-1 -1» without quotes.",
    "prob_desc_input_spec": "The first input line contains integers n, m and k (1 ≤ n, m ≤ 30, 1 ≤ k ≤ 2000) — the height, the width of shelving and the amount of the operations in the warehouse that you need to analyze. In the following k lines the queries are given in the order of appearance in the format described above.",
    "prob_desc_output_to": "output.txt",
    "prob_desc_input_from": "input.txt",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1700,
    "file_name": "train_021.jsonl",
    "code_uid": "c0fa4b5df329bc7ce03647885d556eb8",
    "prob_desc_memory_limit": "64 megabytes",
    "prob_desc_sample_inputs": "[\"2 2 9\\n+1 1 1 cola\\n+1 1 1 fanta\\n+1 1 1 sevenup\\n+1 1 1 whitekey\\n-1 cola\\n-1 fanta\\n-1 sevenup\\n-1 whitekey\\n-1 cola\", \"2 2 8\\n+1 1 1 cola\\n-1 cola\\n+1 1 1 fanta\\n-1 fanta\\n+1 1 1 sevenup\\n-1 sevenup\\n+1 1 1 whitekey\\n-1 whitekey\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\ndef add(x,y,id_t,shelves,track):\n    element = ((x-1)%n)*m + y - 1;\n    if shelves[element]:\n        element +=1\n        # made the mistake of cycling through them \n        # only move to the right. No rollbacks \n        while element!= cap:\n            if not shelves[element]:\n                shelves[element] = 1\n                track.update({id_t:(element//m+1,element%m+1)})\n                break\n            element +=1\n    else:\n        shelves[element] = 1\n        track.update({id_t:(x,y)})\ndef remove(id_t,track,shelves):\n    if id_t not in track: \n        return False\n    else:\n        val = track.pop(id_t,None)\n        index = ((val[0]-1)%n)*m + val[1] - 1\n        shelves[index] = 0\n        return val\nsys.stdin = open('input.txt')\nsys.stdout = open('output.txt', 'w')\nn,m,k = map(int,input().split())\nshelves,cap= [ 0 for _ in range(n*m)],n*m\ntrack = {}\nfor _ in range(k):\n    query = input().split()\n    if query[0] == '+1':\n        x,y,id_t = int(query[1]),int(query[2]),query[3]\n        add(x,y,id_t,shelves,track)\n    else:\n        ch = remove(query[1],track,shelves)\n        if not ch: print(-1,-1)\n        else: print(ch[0],ch[1])",
    "prob_desc_created_at": "1287471600",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}