{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1\", \"0\", \"8\"]",
    "src_uid": "0ff72e5d71c6721abdbb7c504faec93d",
    "prob_desc_notes": "NoteIn the first example, there are as many stores, as houses. If the family do not take a single kilo of sweets from home, in order to treat the inhabitants of the first house, they will need to make at least one step back, and they have absolutely no time for it. If they take one kilogram of sweets, they won't need to go back.In the second example, the number of shops is equal to the number of houses and plenty of time. Available at all stores passing out candy in one direction and give them when passing in the opposite direction.In the third example, the shops on the street are fewer than houses. The Lou Whos have to take the missing number of kilograms of sweets with them from home.",
    "prob_desc_description": "For he knew every Who down in Whoville beneath, Was busy now, hanging a mistletoe wreath. \"And they're hanging their stockings!\" he snarled with a sneer, \"Tomorrow is Christmas! It's practically here!\"Dr. Suess, How The Grinch Stole ChristmasChristmas celebrations are coming to Whoville. Cindy Lou Who and her parents Lou Lou Who and Betty Lou Who decided to give sweets to all people in their street. They decided to give the residents of each house on the street, one kilogram of sweets. So they need as many kilos of sweets as there are homes on their street.The street, where the Lou Who family lives can be represented as n consecutive sections of equal length. You can go from any section to a neighbouring one in one unit of time. Each of the sections is one of three types: an empty piece of land, a house or a shop. Cindy Lou and her family can buy sweets in a shop, but no more than one kilogram of sweets in one shop (the vendors care about the residents of Whoville not to overeat on sweets).After the Lou Who family leave their home, they will be on the first section of the road. To get to this section of the road, they also require one unit of time. We can assume that Cindy and her mom and dad can carry an unlimited number of kilograms of sweets. Every time they are on a house section, they can give a kilogram of sweets to the inhabitants of the house, or they can simply move to another section. If the family have already given sweets to the residents of a house, they can't do it again. Similarly, if they are on the shop section, they can either buy a kilo of sweets in it or skip this shop. If they've bought a kilo of sweets in a shop, the seller of the shop remembered them and the won't sell them a single candy if they come again. The time to buy and give sweets can be neglected. The Lou Whos do not want the people of any house to remain without food.The Lou Whos want to spend no more than t time units of time to give out sweets, as they really want to have enough time to prepare for the Christmas celebration. In order to have time to give all the sweets, they may have to initially bring additional k kilos of sweets.Cindy Lou wants to know the minimum number of k kilos of sweets they need to take with them, to have time to give sweets to the residents of each house in their street.Your task is to write a program that will determine the minimum possible value of k.",
    "prob_desc_output_spec": "If there isn't a single value of k that makes it possible to give sweets to everybody in at most t units of time, print in a single line \"-1\" (without the quotes). Otherwise, print on a single line the minimum possible value of k.",
    "prob_desc_input_spec": "The first line of the input contains two space-separated integers n and t (2 ≤ n ≤ 5·105, 1 ≤ t ≤ 109). The second line of the input contains n characters, the i-th of them equals \"H\" (if the i-th segment contains a house), \"S\" (if the i-th segment contains a shop) or \".\" (if the i-th segment doesn't contain a house or a shop).  It is guaranteed that there is at least one segment with a house.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 2300,
    "file_name": "train_041.jsonl",
    "code_uid": "a3190aabfac43f15fd4085de57bed7fd",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"6 6\\nHSHSHS\", \"14 100\\n...HHHSSS...SH\", \"23 50\\nHHSS.......SSHHHHHHHHHH\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\ndef RedirectIO():\n    sys.stdin=open(\"test.in\",\"r\")\n#    sys.stdout=open(\"output.txt\",\"w\")\n#RedirectIO()\ndef calcTime(sections,x,sum):\n    ans=0\n    start=x\n    houres=shops=0\n    for i in xrange(x,len(sections)):\n        if sum==0: break\n        ans+=1\n        if sections[i]=='H':\n            if shops:\n                shops-=1\n                sum-=1\n            else:\n                if houres==0:\n                    start=i\n                houres+=1\n        elif sections[i]=='S':\n            shops+=1\n            if shops==houres:\n                sum-=shops\n                shops=houres=0\n                if sum:\n                    if (i-start)*2>=len(sections)-start-1:\n                        ans+=len(sections)-i-1+len(sections)-start-1\n                        break\n                    ans+=(i-start)*2\n                else:\n                    ans+=(i-start)\n    return ans\ndef check(sections,k,t,sum):\n#    print k,\n    i=0\n    for ch in sections:\n        if sum==0:\n            return True\n        if ch=='H':\n            if k:\n                k-=1\n                sum-=1\n            else:\n                break\n        elif ch=='S':\n            k+=1\n        i+=1\n    ans=i+calcTime(sections,i,sum)\n#    print i,ans-i\n    return ans<=t\ndef main():    \n    n,t=map(int,raw_input().split())\n    sections=raw_input()\n    houres=shops=need=cur=last=i=0\n    for ch in sections:\n        i+=1\n        if ch=='H':\n            if cur:\n                cur-=1\n            else:\n                need+=1\n            houres+=1\n            last=i\n        elif ch=='S':\n            cur+=1\n            shops+=1\n    if last>t:\n        print -1\n        return\n    l=max(houres-shops,0)\n    r=need\n    while l<r:\n        m=(l+r)>>1\n        if check(sections,m,t,houres)==False:\n            l=m+1\n        else:\n            r=m\n    print l\nmain()\n",
    "prob_desc_created_at": "1353857400",
    "tags": [
        "binary search",
        "implementation",
        "greedy"
    ],
    "hidden_unit_tests": ""
}