{
    "prob_desc_time_limit": "3 seconds",
    "prob_desc_sample_outputs": "[\"9\", \"12\"]",
    "src_uid": "2596db1dfc124ea9e14c3f13c389c8d2",
    "prob_desc_notes": "NoteThe picture below corresponds to the first sample. Segments that form the hedgehog are painted red. The tail consists of a sequence of points with numbers 1, 2 and 5. The following segments are spines: (2, 5), (3, 5) and (4, 5). Therefore, the beauty of the hedgehog is equal to 3·3 = 9.",
    "prob_desc_description": "This Christmas Santa gave Masha a magic picture and a pencil. The picture consists of n points connected by m segments (they might cross in any way, that doesn't matter). No two segments connect the same pair of points, and no segment connects the point to itself. Masha wants to color some segments in order paint a hedgehog. In Mashas mind every hedgehog consists of a tail and some spines. She wants to paint the tail that satisfies the following conditions:   Only segments already presented on the picture can be painted;  The tail should be continuous, i.e. consists of some sequence of points, such that every two neighbouring points are connected by a colored segment;  The numbers of points from the beginning of the tail to the end should strictly increase. Masha defines the length of the tail as the number of points in it. Also, she wants to paint some spines. To do so, Masha will paint all the segments, such that one of their ends is the endpoint of the tail. Masha defines the beauty of a hedgehog as the length of the tail multiplied by the number of spines. Masha wants to color the most beautiful hedgehog. Help her calculate what result she may hope to get.Note that according to Masha's definition of a hedgehog, one segment may simultaneously serve as a spine and a part of the tail (she is a little girl after all). Take a look at the picture for further clarifications.",
    "prob_desc_output_spec": "Print the maximum possible value of the hedgehog's beauty.",
    "prob_desc_input_spec": "First line of the input contains two integers n and m(2 ≤ n ≤ 100 000, 1 ≤ m ≤ 200 000) — the number of points and the number segments on the picture respectively.  Then follow m lines, each containing two integers ui and vi (1 ≤ ui, vi ≤ n, ui ≠ vi) — the numbers of points connected by corresponding segment. It's guaranteed that no two segments connect the same pair of points.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_027.jsonl",
    "code_uid": "ffe546a4b2f133c3b4a40d24d29ef7b2",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"8 6\\n4 5\\n3 5\\n2 5\\n1 2\\n2 8\\n6 7\", \"4 6\\n1 2\\n1 3\\n1 4\\n2 3\\n2 4\\n3 4\"]",
    "exec_outcome": "PASSED",
    "source_code": "R = lambda : map(int, input().split())\nn,m=R()\nadj=[[] for _ in range(n)]\n\nfrom collections import defaultdict\nd=defaultdict(int)\nfor i in range(m):\n    u,v=R()\n    if (u>v):\n        u,v=v,u\n    adj[u-1].append(v-1)\n    d[u-1]+=1\n    d[v-1]+=1\n\nh=defaultdict(int)\n\nfor i in range(n):\n    h[i]=max(h[i],1)\n    for v in adj[i]:\n        h[v]=max(h[v],h[i]+1)\n\nmx = 0\nfor i in range(n):\n    mx = max(mx,h[i]*d[i])\n\nprint(mx)\n",
    "prob_desc_created_at": "1452261900",
    "tags": [
        "dp",
        "graphs"
    ],
    "hidden_unit_tests": ""
}