{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"12\"]",
    "src_uid": "a18edcadb31f76e69968b0a3e1cb7e3e",
    "prob_desc_notes": "NoteHere's a picture depicting the example. Each vertical column presents the stacked books.  ",
    "prob_desc_description": "New Year is coming, and Jaehyun decided to read many books during 2015, unlike this year. He has n books numbered by integers from 1 to n. The weight of the i-th (1 ≤ i ≤ n) book is wi.As Jaehyun's house is not large enough to have a bookshelf, he keeps the n books by stacking them vertically. When he wants to read a certain book x, he follows the steps described below.  He lifts all the books above book x.  He pushes book x out of the stack.  He puts down the lifted books without changing their order.  After reading book x, he puts book x on the top of the stack.  He decided to read books for m days. In the j-th (1 ≤ j ≤ m) day, he will read the book that is numbered with integer bj (1 ≤ bj ≤ n). To read the book, he has to use the process described in the paragraph above. It is possible that he decides to re-read the same book several times.After making this plan, he realized that the total weight of books he should lift during m days would be too heavy. So, he decided to change the order of the stacked books before the New Year comes, and minimize the total weight. You may assume that books can be stacked in any possible order. Note that book that he is going to read on certain step isn't considered as lifted on that step. Can you help him?",
    "prob_desc_output_spec": "Print the minimum total weight of books he should lift, which can be achieved by rearranging the order of stacked books.",
    "prob_desc_input_spec": "The first line contains two space-separated integers n (2 ≤ n ≤ 500) and m (1 ≤ m ≤ 1000) — the number of books, and the number of days for which Jaehyun would read books. The second line contains n space-separated integers w1, w2, ..., wn (1 ≤ wi ≤ 100) — the weight of each book. The third line contains m space separated integers b1, b2, ..., bm (1 ≤ bj ≤ n) — the order of books that he would read. Note that he can read the same book more than once.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_015.jsonl",
    "code_uid": "676e9cd287bcaefb21cc10bb73d7965d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 5\\n1 2 3\\n1 3 2 3 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "import copy\nn,m=map(int,raw_input().split())\nw=map(int,raw_input().split())\nb=map(int,raw_input().split())\ninitial=[]\nfor i in range(len(b)):\n    b[i]-=1\nfor bb in b:\n    if bb not in initial:\n        initial.append(bb)\nans=0\nfor bb in b:\n    num=initial.index(bb)\n    for i in range(num):\n        ans+=w[initial[i]]\n    tmp=copy.copy(initial[num])\n    del initial[num]\n    initial.insert(0,tmp)\nprint ans\n",
    "prob_desc_created_at": "1419951600",
    "tags": [
        "constructive algorithms",
        "implementation",
        "greedy",
        "math"
    ],
    "hidden_unit_tests": ""
}