{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1\\n1\\n2\\n5\\n4\\n1\\n1\\n3\"]",
    "src_uid": "0c9f2301629726870a0ab57299773fd6",
    "prob_desc_notes": "NoteIn the first case, the answer is $$$1$$$ since we had exactly $$$1$$$ friend.The second case is similar to the first.In the third case, the suspects are the third and fourth friends (we count from one). It can be shown that no one else could be the thief.In the fourth case, we know absolutely nothing, so we suspect everyone.",
    "prob_desc_description": "Polycarp bought a new expensive painting and decided to show it to his $$$n$$$ friends. He hung it in his room. $$$n$$$ of his friends entered and exited there one by one. At one moment there was no more than one person in the room. In other words, the first friend entered and left first, then the second, and so on.It is known that at the beginning (before visiting friends) a picture hung in the room. At the end (after the $$$n$$$-th friend) it turned out that it disappeared. At what exact moment it disappeared — there is no information.Polycarp asked his friends one by one. He asked each one if there was a picture when he entered the room. Each friend answered one of three:  no (response encoded with 0);  yes (response encoded as 1);  can't remember (response is encoded with ?). Everyone except the thief either doesn't remember or told the truth. The thief can say anything (any of the three options).Polycarp cannot understand who the thief is. He asks you to find out the number of those who can be considered a thief according to the answers.",
    "prob_desc_output_spec": "Output one positive (strictly more zero) number – the number of people who could steal the picture based on the data shown.",
    "prob_desc_input_spec": "The first number $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases in the test. The following is a description of test cases. The first line of each test case contains one string $$$s$$$ (length does not exceed $$$2 \\cdot 10^5$$$) — a description of the friends' answers, where $$$s_i$$$ indicates the answer of the $$$i$$$-th friend. Each character in the string is either 0 or 1 or ?. The given regularity is described in the actual situation. In particular, on the basis of answers, at least one friend can be suspected of stealing a painting. It is guaranteed that the sum of string lengths over the entire input data set does not exceed $$$2 \\cdot 10^5$$$.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3-64",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_092.jsonl",
    "code_uid": "e5a47ff9ba6230f27b3191382688d77c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"8\\n0\\n1\\n1110000\\n?????\\n1?1??0?0\\n0?0???\\n??11\\n??0??\"]",
    "exec_outcome": "PASSED",
    "source_code": "for _ in range(int(input())):\r\n    s = input()\r\n    ans = 0\r\n    ll, rr = 0, len(s)\r\n    k = 0\r\n    if '0' in s:\r\n        rr = s.index('0') + 1\r\n        k += 1\r\n    if '1' in s:\r\n        ll = len(s) - s[::-1].index('1') - 1\r\n        k += 2\r\n    if k == 3:\r\n        print(rr - ll)\r\n    elif k == 1:\r\n        print(rr)\r\n    elif k == 2:\r\n        print(rr - ll)\r\n    else:\r\n        print(len(s))\r\n",
    "prob_desc_created_at": "1651761300",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}