{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"Yes\\n1\\n1 4\", \"No\", \"Yes\\n4\\n1 2\\n1 3\\n1 4\\n1 5\"]",
    "src_uid": "0a476638c2122bfb236b53742cf8a89d",
    "prob_desc_notes": "NoteThe tree from the first example is shown on the picture below:  The number next to each edge corresponds to the path number in the decomposition. It is easy to see that this decomposition suits the required conditions.The tree from the second example is shown on the picture below:  We can show that there are no valid decompositions of this tree.The tree from the third example is shown on the picture below:  The number next to each edge corresponds to the path number in the decomposition. It is easy to see that this decomposition suits the required conditions.",
    "prob_desc_description": "Ramesses knows a lot about problems involving trees (undirected connected graphs without cycles)!He created a new useful tree decomposition, but he does not know how to construct it, so he asked you for help!The decomposition is the splitting the edges of the tree in some simple paths in such a way that each two paths have at least one common vertex. Each edge of the tree should be in exactly one path.Help Remesses, find such a decomposition of the tree or derermine that there is no such decomposition.",
    "prob_desc_output_spec": "If there are no decompositions, print the only line containing \"No\". Otherwise in the first line print \"Yes\", and in the second line print the number of paths in the decomposition $$$m$$$.  Each of the next $$$m$$$ lines should contain two integers $$$u_i$$$, $$$v_i$$$ ($$$1 \\leq u_i, v_i \\leq n$$$, $$$u_i \\neq v_i$$$) denoting that one of the paths in the decomposition is the simple path between nodes $$$u_i$$$ and $$$v_i$$$.  Each pair of paths in the decomposition should have at least one common vertex, and each edge of the tree should be presented in exactly one path. You can print the paths and the ends of each path in arbitrary order. If there are multiple decompositions, print any.",
    "prob_desc_input_spec": "The first line contains a single integer $$$n$$$ ($$$2 \\leq n \\leq 10^{5}$$$) the number of nodes in the tree. Each of the next $$$n - 1$$$ lines contains two integers $$$a_i$$$ and $$$b_i$$$ ($$$1 \\leq a_i, b_i \\leq n$$$, $$$a_i \\neq b_i$$$) — the edges of the tree. It is guaranteed that the given edges form a tree.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_031.jsonl",
    "code_uid": "50c70d8441dd5ff28a892026a9aa91bb",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\n1 2\\n2 3\\n3 4\", \"6\\n1 2\\n2 3\\n3 4\\n2 5\\n3 6\", \"5\\n1 2\\n1 3\\n1 4\\n1 5\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\ndeg = [0]*100005\nleaves = []\nfor i in range(1,n):\n    a,b = map(int, input().split())\n    deg[a]+=1\n    deg[b]+=1\ncnt = 0\nmxdeg = 0\nroot = 0\nfor j in range(1,n+1):\n    if deg[j]>mxdeg:\n        mxdeg = deg[j]\n        root = j\n    if deg[j] == 1:\n        leaves.append(j)\n    if deg[j] > 2:\n        cnt+=1\nif cnt>1:\n    print(\"No\")\n    exit()\nprint(\"Yes\")\nm = 0\nfor it in leaves:\n    if it != root:\n        m+=1\nprint(m)\nfor it2 in leaves:\n    if it2 != root:\n        print(root,it2)\n\n\n\n",
    "prob_desc_created_at": "1527432600",
    "tags": [
        "implementation",
        "trees"
    ],
    "hidden_unit_tests": ""
}