{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"4\", \"1\", \"3\", \"0\"]",
    "src_uid": "12c223c903544899638e47bcab88999a",
    "prob_desc_notes": "NoteFor the first example, the candidate strings are the following: \"ouuokarinn\", \"ouuokarim\", \"owokarim\", and \"owokarinn\".For the second example, there is only one: \"banana\".For the third example, the candidate strings are the following: \"nm\", \"mn\" and \"nnn\".For the last example, there are no candidate strings that the machine can turn into \"amanda\", since the machine won't inscribe 'm'.",
    "prob_desc_description": "Constanze is the smartest girl in her village but she has bad eyesight.One day, she was able to invent an incredible machine! When you pronounce letters, the machine will inscribe them onto a piece of paper. For example, if you pronounce 'c', 'o', 'd', and 'e' in that order, then the machine will inscribe \"code\" onto the paper. Thanks to this machine, she can finally write messages without using her glasses.However, her dumb friend Akko decided to play a prank on her. Akko tinkered with the machine so that if you pronounce 'w', it will inscribe \"uu\" instead of \"w\", and if you pronounce 'm', it will inscribe \"nn\" instead of \"m\"! Since Constanze had bad eyesight, she was not able to realize what Akko did.The rest of the letters behave the same as before: if you pronounce any letter besides 'w' and 'm', the machine will just inscribe it onto a piece of paper.The next day, I received a letter in my mailbox. I can't understand it so I think it's either just some gibberish from Akko, or Constanze made it using her machine. But since I know what Akko did, I can just list down all possible strings that Constanze's machine would have turned into the message I got and see if anything makes sense.But I need to know how much paper I will need, and that's why I'm asking you for help. Tell me the number of strings that Constanze's machine would've turned into the message I got.But since this number can be quite large, tell me instead its remainder when divided by $$$10^9+7$$$.If there are no strings that Constanze's machine would've turned into the message I got, then print $$$0$$$.",
    "prob_desc_output_spec": "Print a single integer — the number of strings that Constanze's machine would've turned into the message $$$s$$$, modulo $$$10^9+7$$$.",
    "prob_desc_input_spec": "Input consists of a single line containing a string $$$s$$$ ($$$1 \\leq |s| \\leq 10^5$$$) — the received message. $$$s$$$ contains only lowercase Latin letters.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_010.jsonl",
    "code_uid": "a970f9420becbf4c60ad4fb43621eb5e",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"ouuokarinn\", \"banana\", \"nnn\", \"amanda\"]",
    "exec_outcome": "PASSED",
    "source_code": "s = raw_input()\nflag = True\nmaxn = int(1e5+5)\nfib = [0]*maxn\nfib[0] = 1\nfib[1] = 1\nfib[2] = 2\nfib[3] = 3\nmod  = int(1e9+7)\nfor i in range(4,maxn):\n\tfib[i] = (fib[i-1]+fib[i-2])%mod\n\n\nfor i in range(len(s)):\n\tif s[i] == \"m\" or s[i] == \"w\":\n\t\tflag = False\n\nif not flag:\n\tprint 0\nelse:\n\ti = 0\n\tcnt = 0\n\tans = 1\n\twhile i<len(s):\n\t\tif s[i]!=\"u\" and s[i]!=\"n\":\n\n\t\t\tans = (ans*fib[cnt])%mod\n\t\t\tcnt = 0\n\t\telif s[i] == s[i-1]:\n\t\t\tcnt += 1\n\t\telse:\n\n\t\t\tans = (ans*fib[cnt])%mod\n\t\t\tcnt = 1\n\t\ti += 1\n\n\tans = (ans*fib[cnt])%mod\n\tprint ans\n\n\n\n",
    "prob_desc_created_at": "1572618900",
    "tags": [
        "dp"
    ],
    "hidden_unit_tests": ""
}