{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"11\", \"13\"]",
    "src_uid": "65eb0f3ab35c4d95c1cbd39fc7a4227b",
    "prob_desc_notes": null,
    "prob_desc_description": "In one little known, but very beautiful country called Waterland, lives a lovely shark Valerie. Like all the sharks, she has several rows of teeth, and feeds on crucians. One of Valerie's distinguishing features is that while eating one crucian she uses only one row of her teeth, the rest of the teeth are \"relaxing\".For a long time our heroine had been searching the sea for crucians, but a great misfortune happened. Her teeth started to ache, and she had to see the local dentist, lobster Ashot. As a professional, Ashot quickly relieved Valerie from her toothache. Moreover, he managed to determine the cause of Valerie's developing caries (for what he was later nicknamed Cap).It turned that Valerie eats too many crucians. To help Valerie avoid further reoccurrence of toothache, Ashot found for each Valerie's tooth its residual viability. Residual viability of a tooth is a value equal to the amount of crucians that Valerie can eat with this tooth. Every time Valerie eats a crucian, viability of all the teeth used for it will decrease by one. When the viability of at least one tooth becomes negative, the shark will have to see the dentist again. Unhappy, Valerie came back home, where a portion of crucians was waiting for her. For sure, the shark couldn't say no to her favourite meal, but she had no desire to go back to the dentist. That's why she decided to eat the maximum amount of crucians from the portion but so that the viability of no tooth becomes negative. As Valerie is not good at mathematics, she asked you to help her to find out the total amount of crucians that she can consume for dinner.We should remind you that while eating one crucian Valerie uses exactly one row of teeth and the viability of each tooth from this row decreases by one.",
    "prob_desc_output_spec": "In the first line output the maximum amount of crucians that Valerie can consume for dinner.",
    "prob_desc_input_spec": "The first line contains three integers n, m, k (1 ≤ m ≤ n ≤ 1000, 0 ≤ k ≤ 106) — total amount of Valerie's teeth, amount of tooth rows and amount of crucians in Valerie's portion for dinner. Then follow n lines, each containing two integers: r (1 ≤ r ≤ m) — index of the row, where belongs the corresponding tooth, and c (0 ≤ c ≤ 106) — its residual viability. It's guaranteed that each tooth row has positive amount of teeth.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_012.jsonl",
    "code_uid": "724a3d4fa2a14b0035d3c200c72fd6ca",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 3 18\\n2 3\\n1 2\\n3 6\\n2 3\", \"2 2 13\\n1 13\\n2 12\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,m,k=map(int,input().strip().split())\narr=[float(\"inf\")]*m\nfor i in range(n):\n    r,c=map(int,input().strip().split())\n    arr[r-1]=min(arr[r-1],c)\nprint(min(k,sum(arr)))",
    "prob_desc_created_at": "1286463600",
    "tags": [
        "implementation",
        "greedy"
    ],
    "hidden_unit_tests": ""
}