{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"1\", \"3\"]",
    "src_uid": "a26e048eb9b18f87f1703d42e172f318",
    "prob_desc_notes": "NoteIn the first sample, he removes number 1 from end of the list and places it at the beginning. After that he takes number 2 and places it between 1 and 3.In the second sample, he removes number 5 and inserts it after 1.In the third sample, the sequence of changes are like this:  1 5 2 3 4 1 4 5 2 3 1 3 4 5 2 1 2 3 4 5  So he needs three moves.",
    "prob_desc_description": "Happy PMP is freshman and he is learning about algorithmic problems. He enjoys playing algorithmic games a lot.One of the seniors gave Happy PMP a nice game. He is given two permutations of numbers 1 through n and is asked to convert the first one to the second. In one move he can remove the last number from the permutation of numbers and inserts it back in an arbitrary position. He can either insert last number between any two consecutive numbers, or he can place it at the beginning of the permutation.Happy PMP has an algorithm that solves the problem. But it is not fast enough. He wants to know the minimum number of moves to convert the first permutation to the second. ",
    "prob_desc_output_spec": "Print a single integer denoting the minimum number of moves required to convert the first permutation to the second.",
    "prob_desc_input_spec": "The first line contains a single integer n (1 ≤ n ≤ 2·105) — the quantity of the numbers in the both given permutations.  Next line contains n space-separated integers — the first permutation. Each number between 1 to n will appear in the permutation exactly once.  Next line describe the second permutation in the same format.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1500,
    "file_name": "train_001.jsonl",
    "code_uid": "fdbca0d83a6cef82fe976ddee91b70be",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n3 2 1\\n1 2 3\", \"5\\n1 2 3 4 5\\n1 5 2 3 4\", \"5\\n1 5 2 3 4\\n1 2 3 4 5\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(raw_input())\na = map(int,raw_input().split())\nb = map(int,raw_input().split())\nj = 0\nfor i in range(0,n):\n        if a[j] == b[i]:\n                j += 1\nprint n-j\n                                               ",
    "prob_desc_created_at": "1336663800",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}