{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"4\", \"2\", \"3\", \"1\", \"17\", \"1\", \"2\"]",
    "src_uid": "4e00fe693a636316d478978abf21d976",
    "prob_desc_notes": "NoteLet's consider the test examples:   Originally array b can be equal to {5, 9, 5, 5}. The sequence of George's changes could have been: {5, 9, 5, 5} → {5, 5, 95} → {95, 55} → {9555}.  Originally array b could be equal to {1000000000, 5}. Please note that the array b cannot contain zeros.  Originally array b could be equal to {800, 10, 1}.  Originally array b could be equal to {45}. It cannot be equal to {4, 5}, because George can get only array {54} from this array in one operation. Note that the numbers can be very large.",
    "prob_desc_description": "George is a cat, so he really likes to play. Most of all he likes to play with his array of positive integers b. During the game, George modifies the array by using special changes. Let's mark George's current array as b1, b2, ..., b|b| (record |b| denotes the current length of the array). Then one change is a sequence of actions:   Choose two distinct indexes i and j (1 ≤ i, j ≤ |b|; i ≠ j), such that bi ≥ bj.  Get number v = concat(bi, bj), where concat(x, y) is a number obtained by adding number y to the end of the decimal record of number x. For example, concat(500, 10) = 50010, concat(2, 2) = 22.  Add number v to the end of the array. The length of the array will increase by one.  Remove from the array numbers with indexes i and j. The length of the array will decrease by two, and elements of the array will become re-numbered from 1 to current length of the array. George played for a long time with his array b and received from array b an array consisting of exactly one number p. Now George wants to know: what is the maximum number of elements array b could contain originally? Help him find this number. Note that originally the array could contain only positive integers.",
    "prob_desc_output_spec": "Print an integer — the maximum number of elements array b could contain originally.",
    "prob_desc_input_spec": "The first line of the input contains a single integer p (1 ≤ p &lt; 10100000). It is guaranteed that number p doesn't contain any leading zeroes.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1700,
    "file_name": "train_057.jsonl",
    "code_uid": "c85d6952f7799dd01154edf01d91b7fc",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"9555\", \"10000000005\", \"800101\", \"45\", \"1000000000000001223300003342220044555\", \"19992000\", \"310200\"]",
    "exec_outcome": "PASSED",
    "source_code": "s = input()\n\nr = len(s)\nc = 1\nfor i in range(len(s)-1, 0, -1):\n    if s[i] != '0':\n        if i > r-i:\n            c += 1\n            r = i\n        elif i == r-i:\n            if s[:i] >= s[i:r]:\n                c += 1\n                r = i\n        else:\n            break\n\nprint(c)\n",
    "prob_desc_created_at": "1391095800",
    "tags": [
        "implementation",
        "greedy"
    ],
    "hidden_unit_tests": ""
}