{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\\n1\\n0\\n1\\n0\", \"1\\n3\\n0\\n0\\n2\"]",
    "src_uid": "d5e3136b236f0e84ed6b88e43acd4205",
    "prob_desc_notes": null,
    "prob_desc_description": "Recently, Valery have come across an entirely new programming language. Most of all the language attracted him with template functions and procedures. Let us remind you that templates are tools of a language, designed to encode generic algorithms, without reference to some parameters (e.g., data types, buffer sizes, default values).Valery decided to examine template procedures in this language in more detail. The description of a template procedure consists of the procedure name and the list of its parameter types. The generic type T parameters can be used as parameters of template procedures.A procedure call consists of a procedure name and a list of variable parameters. Let's call a procedure suitable for this call if the following conditions are fulfilled:   its name equals to the name of the called procedure;  the number of its parameters equals to the number of parameters of the procedure call;  the types of variables in the procedure call match the corresponding types of its parameters. The variable type matches the type of a parameter if the parameter has a generic type T or the type of the variable and the parameter are the same. You are given a description of some set of template procedures. You are also given a list of variables used in the program, as well as direct procedure calls that use the described variables. For each call you need to count the number of procedures that are suitable for this call.",
    "prob_desc_output_spec": "On each of k lines print a single number, where the i-th number stands for the number of suitable template procedures for the i-th call.",
    "prob_desc_input_spec": "The first line contains a single integer n (1 ≤ n ≤ 1000) — the number of template procedures. The next n lines contain the description of the procedures specified in the following format: \"void procedureName (type_1, type_2, ..., type_t)\" (1 ≤ t ≤ 5), where void is the keyword, procedureName is the procedure name, type_i is the type of the next parameter. Types of language parameters can be \"int\", \"string\", \"double\", and the keyword \"T\", which denotes the generic type. The next line contains a single integer m (1 ≤ m ≤ 1000) — the number of used variables. Next m lines specify the description of the variables in the following format: \"type variableName\", where type is the type of variable that can take values \"int\", \"string\", \"double\", variableName — the name of the variable. The next line contains a single integer k (1 ≤ k ≤ 1000) — the number of procedure calls. Next k lines specify the procedure calls in the following format: \"procedureName (var_1, var_2, ..., var_t)\" (1 ≤ t ≤ 5), where procedureName is the name of the procedure, var_i is the name of a variable. The lines describing the variables, template procedures and their calls may contain spaces at the beginning of the line and at the end of the line, before and after the brackets and commas. Spaces may be before and after keyword void. The length of each input line does not exceed 100 characters. The names of variables and procedures are non-empty strings of lowercase English letters and numbers with lengths of not more than 10 characters. Note that this is the only condition at the names. Only the specified variables are used in procedure calls. The names of the variables are distinct. No two procedures are the same. Two procedures are the same, if they have identical names and identical ordered sets of types of their parameters.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_045.jsonl",
    "code_uid": "d94fc050b2fd7da46582a3d0e6ed0d09",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\nvoid f(int,T)\\nvoid  f(T, T)\\n void foo123   ( int,  double,  string,string  ) \\n  void  p(T,double)\\n3\\nint a\\n string    s\\ndouble x123 \\n5\\nf(a,  a)\\n  f(s,a   )\\nfoo   (a,s,s)\\n f  (  s  ,x123)\\nproc(a)\", \"6\\nvoid f(string,double,int)\\nvoid f(int)\\n   void f  ( T  )\\nvoid procedure(int,double)\\nvoid f  (T, double,int)   \\nvoid f(string, T,T)\\n4\\n int a\\n int x\\nstring  t\\ndouble  val  \\n5\\nf(t, a, a)\\nf(t,val,a)\\nf(val,a, val)\\n solve300(val, val)\\nf  (x)\"]",
    "exec_outcome": "PASSED",
    "source_code": "n=int(raw_input())\nfs=[]\nfor i in xrange(n):\n    s=raw_input().strip()\n    s=s[4:].strip()\n    name=s[:s.find('(')].strip()\n    lst=s[s.find('(')+1:s.find(')')].split(',')\n    lst=map(lambda a:a.strip(),lst)\n    fs.append((name,lst))\n\nm=int(raw_input())\ntp={}\nfor i in xrange(m):\n    a,b=raw_input().split()\n    tp[b]=a\n\nk=int(raw_input())\nfor i in range(k):\n    s=raw_input().strip()\n    name=s[:s.find('(')].strip()\n    lst=s[s.find('(')+1:s.find(')')].split(',')\n    lst=map(lambda a:tp[a.strip()],lst)\n    ret=0\n    for a,b in fs:\n        if a!=name or len(b) != len(lst):\n            continue\n        for i in xrange(len(b)):\n            if b[i]!='T' and b[i]!=lst[i]:\n                break\n        else:\n            ret+=1\n    print ret",
    "prob_desc_created_at": "1340551800",
    "tags": [
        "binary search",
        "implementation",
        "brute force",
        "expression parsing"
    ],
    "hidden_unit_tests": ""
}