{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\", \"11\"]",
    "src_uid": "f00d94eb37c98a449615f0411e5a3572",
    "prob_desc_notes": "NoteIn the first example triangle with sides {1 + 1 = 2, 2, 1} can be formed from a set of lengths {1, 1, 1, 2}. In the second example you can make a triangle with lengths {20, 11, 4 + 3 + 2 + 1 = 10}. ",
    "prob_desc_description": "  As some of you know, cubism is a trend in art, where the problem of constructing volumetrical shape on a plane with a combination of three-dimensional geometric shapes comes to the fore. A famous sculptor Cicasso, whose self-portrait you can contemplate, hates cubism. He is more impressed by the idea to transmit two-dimensional objects through three-dimensional objects by using his magnificent sculptures. And his new project is connected with this. Cicasso wants to make a coat for the haters of anticubism. To do this, he wants to create a sculpture depicting a well-known geometric primitive — convex polygon.Cicasso prepared for this a few blanks, which are rods with integer lengths, and now he wants to bring them together. The i-th rod is a segment of length li.The sculptor plans to make a convex polygon with a nonzero area, using all rods he has as its sides. Each rod should be used as a side to its full length. It is forbidden to cut, break or bend rods. However, two sides may form a straight angle .Cicasso knows that it is impossible to make a convex polygon with a nonzero area out of the rods with the lengths which he had chosen. Cicasso does not want to leave the unused rods, so the sculptor decides to make another rod-blank with an integer length so that his problem is solvable. Of course, he wants to make it as short as possible, because the materials are expensive, and it is improper deed to spend money for nothing. Help sculptor! ",
    "prob_desc_output_spec": "Print the only integer z — the minimum length of the rod, so that after adding it it can be possible to construct convex polygon with (n + 1) vertices and nonzero area from all of the rods.",
    "prob_desc_input_spec": "The first line contains an integer n (3 ≤ n ≤ 105) — a number of rod-blanks. The second line contains n integers li (1 ≤ li ≤ 109) — lengths of rods, which Cicasso already has. It is guaranteed that it is impossible to make a polygon with n vertices and nonzero area using the rods Cicasso already has.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_000.jsonl",
    "code_uid": "784d0720df6b78ba1dce2cc79183593c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n1 2 1\", \"5\\n20 4 3 2 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "# http://codeforces.com/contest/667/problem/B\n\n# https://en.wikipedia.org/wiki/Triangle_inequality\n# 「Generalization to any polygon」参照。\n# 三角不等式の一般化が載っている。\n# ポリゴンができる条件は最長辺が残りすべての辺の長さの和より短いこと\n# longest< x+(total-longest)\n# ∴ x > 2*longest-total\n\nn = int(input())\nlst = list(map(int, input().split()))\nprint(2 * max(lst) - sum(lst) + 1)\n",
    "prob_desc_created_at": "1461947700",
    "tags": [
        "constructive algorithms",
        "geometry"
    ],
    "hidden_unit_tests": ""
}