{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"1\"]",
    "src_uid": "74ddbcf74988940265985ec8c36bb299",
    "prob_desc_notes": "NoteIn the first sample, scientists must go to the movie with the index 2, as in such case the 1-th and the 3-rd scientists will be very pleased and the 2-nd scientist will be almost satisfied.In the second test case scientists can go either to the movie with the index 1 or the index 3. After viewing any of these movies exactly two scientists will be very pleased and all the others will be not satisfied. ",
    "prob_desc_description": "Moscow is hosting a major international conference, which is attended by n scientists from different countries. Each of the scientists knows exactly one language. For convenience, we enumerate all languages of the world with integers from 1 to 109.In the evening after the conference, all n scientists decided to go to the cinema. There are m movies in the cinema they came to. Each of the movies is characterized by two distinct numbers — the index of audio language and the index of subtitles language. The scientist, who came to the movie, will be very pleased if he knows the audio language of the movie, will be almost satisfied if he knows the language of subtitles and will be not satisfied if he does not know neither one nor the other (note that the audio language and the subtitles language for each movie are always different). Scientists decided to go together to the same movie. You have to help them choose the movie, such that the number of very pleased scientists is maximum possible. If there are several such movies, select among them one that will maximize the number of almost satisfied scientists.",
    "prob_desc_output_spec": "Print the single integer — the index of a movie to which scientists should go. After viewing this movie the number of very pleased scientists should be maximum possible. If in the cinema there are several such movies, you need to choose among them one, after viewing which there will be the maximum possible number of almost satisfied scientists.  If there are several possible answers print any of them.",
    "prob_desc_input_spec": "The first line of the input contains a positive integer n (1 ≤ n ≤ 200 000) — the number of scientists. The second line contains n positive integers a1, a2, ..., an (1 ≤ ai ≤ 109), where ai is the index of a language, which the i-th scientist knows. The third line contains a positive integer m (1 ≤ m ≤ 200 000) — the number of movies in the cinema.  The fourth line contains m positive integers b1, b2, ..., bm (1 ≤ bj ≤ 109), where bj is the index of the audio language of the j-th movie. The fifth line contains m positive integers c1, c2, ..., cm (1 ≤ cj ≤ 109), where cj is the index of subtitles language of the j-th movie. It is guaranteed that audio languages and subtitles language are different for each movie, that is bj ≠ cj. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_010.jsonl",
    "code_uid": "8a9086337549887aca7bfe8410545dd6",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n2 3 2\\n2\\n3 2\\n2 3\", \"6\\n6 3 1 1 3 7\\n5\\n1 2 3 4 5\\n2 3 4 5 1\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\nd = {}\nfor i in list(map(int, input().split())):\n    if i in d: d[i] += 1\n    else: d[i] = 1\nm = int(input())\nres = [(0, 0)] * m\nb = list(map(int, input().split()))\nc = list(map(int, input().split()))\nfor i in range(m):\n    if b[i] not in d: d[b[i]] = 0\n    if c[i] not in d: d[c[i]] = 0\n    res[i] = (d[b[i]], i)\nres.sort()\nidx = res[m-1][1]\nfor i in range(m-1, -1, -1):\n    if res[i][0] == res[m-1][0] and d[c[res[i][1]]] > d[c[idx]]:\n        idx = res[i][1]\nprint(idx+1)\n",
    "prob_desc_created_at": "1462464300",
    "tags": [
        "implementation",
        "sortings"
    ],
    "hidden_unit_tests": ""
}