{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\\n2\\n1 3\", \"0\", \"1\\n4\\n1 2 5 6\"]",
    "src_uid": "f78d04f699fc94103e5b08023949854d",
    "prob_desc_notes": "NoteIn the first sample, the string is '(()(('. The operation described corresponds to deleting the bolded subsequence. The resulting string is '(((', and no more operations can be performed on it. Another valid answer is choosing indices $$$2$$$ and $$$3$$$, which results in the same final string.In the second sample, it is already impossible to perform any operations.",
    "prob_desc_description": "Now that Kuroni has reached 10 years old, he is a big boy and doesn't like arrays of integers as presents anymore. This year he wants a Bracket sequence as a Birthday present. More specifically, he wants a bracket sequence so complex that no matter how hard he tries, he will not be able to remove a simple subsequence!We say that a string formed by $$$n$$$ characters '(' or ')' is simple if its length $$$n$$$ is even and positive, its first $$$\\frac{n}{2}$$$ characters are '(', and its last $$$\\frac{n}{2}$$$ characters are ')'. For example, the strings () and (()) are simple, while the strings )( and ()() are not simple.Kuroni will be given a string formed by characters '(' and ')' (the given string is not necessarily simple). An operation consists of choosing a subsequence of the characters of the string that forms a simple string and removing all the characters of this subsequence from the string. Note that this subsequence doesn't have to be continuous. For example, he can apply the operation to the string ')()(()))', to choose a subsequence of bold characters, as it forms a simple string '(())', delete these bold characters from the string and to get '))()'. Kuroni has to perform the minimum possible number of operations on the string, in such a way that no more operations can be performed on the remaining string. The resulting string does not have to be empty.Since the given string is too large, Kuroni is unable to figure out how to minimize the number of operations. Can you help him do it instead?A sequence of characters $$$a$$$ is a subsequence of a string $$$b$$$ if $$$a$$$ can be obtained from $$$b$$$ by deletion of several (possibly, zero or all) characters.",
    "prob_desc_output_spec": "In the first line, print an integer $$$k$$$  — the minimum number of operations you have to apply. Then, print $$$2k$$$ lines describing the operations in the following format: For each operation, print a line containing an integer $$$m$$$  — the number of characters in the subsequence you will remove. Then, print a line containing $$$m$$$ integers $$$1 \\le a_1 &lt; a_2 &lt; \\dots &lt; a_m$$$  — the indices of the characters you will remove. All integers must be less than or equal to the length of the current string, and the corresponding subsequence must form a simple string. If there are multiple valid sequences of operations with the smallest $$$k$$$, you may print any of them.",
    "prob_desc_input_spec": "The only line of input contains a string $$$s$$$ ($$$1 \\le |s| \\le 1000$$$) formed by characters '(' and ')', where $$$|s|$$$ is the length of $$$s$$$.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_005.jsonl",
    "code_uid": "a1c2ac3f5608d4165a7ebd50c2047367",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"(()((\", \")(\", \"(()())\"]",
    "exec_outcome": "PASSED",
    "source_code": "s = input()\na = []\n\ni = 0\nj = len(s) - 1\n\nwhile i < j:\n    while i < j and s[i] != '(':\n        i += 1\n\n    while i < j and s[j] != ')':\n        j -= 1\n\n    if i < j and s[i] == '(' and s[j] == ')':\n        a.append(i + 1)\n        a.append(j + 1)\n        i += 1\n        j -= 1\n\nif a:\n    print(1)\n    print(len(a))\n    print(*sorted(a))\nelse:\n    print(0)\n",
    "prob_desc_created_at": "1583246100",
    "tags": [
        "constructive algorithms",
        "two pointers",
        "greedy",
        "strings"
    ],
    "hidden_unit_tests": ""
}