{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"YES\\n1 333.333333\\n2 333.333333\\n2 166.666667 1 166.666667\", \"YES\\n3 20.000000 4 60.000000\\n1 80.000000\\n4 40.000000 2 40.000000\\n3 80.000000\\n2 60.000000 1 20.000000\", \"NO\", \"YES\\n4 250.000000 5 500.000000 2 500.000000\\n3 500.000000 1 500.000000 4 250.000000\"]",
    "src_uid": "ae96b178fee7c189a377835a53eb3dc4",
    "prob_desc_notes": null,
    "prob_desc_description": "Students love to celebrate their holidays. Especially if the holiday is the day of the end of exams!Despite the fact that Igor K., unlike his groupmates, failed to pass a programming test, he decided to invite them to go to a cafe so that each of them could drink a bottle of... fresh cow milk. Having entered the cafe, the m friends found n different kinds of milk on the menu, that's why they ordered n bottles — one bottle of each kind. We know that the volume of milk in each bottle equals w.When the bottles were brought in, they decided to pour all the milk evenly among the m cups, so that each got a cup. As a punishment for not passing the test Igor was appointed the person to pour the milk. He protested that he was afraid to mix something up and suggested to distribute the drink so that the milk from each bottle was in no more than two different cups. His friends agreed but they suddenly faced the following problem — and what is actually the way to do it?Help them and write the program that will help to distribute the milk among the cups and drink it as quickly as possible!Note that due to Igor K.'s perfectly accurate eye and unswerving hands, he can pour any fractional amount of milk from any bottle to any cup.",
    "prob_desc_output_spec": "Print on the first line \"YES\" if it is possible to pour the milk so that the milk from each bottle was in no more than two different cups. If there's no solution, print \"NO\". If there is a solution, then print m more lines, where the i-th of them describes the content of the i-th student's cup. The line should consist of one or more pairs that would look like \"b v\". Each such pair means that v (v &gt; 0) units of milk were poured into the i-th cup from bottle b (1 ≤ b ≤ n). All numbers b on each line should be different. If there are several variants to solve the problem, print any of them. Print the real numbers with no less than 6 digits after the decimal point.",
    "prob_desc_input_spec": "The only input data file contains three integers n, w and m (1 ≤ n ≤ 50, 100 ≤ w ≤ 1000, 2 ≤ m ≤ 50), where n stands for the number of ordered bottles, w stands for the volume of each of them and m stands for the number of friends in the company.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1900,
    "file_name": "train_034.jsonl",
    "code_uid": "8d908fe6364b2d11855d8dd043a75e95",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2 500 3\", \"4 100 5\", \"4 100 7\", \"5 500 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "#!/usr/bin/python3\n\nn, w, m = map(int, input().split())\n\nif n > m:\n    print(\"YES\")\n    i = 0\n    cur = w\n    for j in range(m):\n        milk = 0\n        while milk < (w * n) / m - 1e-8:\n            amount = min(cur, (w * n) / m - milk)\n            print(i + 1, amount, end=' ')\n            milk += amount\n            cur -= amount\n            if abs(cur) < 1e-8:\n                i += 1\n                cur = w\n        print()\nelse:\n    ans = [[] for i in range(m)]\n    sums = [0 for i in range(m)]\n    left = [w for i in range(n)]\n    for i in range(m):\n        while sums[i] < (w * n) / m - 1e-8:\n            mx = 0\n            for j in range(n):\n                if left[j] > left[mx]:\n                    mx = j\n            amount = min(left[mx], (w * n) / m - sums[i])\n            if left[mx] < w and amount < left[mx] - 1e-8:\n                print(\"NO\")\n                exit(0)\n            sums[i] += amount\n            left[mx] -= amount\n            ans[i].append((mx, amount))\n    print(\"YES\")\n    for i in range(m):\n        for a, b in ans[i]:\n            print(a + 1, b, end=' ')\n        print()\n",
    "prob_desc_created_at": "1309446000",
    "tags": [
        "greedy",
        "math"
    ],
    "hidden_unit_tests": ""
}