{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\", \"3\", \"-1\", \"3\"]",
    "src_uid": "d19191ad8eff4160db37ed7d0560b4de",
    "prob_desc_notes": "NoteIn the first sample Athos has strength 10, Borthos 20, and Caramis 30. They can defeat all criminals in two hours:  Borthos and Caramis should together fight a criminal with strength 50. In the same hour Athos can fight one of four criminals with strength 1.  There are three criminals left, each with strength 1. Each musketeer can fight one criminal in the second hour.  In the second sample all three musketeers must together fight a criminal with strength 51. It takes one hour. In the second hour they can fight separately, each with one criminal. In the third hour one criminal is left and any of musketeers can fight him.",
    "prob_desc_description": "Do you know the story about the three musketeers? Anyway, you must help them now.Richelimakieu is a cardinal in the city of Bearis. He found three brave warriors and called them the three musketeers. Athos has strength a, Borthos strength b, and Caramis has strength c.The year 2015 is almost over and there are still n criminals to be defeated. The i-th criminal has strength ti. It's hard to defeat strong criminals — maybe musketeers will have to fight together to achieve it.Richelimakieu will coordinate musketeers' actions. In each hour each musketeer can either do nothing or be assigned to one criminal. Two or three musketeers can be assigned to the same criminal and then their strengths are summed up. A criminal can be defeated in exactly one hour (also if two or three musketeers fight him). Richelimakieu can't allow the situation where a criminal has strength bigger than the sum of strengths of musketeers fighting him — a criminal would win then!In other words, there are three ways to defeat a criminal.  A musketeer of the strength x in one hour can defeat a criminal of the strength not greater than x. So, for example Athos in one hour can defeat criminal i only if ti ≤ a.  Two musketeers can fight together and in one hour defeat a criminal of the strength not greater than the sum of strengths of these two musketeers. So, for example Athos and Caramis in one hour can defeat criminal i only if ti ≤ a + c. Note that the third remaining musketeer can either do nothing or fight some other criminal.  Similarly, all three musketeers can fight together and in one hour defeat a criminal of the strength not greater than the sum of musketeers' strengths, i.e. ti ≤ a + b + c. Richelimakieu doesn't want musketeers to fight during the New Year's Eve. Thus, he must coordinate their actions in order to minimize the number of hours till all criminals will be defeated.Find the minimum number of hours to defeat all criminals. If musketeers can't defeat them all then print \"-1\" (without the quotes) instead.",
    "prob_desc_output_spec": "Print one line with the answer. If it's impossible to defeat all criminals, print \"-1\" (without the quotes). Otherwise, print the minimum number of hours the three musketeers will spend on defeating all criminals.",
    "prob_desc_input_spec": "The first line of the input contains a single integer n (1 ≤ n ≤ 200 000) — the number of criminals. The second line contains three integers a, b and c (1 ≤ a, b, c ≤ 108) — strengths of musketeers. The third line contains n integers t1, t2, ..., tn (1 ≤ ti ≤ 108) — strengths of criminals.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 2400,
    "file_name": "train_048.jsonl",
    "code_uid": "aca7c47b486b9c3c437c8f633661f04d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5\\n10 20 30\\n1 1 1 1 50\", \"5\\n10 20 30\\n1 1 1 1 51\", \"7\\n30 20 10\\n34 19 50 33 88 15 20\", \"6\\n10 5 10\\n10 9 5 25 20 5\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(raw_input())\nl = map(int, raw_input().split())\nt = map(int, raw_input().split())\nt.sort(reverse=True)\nl.sort()\na, b, c = l[0],l[1],l[2]\nan, bn, cn = 0, 0, 0 #count variables\nacn, bcn, abn, abcn = 0, 0, 0, 0\n\nv = [a,b,c,a+b,a+c,b+c,a+b+c]\nv.sort()\nac = a+c; bc = b+c; ab = a+b; abc = a+b+c\nslack = 0 # number of bad cases left to process\ncflag = False\nif a+b >= c:\n\tcflag = True\n\nif t[0] > a+b+c:\n\tprint -1\n\texit(0)\n\nk = 0\nm = 0\nmprev=0; mprevflag = True\nwhile k < len(t):\n\tel = t[k]\n\tif el > bc:\n\t\tan+=1; bn+=1; cn+=1\n\t\tm+=1\n\t\tmprev = m\n\telif el > ac:\n\t\tbn+=1; cn+=1\n\t\tm+=1\n\t\tmprev = m\n\telif el > v[3]: # max(a+b, c)\n\t\tan+=1; cn+=1\n\t\tm+=1\n\t\tmprev = m\n\telif el > v[2]:\n\t\tif cflag:\n\t\t\tan+=1; bn+=1\n\t\t\tm+=1\n\t\t\tmprev = m\n\t\telse:\n\t\t\tcn+=1\n#\t\t\tif mprevflag:\n#\t\t\t\tmprev = m\n#\t\t\t\tmprevflag = False\n\t\t\tif cn > m:\n\t\t\t\tm = cn\n\telif el > b:\n#\t\tif cflag:\n#\t\t\tcn+=1\n#\t\t\tif cn > m:\n#\t\t\t\tm = cn\n#\t\telse:\n\t\tslack+=1\n\telif el > a:\n\t\tif cn < bn:\n\t\t\tcn+=1\n\t\t\tif cn > m:\n\t\t\t\tm = cn\n\t\t\tif slack > 0:\n\t\t\t\tslack -= 1\n\t\t\t\tcontinue\n\t\telse:\n\t\t\tbn+=1\n\t\t\tif bn > m:\n\t\t\t\tm = bn\n\telse:\n\t\tif cn < bn and cn < an:\n\t\t\tcn+=1\n\t\t\tif cn > m:\n\t\t\t\tm = cn\n\t\t\tif slack > 0:\n\t\t\t\tslack -= 1\n\t\t\t\tcontinue\n\t\telif bn < an:\n\t\t\tbn+=1\n\t\t\tif bn > m:\n\t\t\t\tm = bn\n\t\telse:\n\t\t\tan+=1\n\t\t\tif an > m:\n\t\t\t\tm = an\n\tk+=1\n\n#print an,bn,cn\nif slack > 0:\n\tmprev = max(mprev, an, bn)\n\tslack -= abs(mprev-cn)\n\tif slack > 0:\n\t\tm+= (slack+1)/2\n\nprint m\n\n",
    "prob_desc_created_at": "1451487900",
    "tags": [
        "data structures",
        "sortings",
        "greedy"
    ],
    "hidden_unit_tests": ""
}