{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\\n3\", \"2\\n4\"]",
    "src_uid": "bda7d223eabfcc519a60801012c58616",
    "prob_desc_notes": "NoteIn the first sample, there are two possibilities to finish the Super M's job in 3 krons. They are: and .However, you should choose the first one as it starts in the city with the lower number.",
    "prob_desc_description": "Ari the monster is not an ordinary monster. She is the hidden identity of Super M, the Byteforces’ superhero. Byteforces is a country that consists of n cities, connected by n - 1 bidirectional roads. Every road connects exactly two distinct cities, and the whole road system is designed in a way that one is able to go from any city to any other city using only the given roads. There are m cities being attacked by humans. So Ari... we meant Super M have to immediately go to each of the cities being attacked to scare those bad humans. Super M can pass from one city to another only using the given roads. Moreover, passing through one road takes her exactly one kron - the time unit used in Byteforces.   However, Super M is not on Byteforces now - she is attending a training camp located in a nearby country Codeforces. Fortunately, there is a special device in Codeforces that allows her to instantly teleport from Codeforces to any city of Byteforces. The way back is too long, so for the purpose of this problem teleportation is used exactly once.You are to help Super M, by calculating the city in which she should teleport at the beginning in order to end her job in the minimum time (measured in krons). Also, provide her with this time so she can plan her way back to Codeforces.",
    "prob_desc_output_spec": "First print the number of the city Super M should teleport to. If there are many possible optimal answers, print the one with the lowest city number. Then print the minimum possible time needed to scare all humans in cities being attacked, measured in Krons. Note that the correct answer is always unique.",
    "prob_desc_input_spec": "The first line of the input contains two integers n and m (1 ≤ m ≤ n ≤ 123456) - the number of cities in Byteforces, and the number of cities being attacked respectively. Then follow n - 1 lines, describing the road system. Each line contains two city numbers ui and vi (1 ≤ ui, vi ≤ n) - the ends of the road i. The last line contains m distinct integers - numbers of cities being attacked. These numbers are given in no particular order.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 2200,
    "file_name": "train_035.jsonl",
    "code_uid": "d16078dc38d3deb760329bde5ce21a2e",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"7 2\\n1 2\\n1 3\\n1 4\\n3 5\\n3 6\\n3 7\\n2 7\", \"6 4\\n1 2\\n2 3\\n2 4\\n4 5\\n4 6\\n2 4 5 6\"]",
    "exec_outcome": "PASSED",
    "source_code": "from heapq import *\nINF = float('inf')\nn, m = map(int, input().split())\nadj = [[] for _ in range(n+1)]\nwg= ng = [0 for _ in range(n+1)]\n\nfor _ in range(n-1):\n    a, b = map(int, input().split())\n    adj[a].append(b)\n    adj[b].append(a)\n\naaa = set(map(int, input().split()))\nif len(aaa) == 1:print(min(aaa));print(0);exit()\nrm = []\nfor i in range(n+1):\n    ng[i] = len(adj[i])\n    if i not in aaa and ng[i] == 1: rm.append(i)\n\nfor a in aaa: ng[a] = 0\n\ndef remove_node(index):\n    while adj[index]:\n        nx = adj[index].pop()\n        adj[nx].remove(index)\n        ng[nx] -= 1\n        if ng[nx] == 1: rm.append(nx)\n\n    ng[index] = 0\n\nwhile rm: remove_node(rm.pop())\n\nstate = [0 for _ in range(n+1)]\nque = [(min(aaa), None)]\nres = 0\nfor _ in range(2):\n    deep = [0 for _ in range(n + 1)]\n    while que:\n        res += 1\n        root, proot = que.pop()\n        for nx in adj[root]:\n            if proot == nx:\n                continue\n            if _: state[nx] = root\n            deep[nx] = deep[root] + 1\n            que.append((nx, root))\n    if _: break\n\n    start = max(1,deep.index(max(deep)))\n    que = [(start, None)]\n\nend = max(1, deep.index(max(deep)))\ni = end\npath = 1\nwhile i != start:\n    path += 1\n    i = state[i]\n\nprint(min(start,end))\nprint(res -1 -path)\n",
    "prob_desc_created_at": "1446309000",
    "tags": [
        "dp",
        "dfs and similar",
        "trees",
        "graphs"
    ],
    "hidden_unit_tests": ""
}