{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\\n4\\n2\"]",
    "src_uid": "bdce4761496c88a3de00aa863ba7308d",
    "prob_desc_notes": null,
    "prob_desc_description": "You are looking at the floor plan of the Summer Informatics School's new building. You were tasked with SIS logistics, so you really care about travel time between different locations: it is important to know how long it would take to get from the lecture room to the canteen, or from the gym to the server room.The building consists of n towers, h floors each, where the towers are labeled from 1 to n, the floors are labeled from 1 to h. There is a passage between any two adjacent towers (two towers i and i + 1 for all i: 1 ≤ i ≤ n - 1) on every floor x, where a ≤ x ≤ b. It takes exactly one minute to walk between any two adjacent floors of a tower, as well as between any two adjacent towers, provided that there is a passage on that floor. It is not permitted to leave the building. The picture illustrates the first example. You have given k pairs of locations (ta, fa), (tb, fb): floor fa of tower ta and floor fb of tower tb. For each pair you need to determine the minimum walking time between these locations.",
    "prob_desc_output_spec": "For each query print a single integer: the minimum walking time between the locations in minutes.",
    "prob_desc_input_spec": "The first line of the input contains following integers:   n: the number of towers in the building (1 ≤ n ≤ 108),  h: the number of floors in each tower (1 ≤ h ≤ 108),  a and b: the lowest and highest floor where it's possible to move between adjacent towers (1 ≤ a ≤ b ≤ h),  k: total number of queries (1 ≤ k ≤ 104).  Next k lines contain description of the queries. Each description consists of four integers ta, fa, tb, fb (1 ≤ ta, tb ≤ n, 1 ≤ fa, fb ≤ h). This corresponds to a query to find the minimum travel time between fa-th floor of the ta-th tower and fb-th floor of the tb-th tower.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_004.jsonl",
    "code_uid": "b117097a1241bdc521744c31456d4bc9",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 6 2 3 3\\n1 2 1 3\\n1 4 3 4\\n1 2 2 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "from sys import stdin\nn,h,a,b,k = map(int,stdin.readline().split())\nfor _ in xrange(k):\n    t1,f1,t2,f2 = map(int,stdin.readline().split())\n    ans = abs(t1-t2)\n    if t1 !=t2:\n        if f1 < a:\n            ans += a-f1\n            f1 = a\n        if f1 > b:\n            ans += f1 - b\n            f1 = b\n    ans += abs(f1-f2)\n    print ans\n        \n    ",
    "prob_desc_created_at": "1533994500",
    "tags": [
        "math"
    ],
    "hidden_unit_tests": ""
}