{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"2\\n4\\n3\\n4\\n1\\n1\"]",
    "src_uid": "bd9da9081902a87c61591fb58fcecfe3",
    "prob_desc_notes": null,
    "prob_desc_description": "Polycarp has a poor memory. Each day he can remember no more than $$$3$$$ of different letters. Polycarp wants to write a non-empty string of $$$s$$$ consisting of lowercase Latin letters, taking minimum number of days. In how many days will he be able to do it?Polycarp initially has an empty string and can only add characters to the end of that string.For example, if Polycarp wants to write the string lollipops, he will do it in $$$2$$$ days:   on the first day Polycarp will memorize the letters l, o, i and write lolli;  On the second day Polycarp will remember the letters p, o, s, add pops to the resulting line and get the line lollipops. If Polycarp wants to write the string stringology, he will do it in $$$4$$$ days:   in the first day will be written part str;  on day two will be written part ing;  on the third day, part of olog will be written;  on the fourth day, part of y will be written. For a given string $$$s$$$, print the minimum number of days it will take Polycarp to write it.",
    "prob_desc_output_spec": "For each test case, print a single number — minimum number of days it will take Polycarp to write the string $$$s$$$ from memory.",
    "prob_desc_input_spec": "The first line of input data contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases. Each test case consists of a non-empty string $$$s$$$ consisting of lowercase Latin letters (the length of the string $$$s$$$ does not exceed $$$2 \\cdot 10^5$$$) — the string Polycarp wants to construct. It is guaranteed that the sum of string lengths $$$s$$$ over all test cases does not exceed $$$2 \\cdot 10^5$$$.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 800,
    "file_name": "train_089.jsonl",
    "code_uid": "8ae3cd237994faa74f0cc13dcc36649d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"6\\n\\nlollipops\\n\\nstringology\\n\\nabracadabra\\n\\ncodeforces\\n\\ntest\\n\\nf\"]",
    "exec_outcome": "PASSED",
    "source_code": "a = input()\r\nfor i in range(int(a)):\r\n    res = 0\r\n    set_ = set()\r\n    for b in input():\r\n        set_.add(b)\r\n        if len(set_) > 3:\r\n            set_ = set()\r\n            res += 1\r\n            set_.add(b)\r\n    print(res+1)\r\n",
    "prob_desc_created_at": "1657463700",
    "tags": [
        "greedy"
    ],
    "hidden_unit_tests": ""
}