{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"5 12 4\", \"9 20 35 11 25\"]",
    "src_uid": "e3bc82acf70071b0e6d20a5b4fccbfba",
    "prob_desc_notes": "NoteIn the first sample, Bob first makes a snow pile of volume 10, which melts to the size of 5 on the same day. On the second day, he makes another pile of size 10. Since it is a bit warmer than the day before, the first pile disappears completely while the second pile shrinks to 3. At the end of the second day, he has only a single pile of size 3. On the third day he makes a smaller pile than usual, but as the temperature dropped too, both piles survive till the end of the day.",
    "prob_desc_description": "Alice likes snow a lot! Unfortunately, this year's winter is already over, and she can't expect to have any more of it. Bob has thus bought her a gift — a large snow maker. He plans to make some amount of snow every day. On day i he will make a pile of snow of volume Vi and put it in her garden.Each day, every pile will shrink a little due to melting. More precisely, when the temperature on a given day is Ti, each pile will reduce its volume by Ti. If this would reduce the volume of a pile to or below zero, it disappears forever. All snow piles are independent of each other. Note that the pile made on day i already loses part of its volume on the same day. In an extreme case, this may mean that there are no piles left at the end of a particular day.You are given the initial pile sizes and the temperature on each day. Determine the total volume of snow melted on each day. ",
    "prob_desc_output_spec": "Output a single line with N integers, where the i-th integer represents the total volume of snow melted on day i.",
    "prob_desc_input_spec": "The first line contains a single integer N (1 ≤ N ≤ 105) — the number of days.  The second line contains N integers V1, V2, ..., VN (0 ≤ Vi ≤ 109), where Vi is the initial size of a snow pile made on the day i. The third line contains N integers T1, T2, ..., TN (0 ≤ Ti ≤ 109), where Ti is the temperature on the day i.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1600,
    "file_name": "train_023.jsonl",
    "code_uid": "d220d11a2913ad053f2669e4fb174f2c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n10 10 5\\n5 7 2\", \"5\\n30 25 20 15 10\\n9 10 12 4 13\"]",
    "exec_outcome": "PASSED",
    "source_code": "import heapq\nheap = []\nn = int(input())\nV = list(map(int, input().split()))\nT = list(map(int, input().split()))\ntmp = 0\nfor i in range(n):\n    ans = 0\n    heapq.heappush(heap, tmp+V[i])\n    while len(heap) and heap[0]<=tmp+T[i]:\n        ans += heapq.heappop(heap)-tmp\n    tmp += T[i]\n    ans += T[i]*len(heap)\n    print(ans, end=' ')",
    "prob_desc_created_at": "1520696100",
    "tags": [
        "data structures",
        "binary search"
    ],
    "hidden_unit_tests": ""
}