{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"11 11 10\\n00 00 01\", \"11\\n10\\n01\\n00\"]",
    "src_uid": "ca6a798f38f028e9e69e6cb68ba7d005",
    "prob_desc_notes": "NoteConsider the answer for the first sample. There, the maximum sum among all columns equals 1 (the number of columns is 6, and not 3). Obviously, this maximum can't be less than 1, then such matrix is optimal.Note that the dominoes can be rotated by 180 degrees.",
    "prob_desc_description": "During the break, we decided to relax and play dominoes. Our box with Domino was empty, so we decided to borrow the teacher's dominoes.The teacher responded instantly at our request. He put nm dominoes on the table as an n × 2m rectangle so that each of the n rows contained m dominoes arranged horizontally. Each half of each domino contained number (0 or 1).We were taken aback, and the teacher smiled and said: \"Consider some arrangement of dominoes in an n × 2m matrix. Let's count for each column of the matrix the sum of numbers in this column. Then among all such sums find the maximum one. Can you rearrange the dominoes in the matrix in such a way that the maximum sum will be minimum possible? Note that it is prohibited to change the orientation of the dominoes, they all need to stay horizontal, nevertheless dominoes are allowed to rotate by 180 degrees. As a reward I will give you all my dominoes\".We got even more taken aback. And while we are wondering what was going on, help us make an optimal matrix of dominoes.",
    "prob_desc_output_spec": "Print the resulting matrix of dominoes in the format: n lines, each of them contains m space-separated dominoes. If there are multiple optimal solutions, print any of them.",
    "prob_desc_input_spec": "The first line contains integers n, m (1 ≤ n, m ≤ 103). In the next lines there is a description of the teachers' matrix. Each of next n lines contains m dominoes. The description of one domino is two integers (0 or 1), written without a space — the digits on the left and right half of the domino.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": null,
    "file_name": "train_073.jsonl",
    "code_uid": "305f8d08dd444a1c024274908b5609c1",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2 3\\n01 11 00\\n00 01 11\", \"4 1\\n11\\n10\\n01\\n00\"]",
    "exec_outcome": "PASSED",
    "source_code": "a,b=map(int,input().split())\nc=list()\nx00=0\nx01=0\nx11=0\nfor i in range(a):\n    c.append(list(input().split()))\n    x11+=c[-1].count('11')\n    x01+=c[-1].count('01')+c[-1].count('10')\nx00=a*b-x11-x01\nnew=[[]for i in range(b)]\ni=0\nwhile x11>0:\n    x11-=1\n    new[i].append('11')\n    i+=1\n    i%=b\nstep=1\nreverse=False\nwhile x01>0:\n    x01-=1\n    if reverse:\n        new[i].append('01')\n    else:\n        new[i].append('10')\n    i+=step\n    if i==-1 or i==b:\n        step=-step\n        i+=step\n        reverse=1-reverse\nfor r in new:\n    r+=['00']*(a-len(r))\nfor i in range(a):\n    print(' '.join([new[k][i]for k in range(b)]))\n",
    "prob_desc_created_at": "1392910200",
    "tags": [
        "constructive algorithms",
        "greedy"
    ],
    "hidden_unit_tests": ""
}