{
    "prob_desc_time_limit": "3 seconds",
    "prob_desc_sample_outputs": "[\"/\\n/home/vasya/\\n/home/\\n/home/petya/\", \"/a/b/\\n/a/a/b/\"]",
    "src_uid": "494ac937ba939db1dbc4081e518ab54c",
    "prob_desc_notes": null,
    "prob_desc_description": "Vasya is writing an operating system shell, and it should have commands for working with directories. To begin with, he decided to go with just two commands: cd (change the current directory) and pwd (display the current directory).Directories in Vasya's operating system form a traditional hierarchical tree structure. There is a single root directory, denoted by the slash character \"/\". Every other directory has a name — a non-empty string consisting of lowercase Latin letters. Each directory (except for the root) has a parent directory — the one that contains the given directory. It is denoted as \"..\".The command cd takes a single parameter, which is a path in the file system. The command changes the current directory to the directory specified by the path. The path consists of the names of directories separated by slashes. The name of the directory can be \"..\", which means a step up to the parent directory. «..» can be used in any place of the path, maybe several times. If the path begins with a slash, it is considered to be an absolute path, that is, the directory changes to the specified one, starting from the root. If the parameter begins with a directory name (or \"..\"), it is considered to be a relative path, that is, the directory changes to the specified directory, starting from the current one.The command pwd should display the absolute path to the current directory. This path must not contain \"..\".Initially, the current directory is the root. All directories mentioned explicitly or passed indirectly within any command cd are considered to exist. It is guaranteed that there is no attempt of transition to the parent directory of the root directory.",
    "prob_desc_output_spec": "For each command pwd you should print the full absolute path of the given directory, ending with a slash. It should start with a slash and contain the list of slash-separated directories in the order of being nested from the root to the current folder. It should contain no dots.",
    "prob_desc_input_spec": "The first line of the input data contains the single integer n (1 ≤ n ≤ 50) — the number of commands. Then follow n lines, each contains one command. Each of these lines contains either command pwd, or command cd, followed by a space-separated non-empty parameter. The command parameter cd only contains lower case Latin letters, slashes and dots, two slashes cannot go consecutively, dots occur only as the name of a parent pseudo-directory. The command parameter cd does not end with a slash, except when it is the only symbol that points to the root directory. The command parameter has a length from 1 to 200 characters, inclusive. Directories in the file system can have the same names.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_010.jsonl",
    "code_uid": "1526d6e4b5fb4fe9ab5c59f2a0f3f181",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"7\\npwd\\ncd /home/vasya\\npwd\\ncd ..\\npwd\\ncd vasya/../petya\\npwd\", \"4\\ncd /a/b\\npwd\\ncd ../a/b\\npwd\"]",
    "exec_outcome": "PASSED",
    "source_code": "N = int(input())\ncurrent_dir = []\nfor _ in range(N):\n    command = input()\n    if command == \"pwd\":\n        if len(current_dir) == 0:\n            print(\"/\")\n        else:\n            dir_str = \"/\" + \"/\".join(current_dir) + \"/\"\n            print(dir_str)\n    else:\n        command = command[3:]\n        if command[0] == \"/\":  # root\n            current_dir = []\n        cd = [dir for dir in command.split(\"/\") if dir != \"\"]\n        for dir in cd:\n            if dir == \"..\":\n                current_dir.pop()\n            else:\n                current_dir.append(dir)\n",
    "prob_desc_created_at": "1330804800",
    "tags": [
        "data structures",
        "implementation",
        "*special"
    ],
    "hidden_unit_tests": ""
}