{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\\n3\", \"4\\n1 2 3 4\"]",
    "src_uid": "961557bad90f98df7b40d6ceca942121",
    "prob_desc_notes": "NoteConsider the first sample test. The given answer is the only way to conduct an experiment involving the only data center. In such a scenario the third data center has a maintenance during the hour 1, and no two data centers storing the information of the same client have maintenance at the same hour.On the other hand, for example, if we shift the maintenance time on hour later for the first data center, then the data of clients 1 and 3 will be unavailable during the hour 0.",
    "prob_desc_description": "BigData Inc. is a corporation that has n data centers indexed from 1 to n that are located all over the world. These data centers provide storage for client data (you can figure out that client data is really big!).Main feature of services offered by BigData Inc. is the access availability guarantee even under the circumstances of any data center having an outage. Such a guarantee is ensured by using the two-way replication. Two-way replication is such an approach for data storage that any piece of data is represented by two identical copies that are stored in two different data centers.For each of m company clients, let us denote indices of two different data centers storing this client data as ci, 1 and ci, 2.In order to keep data centers operational and safe, the software running on data center computers is being updated regularly. Release cycle of BigData Inc. is one day meaning that the new version of software is being deployed to the data center computers each day.Data center software update is a non-trivial long process, that is why there is a special hour-long time frame that is dedicated for data center maintenance. During the maintenance period, data center computers are installing software updates, and thus they may be unavailable. Consider the day to be exactly h hours long. For each data center there is an integer uj (0 ≤ uj ≤ h - 1) defining the index of an hour of day, such that during this hour data center j is unavailable due to maintenance.Summing up everything above, the condition uci, 1 ≠ uci, 2 should hold for each client, or otherwise his data may be unaccessible while data centers that store it are under maintenance.Due to occasional timezone change in different cities all over the world, the maintenance time in some of the data centers may change by one hour sometimes. Company should be prepared for such situation, that is why they decided to conduct an experiment, choosing some non-empty subset of data centers, and shifting the maintenance time for them by an hour later (i.e. if uj = h - 1, then the new maintenance hour would become 0, otherwise it would become uj + 1). Nonetheless, such an experiment should not break the accessibility guarantees, meaning that data of any client should be still available during any hour of a day after the data center maintenance times are changed.Such an experiment would provide useful insights, but changing update time is quite an expensive procedure, that is why the company asked you to find out the minimum number of data centers that have to be included in an experiment in order to keep the data accessibility guarantees.",
    "prob_desc_output_spec": "In the first line print the minimum possible number of data centers k (1 ≤ k ≤ n) that have to be included in an experiment in order to keep the data available for any client. In the second line print k distinct integers x1, x2, ..., xk (1 ≤ xi ≤ n), the indices of data centers whose maintenance time will be shifted by one hour later. Data center indices may be printed in any order. If there are several possible answers, it is allowed to print any of them. It is guaranteed that at there is at least one valid choice of data centers.",
    "prob_desc_input_spec": "The first line of input contains three integers n, m and h (2 ≤ n ≤ 100 000, 1 ≤ m ≤ 100 000, 2 ≤ h ≤ 100 000), the number of company data centers, number of clients and the day length of day measured in hours.  The second line of input contains n integers u1, u2, ..., un (0 ≤ uj &lt; h), j-th of these numbers is an index of a maintenance hour for data center j.  Each of the next m lines contains two integers ci, 1 and ci, 2 (1 ≤ ci, 1, ci, 2 ≤ n, ci, 1 ≠ ci, 2), defining the data center indices containing the data of client i. It is guaranteed that the given maintenance schedule allows each client to access at least one copy of his data at any moment of day.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1900,
    "file_name": "train_053.jsonl",
    "code_uid": "9d816d564e4a446d096853a00424a9ce",
    "prob_desc_memory_limit": "512 megabytes",
    "prob_desc_sample_inputs": "[\"3 3 5\\n4 4 0\\n1 3\\n3 2\\n3 1\", \"4 5 4\\n2 1 0 3\\n4 3\\n3 2\\n1 2\\n1 4\\n1 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\n\n# sys.stind.readline lee datos el doble de\n# rápido que la funcion por defecto input\ninput = sys.stdin.readline\n\n\n\ndef get_input():\n    n, m, h = [int(x) for x in input().split(' ')]\n\n    digraph = [[] for _ in range(n + 1)]\n    transpose = [[] for _ in range(n + 1)]\n    mantainence = [0] + [int(x) for x in input().split(' ')]\n\n    for _ in range(m):\n        c1, c2 = [int(x) for x in input().split(' ')]\n\n        if (mantainence[c1] + 1) % h == mantainence[c2]:\n            digraph[c1].append(c2)\n            transpose[c2].append(c1)\n        if (mantainence[c2] + 1) % h == mantainence[c1]:\n            digraph[c2].append(c1)\n            transpose[c1].append(c2)\n\n    return digraph, transpose\n\n\ndef dfs_cc_1_visit(graph, node, color, finalization_stack):\n    stack = [node]\n\n    while stack:\n        current_node = stack[-1]\n\n        if color[current_node] != 'white':\n            stack.pop()\n            if color[current_node] == 'grey':\n                finalization_stack.append(current_node)\n                color[current_node] = 'black'\n            continue\n\n        color[current_node] = 'grey'\n        for adj in graph[current_node]:\n            if color[adj] == 'white':\n                stack.append(adj)\n\n\ndef dfs_cc_1(graph):\n    n = len(graph)\n    finalization_stack = []\n    color = ['white'] * n\n    for i in range(1, n):\n        if color[i] == 'white':\n            dfs_cc_1_visit(graph, i, color, finalization_stack)    \n    return finalization_stack\n\n\ndef dfs_cc_2_visit(graph, node, color, scc, component):\n    stack = [node]\n\n    while stack:\n        current_node = stack[-1]\n\n        if color[current_node] != 'white':\n            stack.pop()\n            color[current_node] = 'black'\n            scc[current_node] = component\n            continue\n\n        color[current_node] = 'grey'\n        for adj in graph[current_node]:\n            if color[adj] == 'white':\n                stack.append(adj)\n\n\ndef dfs_cc_2(graph, stack_time):\n    n = len(graph)\n    color = ['white'] * n\n    scc = [0] * n\n    component = 0\n    while stack_time:\n        current_node = stack_time.pop()\n        if color[current_node] == 'white':\n            dfs_cc_2_visit(graph, current_node, color, scc, component)\n            component += 1\n\n    return scc, component\n\n\ndef strongly_connected_components(digraph, transpose):\n    stack_time = dfs_cc_1(digraph)\n    scc, max_component = dfs_cc_2(transpose, stack_time)\n\n    # create the components\n    out_deg = [0] * max_component\n    scc_nodes = [[] for _ in range(max_component)]\n    for node in range(1, len(digraph)):\n        scc_nodes[scc[node]].append(node)\n        for adj in digraph[node]:\n            if scc[node] != scc[adj]:\n                out_deg[scc[node]] += 1\n    \n    # searching minimum strongly connectected component with out degree 0\n    minimum_component = None\n    for i, value in enumerate(out_deg):\n        if value == 0 and (minimum_component is None or len(scc_nodes[i]) < len(scc_nodes[minimum_component])):\n            minimum_component = i\n    \n    # return the size of the component and the nodes\n    return len(scc_nodes[minimum_component]), scc_nodes[minimum_component]\n\n\nif __name__ == \"__main__\":\n    digraph, transpose = get_input()\n    count, nodes = strongly_connected_components(digraph, transpose)\n    \n    print(count)\n    print(' '.join([str(x) for x in nodes]))\n",
    "prob_desc_created_at": "1520583000",
    "tags": [
        "dfs and similar",
        "graphs"
    ],
    "hidden_unit_tests": ""
}