{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"#   include &lt;cstdio&gt;\\nusingnamespacestd;intmain(){puts(\\\"Hello#World\\\");#\\n#\\n}\", \"#\\n\\n#\"]",
    "src_uid": "a16bb696858bc592c33dcf0fd99df197",
    "prob_desc_notes": "NoteIn the first sample the amplifying lines are lines 1 and 7. So, lines 2 to 6 are concatenated to each other, all spaces are deleted from them.In the second sample the amplifying lines are lines 1 and 3. So, no lines are concatenated to each other. ",
    "prob_desc_description": "Let's dive into one of the most interesting areas of magic — writing spells. Learning this exciting but challenging science is very troublesome, so now you will not learn the magic words, but only get to know the basic rules of writing spells.Each spell consists of several lines. The line, whose first non-space character is character \"#\" is an amplifying line and it is responsible for spell power. The remaining lines are common, and determine the effect of the spell.You came across the text of some spell. Spell was too long, so you cannot understand its meaning. So you want to make it as short as possible without changing the meaning.The only way to shorten a spell that you know is the removal of some spaces and line breaks. We know that when it comes to texts of spells, the spaces carry meaning only in the amplifying lines, so we should remove all spaces in other lines. Newlines also do not matter, unless any of the two separated lines is amplifying. Thus, if two consecutive lines are not amplifying, they need to be joined into one (i.e. we should concatenate the second line to the first one). Removing spaces in amplifying lines and concatenating the amplifying lines to anything is forbidden.Note that empty lines must be processed just like all the others: they must be joined to the adjacent non-amplifying lines, or preserved in the output, if they are surrounded with amplifying lines on both sides (i.e. the line above it, if there is one, is amplifying, and the line below it, if there is one, is amplifying too).For now those are the only instructions for removing unnecessary characters that you have to follow (oh yes, a newline is a character, too).The input contains the text of the spell, which should be reduced. Remove the extra characters and print the result to the output.",
    "prob_desc_output_spec": "Print the text of the spell where all extra characters are deleted. Please note that each output line should be followed by a newline. Please be careful: your answers will be validated by comparing them to the jury's answer byte-by-byte. So, all spaces and newlines matter.",
    "prob_desc_input_spec": "The input contains multiple lines. All characters in the lines have codes from 32 to 127 (inclusive). Please note that the lines may begin with or end with one or more spaces. The size of the input does not exceed 1048576 ( = 220) bytes. Newlines are included in this size. In the Windows operating system used on the testing computer, a newline is a sequence of characters with codes #13#10. It is guaranteed that after each line of input there is a newline. In particular, the input ends with a newline. Note that the newline is the end of the line, and not the beginning of the next one. It is guaranteed that the input contains at least one character other than a newline. It is recommended to organize the input-output line by line, in this case the newlines will be processed correctly by the language means.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 1700,
    "file_name": "train_022.jsonl",
    "code_uid": "1a4a78ec10ba184a0b9273620183bdc7",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"#   include &lt;cstdio&gt;\\n\\nusing namespace std;\\n\\nint main     (   ){\\nputs(\\\"Hello # World\\\"); #\\n#\\n}\", \"#\\n\\n#\"]",
    "exec_outcome": "PASSED",
    "source_code": "lis = []\n\nwhile True:\n  try:\n    val = raw_input()\n    isAmplifying = False\n\n    for c in val:\n      if not c.isspace():\n        if c == \"#\":\n          isAmplifying = True\n          break\n        else:\n          break\t\t\n\t\n    if isAmplifying:\n      lis.append((val, True))\n    else:\n      lis.append((\"\".join(val.split()), False))\n\t  \n  except (EOFError):\n    break\n\t\n\t\nindex = 0\nresult = []\n\nwhile index < len(lis):  \n  if lis[index][1] == True:\n    print lis[index][0]\n  else:\n    lisss = []  \n    while index < len(lis) and lis[index][1] != True:\n      lisss.append(lis[index][0])\t  \n      index += 1\t  \n    index -= 1\t  \n    print \"\".join(lisss)\n  index += 1\t\n\t  \nfor r in result:\n  print r\t  \n  ",
    "prob_desc_created_at": "1332860400",
    "tags": [
        "implementation",
        "strings"
    ],
    "hidden_unit_tests": ""
}