{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"6\", \"2\"]",
    "src_uid": "2c9c96dc5b6f8d1f0ddeea8e07640d3e",
    "prob_desc_notes": "NoteIn the first test example the sequence of Xenia's moves along the ringroad looks as follows: 1 → 2 → 3 → 4 → 1 → 2 → 3. This is optimal sequence. So, she needs 6 time units.",
    "prob_desc_description": "Xenia lives in a city that has n houses built along the main ringroad. The ringroad houses are numbered 1 through n in the clockwise order. The ringroad traffic is one way and also is clockwise.Xenia has recently moved into the ringroad house number 1. As a result, she's got m things to do. In order to complete the i-th task, she needs to be in the house number ai and complete all tasks with numbers less than i. Initially, Xenia is in the house number 1, find the minimum time she needs to complete all her tasks if moving from a house to a neighboring one along the ringroad takes one unit of time.",
    "prob_desc_output_spec": "Print a single integer — the time Xenia needs to complete all tasks. Please, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "prob_desc_input_spec": "The first line contains two integers n and m (2 ≤ n ≤ 105, 1 ≤ m ≤ 105). The second line contains m integers a1, a2, ..., am (1 ≤ ai ≤ n). Note that Xenia can have multiple consecutive tasks in one house.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_005.jsonl",
    "code_uid": "5e7d7c833051b1fa56191f083eb21241",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 3\\n3 2 3\", \"4 3\\n2 3 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "n,k=map(int,input().split())\nl=list(map(int,input().split()))\nc=0\nfor i in range(k-1):\n    if(l[i+1]<l[i]):\n        c+=1\nprint(c*n+l[-1]-1)",
    "prob_desc_created_at": "1377531000",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}