{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"2\", \"2\", \"3\"]",
    "src_uid": "89a8936bf7d43a9c5f69714a7cb7df82",
    "prob_desc_notes": "NoteIn the first sample, Inna first chooses type \"vertical segments\", and then she makes segments with ends at : (0, 0), (0, 2); and, for example, (1, 0), (1, 1). If she paints horizontal segments, she will need at least 3 segments.In the third sample it is important to note that Inna doesn't have the right to change the type of the segments during the game. That's why she will need 3 horizontal or 3 vertical segments to end the game.",
    "prob_desc_description": "Inna loves sleeping very much, so she needs n alarm clocks in total to wake up. Let's suppose that Inna's room is a 100 × 100 square with the lower left corner at point (0, 0) and with the upper right corner at point (100, 100). Then the alarm clocks are points with integer coordinates in this square.The morning has come. All n alarm clocks in Inna's room are ringing, so Inna wants to turn them off. For that Inna has come up with an amusing game:  First Inna chooses a type of segments that she will use throughout the game. The segments can be either vertical or horizontal.  Then Inna makes multiple moves. In a single move, Inna can paint a segment of any length on the plane, she chooses its type at the beginning of the game (either vertical or horizontal), then all alarm clocks that are on this segment switch off. The game ends when all the alarm clocks are switched off. Inna is very sleepy, so she wants to get through the alarm clocks as soon as possible. Help her, find the minimum number of moves in the game that she needs to turn off all the alarm clocks!",
    "prob_desc_output_spec": "In a single line print a single integer — the minimum number of segments Inna will have to draw if she acts optimally.",
    "prob_desc_input_spec": "The first line of the input contains integer n (1 ≤ n ≤ 105) — the number of the alarm clocks. The next n lines describe the clocks: the i-th line contains two integers xi, yi — the coordinates of the i-th alarm clock (0 ≤ xi, yi ≤ 100). Note that a single point in the room can contain any number of alarm clocks and the alarm clocks can lie on the sides of the square that represents the room.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": null,
    "file_name": "train_032.jsonl",
    "code_uid": "c66d0476cf9cfd1e9d7970faa8f20646",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\\n0 0\\n0 1\\n0 2\\n1 0\", \"4\\n0 0\\n0 1\\n1 0\\n1 1\", \"4\\n1 1\\n1 2\\n2 3\\n3 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "relojes = int(input())\nx = []\ny = []\nfor i in range(relojes):\n  ubicacion = list(map(int, (input().split())))\n  if ubicacion[1] not in x:\n    x += [ubicacion[1]]\n  if ubicacion[0] not in y:\n    y += [ubicacion[0]]\nprint(min(len(x), len(y)))",
    "prob_desc_created_at": "1392132600",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}