{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"0 4\\n3 9\\n2 3\\n8 8\\n4 8\"]",
    "src_uid": "1c4607c96f7755af09445ff29a54bd08",
    "prob_desc_notes": "NoteExplanation for examples:The first picture of each illustration shows how the field looked before the dyes were spilled. The second picture of each illustration shows how the field looked after Maxim spoiled white dye (the rectangle on which the dye was spilled is highlighted with red). The third picture in each illustration shows how the field looked after Denis spoiled black dye (the rectangle on which the dye was spilled is highlighted with red).In the first test, the paint on the field changed as follows:  In the second test, the paint on the field changed as follows:  In the third test, the paint on the field changed as follows:  In the fourth test, the paint on the field changed as follows:  In the fifth test, the paint on the field changed as follows:  ",
    "prob_desc_description": "Recently, Masha was presented with a chessboard with a height of $$$n$$$ and a width of $$$m$$$.The rows on the chessboard are numbered from $$$1$$$ to $$$n$$$ from bottom to top. The columns are numbered from $$$1$$$ to $$$m$$$ from left to right. Therefore, each cell can be specified with the coordinates $$$(x,y)$$$, where $$$x$$$ is the column number, and $$$y$$$ is the row number (do not mix up).Let us call a rectangle with coordinates $$$(a,b,c,d)$$$ a rectangle lower left point of which has coordinates $$$(a,b)$$$, and the upper right one — $$$(c,d)$$$.The chessboard is painted black and white as follows:   An example of a chessboard. Masha was very happy with the gift and, therefore, invited her friends Maxim and Denis to show off. The guys decided to make her a treat — they bought her a can of white and a can of black paint, so that if the old board deteriorates, it can be repainted. When they came to Masha, something unpleasant happened: first, Maxim went over the threshold and spilled white paint on the rectangle $$$(x_1,y_1,x_2,y_2)$$$. Then after him Denis spilled black paint on the rectangle $$$(x_3,y_3,x_4,y_4)$$$.To spill paint of color $$$color$$$ onto a certain rectangle means that all the cells that belong to the given rectangle become $$$color$$$. The cell dyeing is superimposed on each other (if at first some cell is spilled with white paint and then with black one, then its color will be black).Masha was shocked! She drove away from the guests and decided to find out how spoiled the gift was. For this, she needs to know the number of cells of white and black color. Help her find these numbers!",
    "prob_desc_output_spec": "Output $$$t$$$ lines, each of which contains two numbers — the number of white and black cells after spilling paint, respectively.",
    "prob_desc_input_spec": "The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^3$$$) — the number of test cases. Each of them is described in the following format: The first line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\le n,m \\le 10^9$$$) — the size of the board. The second line contains four integers $$$x_1$$$, $$$y_1$$$, $$$x_2$$$, $$$y_2$$$ ($$$1 \\le x_1 \\le x_2 \\le m, 1 \\le y_1 \\le y_2 \\le n$$$) — the coordinates of the rectangle, the white paint was spilled on. The third line contains four integers $$$x_3$$$, $$$y_3$$$, $$$x_4$$$, $$$y_4$$$ ($$$1 \\le x_3 \\le x_4 \\le m, 1 \\le y_3 \\le y_4 \\le n$$$) — the coordinates of the rectangle, the black paint was spilled on.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1500,
    "file_name": "train_024.jsonl",
    "code_uid": "9963174b80550d9ce1afe08d81973e67",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5\\n2 2\\n1 1 2 2\\n1 1 2 2\\n3 4\\n2 2 3 2\\n3 1 4 3\\n1 5\\n1 1 5 1\\n3 1 5 1\\n4 4\\n1 1 4 2\\n1 3 4 4\\n3 4\\n1 2 4 2\\n2 1 3 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "#!/usr/bin/env python3\nimport sys\n\ndef rint():\n    return map(int, sys.stdin.readline().split())\n#lines = stdin.readlines()\n\n\ndef cnt_b(xx1, yy1, xx2, yy2):\n    w = xx2 - xx1 + 1\n    h = yy2 - yy1 + 1\n    return w*h - cnt_w(xx1, yy1, xx2, yy2)\n\n\ndef cnt_w(xx1, yy1, xx2, yy2):\n    w = xx2 - xx1 + 1\n    h = yy2 - yy1 + 1\n    cnt = (w*h)//2\n    if w%2 and h%2:\n        if xx1%2 and yy1%2 or xx1%2 == 0 and yy1%2 == 0:\n            cnt+=1\n    return cnt\n\n\ndef area(w, h):\n    return w*h\n\n\ndef cross_rect(x1, y1, x2, y2, x3, y3, x4, y4):\n    xl = max(x1, x3)\n    xr = min(x2, x4)\n    yl = max(y1, y3)\n    yr = min(y2, y4)\n    if xl <= xr and yl <= yr:\n        return xl, yl, xr, yr\n    else:\n        return -1, -1, -1, -1\n\n\nt = int(input())\nfor i in range(t):\n    n, m = rint()\n    x1, y1, x2, y2 = rint()\n    x3, y3, x4, y4 = rint()\n    tot_w = cnt_w(1, 1, m, n)\n    wc = tot_w + cnt_b(x1, y1, x2, y2)\n    wc -= cnt_w(x3, y3, x4, y4)\n    xl, yl, xr, yr = cross_rect(x1, y1, x2, y2, x3, y3, x4, y4)\n    if xl != -1:\n        wc -= cnt_b(xl, yl, xr, yr)\n    print(wc, m*n - wc)\n\n\n",
    "prob_desc_created_at": "1543044900",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}