{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"6\\n-1\\n10\", \"3\\n3\", \"6\\n9\\n30\\n-1\\n15\\n36\"]",
    "src_uid": "9f46205d62ba05d8bcc2c56f84b2d2b2",
    "prob_desc_notes": "NoteIn the first example in the second 1 the first task will come, it will be performed on the servers with ids 1, 2 and 3 (the sum of the ids equals 6) during two seconds. In the second 2 the second task will come, it will be ignored, because only the server 4 will be unoccupied at that second. In the second 3 the third task will come. By this time, servers with the ids 1, 2 and 3 will be unoccupied again, so the third task will be done on all the servers with the ids 1, 2, 3 and 4 (the sum of the ids is 10).In the second example in the second 3 the first task will come, it will be performed on the servers with ids 1 and 2 (the sum of the ids is 3) during three seconds. In the second 5 the second task will come, it will be performed on the server 3, because the first two servers will be busy performing the first task.",
    "prob_desc_description": "There are n servers in a laboratory, each of them can perform tasks. Each server has a unique id — integer from 1 to n.It is known that during the day q tasks will come, the i-th of them is characterized with three integers: ti — the moment in seconds in which the task will come, ki — the number of servers needed to perform it, and di — the time needed to perform this task in seconds. All ti are distinct.To perform the i-th task you need ki servers which are unoccupied in the second ti. After the servers begin to perform the task, each of them will be busy over the next di seconds. Thus, they will be busy in seconds ti, ti + 1, ..., ti + di - 1. For performing the task, ki servers with the smallest ids will be chosen from all the unoccupied servers. If in the second ti there are not enough unoccupied servers, the task is ignored.Write the program that determines which tasks will be performed and which will be ignored.",
    "prob_desc_output_spec": "Print q lines. If the i-th task will be performed by the servers, print in the i-th line the sum of servers' ids on which this task will be performed. Otherwise, print -1.",
    "prob_desc_input_spec": "The first line contains two positive integers n and q (1 ≤ n ≤ 100, 1 ≤ q ≤ 105) — the number of servers and the number of tasks.  Next q lines contains three integers each, the i-th line contains integers ti, ki and di (1 ≤ ti ≤ 106, 1 ≤ ki ≤ n, 1 ≤ di ≤ 1000) — the moment in seconds in which the i-th task will come, the number of servers needed to perform it, and the time needed to perform this task in seconds. The tasks are given in a chronological order and they will come in distinct seconds. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 1300,
    "file_name": "train_014.jsonl",
    "code_uid": "b2570182405cc5ff4bfcc1bcc022861c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 3\\n1 3 2\\n2 2 1\\n3 4 3\", \"3 2\\n3 2 3\\n5 1 2\", \"8 6\\n1 3 20\\n4 2 1\\n6 5 5\\n10 1 1\\n15 3 6\\n21 8 8\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\n\nn, q = map(int, raw_input().split())\nlast_busy = [0] * (n + 1)\nfor _ in xrange(q):\n    t, k, d = map(int, raw_input().split())\n    free = []\n    for server in xrange(1, n + 1):\n        if last_busy[server] <= t:\n            free.append(server)\n        if len(free) == k:\n            break\n    if len(free) == k:\n        sys.stdout.write(str(sum(free)) + \"\\n\")\n        for server in free:\n            last_busy[server] = t + d\n    else:\n       sys.stdout.write(\"-1\\n\")\n",
    "prob_desc_created_at": "1482113100",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}