{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"6\\n0 0\\n0 3\\n1 3\\n1 4\\n3 4\\n3 0\", \"14\\n-3 0\\n-3 3\\n0 3\\n0 2\\n1 2\\n1 0\\n2 0\\n2 4\\n4 4\\n4 2\\n6 2\\n6 3\\n8 3\\n8 0\"]",
    "src_uid": "f322b000a105013e6aa12a597cce6262",
    "prob_desc_notes": null,
    "prob_desc_description": "No Great Victory anniversary in Berland has ever passed without the war parade. This year is not an exception. That’s why the preparations are on in full strength. Tanks are building a line, artillery mounts are ready to fire, soldiers are marching on the main square... And the air forces general Mr. Generalov is in trouble again. This year a lot of sky-scrapers have been built which makes it difficult for the airplanes to fly above the city. It was decided that the planes should fly strictly from south to north. Moreover, there must be no sky scraper on a plane’s route, otherwise the anniversary will become a tragedy. The Ministry of Building gave the data on n sky scrapers (the rest of the buildings are rather small and will not be a problem to the planes). When looking at the city from south to north as a geometrical plane, the i-th building is a rectangle of height hi. Its westernmost point has the x-coordinate of li and the easternmost — of ri. The terrain of the area is plain so that all the buildings stand on one level. Your task as the Ministry of Defence’s head programmer is to find an enveloping polyline using the data on the sky-scrapers. The polyline’s properties are as follows:  If you look at the city from south to north as a plane, then any part of any building will be inside or on the boarder of the area that the polyline encloses together with the land surface.  The polyline starts and ends on the land level, i.e. at the height equal to 0.  The segments of the polyline are parallel to the coordinate axes, i.e. they can only be vertical or horizontal.  The polyline’s vertices should have integer coordinates.  If you look at the city from south to north the polyline (together with the land surface) must enclose the minimum possible area.  The polyline must have the smallest length among all the polylines, enclosing the minimum possible area with the land.  The consecutive segments of the polyline must be perpendicular.    Picture to the second sample test (the enveloping polyline is marked on the right). ",
    "prob_desc_output_spec": "In the first line output integer m — amount of vertices of the enveloping polyline. The next m lines should contain 2 integers each — the position and the height of the polyline’s vertex. Output the coordinates of each vertex in the order of traversing the polyline from west to east. Remember that the first and the last vertices of the polyline should have the height of 0.",
    "prob_desc_input_spec": "The first input line contains integer n (1 ≤ n ≤ 100000). Then follow n lines, each containing three integers hi, li, ri (1 ≤ hi ≤ 109,  - 109 ≤ li &lt; ri ≤ 109).",
    "prob_desc_output_to": "output.txt",
    "prob_desc_input_from": "input.txt",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2100,
    "file_name": "train_074.jsonl",
    "code_uid": "3fa66de64907aa70210a9432e155e169",
    "prob_desc_memory_limit": "64 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n3 0 2\\n4 1 3\", \"5\\n3 -3 0\\n2 -1 1\\n4 2 4\\n2 3 7\\n3 6 8\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\nfrom array import array  # noqa: F401\nfrom collections import defaultdict\nfrom heapq import heappop, heappush\nimport gc\n\n\ndef input():\n    with open('input.txt') as fp:\n        return fp.readlines()\n\n\ndef output(ans: str):\n    with open('output.txt', mode='w') as fp:\n        fp.write(ans)\n\n\n'''\ndef input():\n    return [line.decode('utf-8') for line in sys.stdin.buffer.readlines()]\n\n\ndef output(ans):\n    print(ans)\n'''\n\n\ns = input()\nn = int(s[0])\ndd = defaultdict(list)\npos_set = set()\npos_a, hi_a = [0] * n, [0] * n\nfor i, (h, l, r) in enumerate(map(int, line.split()) for line in s[1:]):\n    hi_a[i] = -h\n    pos_a[i] = r\n    dd[l].append(i)\n    pos_set.add(l)\n    pos_set.add(r)\n\ns = None\ngc.collect()\n\nhi_pos = defaultdict(lambda: -10**9 - 100)\nhi_pos[0] = 10**9 + 100\nhq = [0]\nans = []\nhi = 0\nfor pos in sorted(pos_set):\n    while hq and hi_pos[hq[0]] <= pos:\n        heappop(hq)\n    if pos in dd:\n        for i in dd[pos]:\n            heappush(hq, hi_a[i])\n            hi_pos[hi_a[i]] = max(hi_pos[hi_a[i]], pos_a[i])\n        del dd[pos]\n\n    if hi != hq[0]:\n        ans.append(f'{pos} {-hi}\\n{pos} {-hq[0]}')\n        hi = hq[0]\n\noutput(str(len(ans) * 2) + '\\n' + '\\n'.join(ans))\n",
    "prob_desc_created_at": "1287471600",
    "tags": [
        "data structures",
        "sortings"
    ],
    "hidden_unit_tests": ""
}