{
    "prob_desc_time_limit": "4 seconds",
    "prob_desc_sample_outputs": "[\"2\\n3\\n2\\n5\"]",
    "src_uid": "1250f103aa5fd1ac300a8a71b816b3e4",
    "prob_desc_notes": null,
    "prob_desc_description": "In one very large and very respectable company there is a cloakroom with a coat hanger. It is represented by n hooks, positioned in a row. The hooks are numbered with positive integers from 1 to n from the left to the right.The company workers have a very complicated work schedule. At the beginning of a work day all the employees are not there and the coat hanger in the cloakroom is empty. At some moments of time the employees arrive and some of them leave.When some employee arrives, he hangs his cloak on one of the available hooks. To be of as little discomfort to his colleagues as possible, the hook where the coat will hang, is chosen like this. First the employee chooses the longest segment among available hooks following in a row. If there are several of such segments, then he chooses the one closest to the right. After that the coat is hung on the hook located in the middle of this segment. If the segment has an even number of hooks, then among two central hooks we choose the one closest to the right.When an employee leaves, he takes his coat. As all the company workers deeply respect each other, no one takes somebody else's coat.From time to time the director of this respectable company gets bored and he sends his secretary to see how many coats hang on the coat hanger from the i-th to the j-th hook inclusive. And this whim is always to be fulfilled, otherwise the director gets angry and has a mental breakdown.Not to spend too much time traversing from the director's office to the cloakroom and back again, the secretary asked you to write a program, emulating the company cloakroom's work.",
    "prob_desc_output_spec": "For each director's request in the input data print a single number on a single line — the number of coats hanging on the hooks from the i-th one to the j-th one inclusive.",
    "prob_desc_input_spec": "The first line contains two integers n, q (1 ≤ n ≤ 109, 1 ≤ q ≤ 105), which are the number of hooks on the hanger and the number of requests correspondingly. Then follow q lines with requests, sorted according to time. The request of the type \"0 i j\" (1 ≤ i ≤ j ≤ n) — is the director's request. The input data has at least one director's request. In all other cases the request contains a positive integer not exceeding 109 — an employee identificator. Each odd appearance of the identificator of an employee in the request list is his arrival. Each even one is his leaving. All employees have distinct identificators. When any employee arrives, there is always at least one free hook.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 2400,
    "file_name": "train_075.jsonl",
    "code_uid": "c645f116b7e54b5f007c5fc2e433f52a",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"9 11\\n1\\n2\\n0 5 8\\n1\\n1\\n3\\n0 3 8\\n9\\n0 6 9\\n6\\n0 1 9\"]",
    "exec_outcome": "PASSED",
    "source_code": "import sys\nfrom heapq import *    \nn,q = map(int,raw_input().split())\nrl = sys.stdin.readline\nz,l,r,t = {},{},{},{}\nh = []\nqq = 2*q+2\na = [True]*qq\nb,e = [0]*qq,[0]*qq\nac = 0\ndef add(bb,ee):\n    global b,e,h,ac\n    if bb>=ee:\n\tl[ee]=r[bb-1]=0\n\treturn\n    b[ac]=bb\n    e[ac]=ee\n    r[bb-1]=l[ee]=ac\n    heappush(h,(bb-ee,-ee,bb,ac))\n    ac+=1\nadd (1,n+1)\ndef f(x):\n    r = 0\n    while x: r+=t.get(x,0); x-=x&-x; \n    return r\nfor _ in xrange(q):\n    p = rl()\n    if p[0]=='0':\n\t_,i,j = map(int,p.split())\n\tprint f(j)-f(i-1)\n    else:\n\ti = int(p)\n\tif i in z:\n\t    m = z[i]\n\t    a[l[m]]=a[r[m]]=False\n\t    bb=b[l[m]] if l[m] else m\n\t    ee=e[r[m]] if r[m] else m+1\n\t    add(bb,ee)\n\t    del z[i]\n\t    d=-1\n\telse:\n\t    while 1:\n\t\t_,ee,bb,j = heappop(h)\n\t\tif a[j]: break\n\t    m = (-ee+bb)/2\n\t    add(bb,m)\n\t    add(m+1,-ee)\n\t    z[i] = m\n\t    d=1\n\twhile m<=n: t[m]=t.get(m,0)+d; m+=m&-m\n",
    "prob_desc_created_at": "1302879600",
    "tags": [
        "data structures"
    ],
    "hidden_unit_tests": ""
}