{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"5\", \"0\", \"0\"]",
    "src_uid": "92996552cc26a05258f2f2a1eb5f8a8f",
    "prob_desc_notes": null,
    "prob_desc_description": "Patrick has just finished writing a message to his sweetheart Stacey when he noticed that the message didn't look fancy. Patrick was nervous while writing the message, so some of the letters there were lowercase and some of them were uppercase.Patrick believes that a message is fancy if any uppercase letter stands to the left of any lowercase one. In other words, this rule describes the strings where first go zero or more uppercase letters, and then — zero or more lowercase letters.To make the message fancy, Patrick can erase some letter and add the same letter in the same place in the opposite case (that is, he can replace an uppercase letter with the lowercase one and vice versa). Patrick got interested in the following question: what minimum number of actions do we need to make a message fancy? Changing a letter's case in the message counts as one action. Patrick cannot perform any other actions.",
    "prob_desc_output_spec": "Print a single number — the least number of actions needed to make the message fancy.",
    "prob_desc_input_spec": "The only line of the input contains a non-empty string consisting of uppercase and lowercase letters. The string's length does not exceed 105.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1400,
    "file_name": "train_007.jsonl",
    "code_uid": "e8c7d33910304f63502626bc25a5f5d6",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"PRuvetSTAaYA\", \"OYPROSTIYAOPECHATALSYAPRIVETSTASYA\", \"helloworld\"]",
    "exec_outcome": "PASSED",
    "source_code": "#!/usr/bin/env python\n\nfrom sys import stdin\n\ns = stdin.readline()\nans = 0\na = 0\nfor i in s:\n    if i.islower():\n        a += 1\n    elif i.isupper() and a > 0:\n        a -= 1\n        ans += 1\nprint ans\n",
    "prob_desc_created_at": "1335078000",
    "tags": [
        "dp"
    ],
    "hidden_unit_tests": ""
}