{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"4\", \"5\", \"5\"]",
    "src_uid": "ed0a8a10e03de931856e287f9e650e1a",
    "prob_desc_notes": "NoteFirst sample: Student will first move to the first pile (1 second), then remove box from first pile (1 second), then move to the second pile (1 second) and finally remove the box from second pile (1 second).Second sample: One of optimal solutions is to send one student to remove a box from the first pile and a box from the third pile, and send another student to remove a box from the third pile. Overall, 5 seconds.Third sample: With a lot of available students, send three of them to remove boxes from the first pile, four of them to remove boxes from the second pile, five of them to remove boxes from the third pile, and four of them to remove boxes from the fourth pile. Process will be over in 5 seconds, when removing the boxes from the last pile is finished.",
    "prob_desc_description": "Professor GukiZ is concerned about making his way to school, because massive piles of boxes are blocking his way. In total there are n piles of boxes, arranged in a line, from left to right, i-th pile (1 ≤ i ≤ n) containing ai boxes. Luckily, m students are willing to help GukiZ by removing all the boxes from his way. Students are working simultaneously. At time 0, all students are located left of the first pile. It takes one second for every student to move from this position to the first pile, and after that, every student must start performing sequence of two possible operations, each taking one second to complete. Possible operations are: If i ≠ n, move from pile i to pile i + 1; If pile located at the position of student is not empty, remove one box from it.GukiZ's students aren't smart at all, so they need you to tell them how to remove boxes before professor comes (he is very impatient man, and doesn't want to wait). They ask you to calculate minumum time t in seconds for which they can remove all the boxes from GukiZ's way. Note that students can be positioned in any manner after t seconds, but all the boxes must be removed.",
    "prob_desc_output_spec": "In a single line, print one number, minimum time needed to remove all the boxes in seconds.",
    "prob_desc_input_spec": "The first line contains two integers n and m (1 ≤ n, m ≤ 105), the number of piles of boxes and the number of GukiZ's students.  The second line contains n integers a1, a2, ... an (0 ≤ ai ≤ 109) where ai represents the number of boxes on i-th pile. It's guaranteed that at least one pile of is non-empty.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2200,
    "file_name": "train_011.jsonl",
    "code_uid": "5139a60ef66965a40065dbdbee11190b",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2 1\\n1 1\", \"3 2\\n1 0 2\", \"4 100\\n3 4 5 4\"]",
    "exec_outcome": "PASSED",
    "source_code": "N, M = map(int, input().split())\nbooks_list = list(map(int, input().split()))\n\nwhile books_list[-1] == 0:\n    books_list.pop()\nbooks_list.insert(0, 0)\n\ndef check(Time):\n    piles = books_list[:]\n    last_pile_no = len(piles) - 1\n    for i in range(M): #student\n        i_time = Time - last_pile_no\n        while True:\n            if i_time >= piles[last_pile_no]:\n                i_time -= piles[last_pile_no]\n                last_pile_no -= 1\n                if last_pile_no == 0:\n                    return True\n            else:\n                piles[last_pile_no] -= i_time\n                break\n\n    return False\n\nl = 0\nr = int(sum(books_list)/M) + len(books_list) + 1\n\nwhile r-l > 1:\n    mid = int((l+r)/2)\n    if check(mid):\n        r = mid\n    else:\n        l = mid\nprint(r)\n",
    "prob_desc_created_at": "1434127500",
    "tags": [
        "binary search",
        "greedy"
    ],
    "hidden_unit_tests": ""
}