{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"2\", \"1\"]",
    "src_uid": "f2142bc2f44e5d8b77f8561c29038a73",
    "prob_desc_notes": "NoteIn the first example if Emma chooses the first or the third streets Jack can choose an avenue with the cost of the dinner 1. So she chooses the second street and Jack chooses any avenue. The cost of the dinner is 2.In the second example regardless of Emma's choice Jack can choose a restaurant with the cost of the dinner 1.",
    "prob_desc_description": "Jack decides to invite Emma out for a dinner. Jack is a modest student, he doesn't want to go to an expensive restaurant. Emma is a girl with high taste, she prefers elite places.Munhattan consists of n streets and m avenues. There is exactly one restaurant on the intersection of each street and avenue. The streets are numbered with integers from 1 to n and the avenues are numbered with integers from 1 to m. The cost of dinner in the restaurant at the intersection of the i-th street and the j-th avenue is cij.Jack and Emma decide to choose the restaurant in the following way. Firstly Emma chooses the street to dinner and then Jack chooses the avenue. Emma and Jack makes their choice optimally: Emma wants to maximize the cost of the dinner, Jack wants to minimize it. Emma takes into account that Jack wants to minimize the cost of the dinner. Find the cost of the dinner for the couple in love.",
    "prob_desc_output_spec": "Print the only integer a — the cost of the dinner for Jack and Emma.",
    "prob_desc_input_spec": "The first line contains two integers n, m (1 ≤ n, m ≤ 100) — the number of streets and avenues in Munhattan. Each of the next n lines contains m integers cij (1 ≤ cij ≤ 109) — the cost of the dinner in the restaurant on the intersection of the i-th street and the j-th avenue.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_009.jsonl",
    "code_uid": "846993bea13978cd3502098d4578e6f0",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 4\\n4 1 3 5\\n2 2 2 2\\n5 4 5 1\", \"3 3\\n1 2 3\\n2 3 1\\n3 1 2\"]",
    "exec_outcome": "PASSED",
    "source_code": "s, a = list(map(int, input().rstrip().split()))\nmat = []\nl = []\nfor i in range(s):\n    b = list(map(int, input().rstrip().split()))\n    l += [min(b)]\nprint(max(l))",
    "prob_desc_created_at": "1452524400",
    "tags": [
        "greedy",
        "games"
    ],
    "hidden_unit_tests": ""
}