{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"2\", \"0\", \"81\"]",
    "src_uid": "4e1fc2fcc83b007c943a8ea26eea6320",
    "prob_desc_notes": "NoteThe first test coincides with the figure. In this case the given tracks can be read in 2 seconds in the following way:   during the first second move the 1-st head to the left and let it stay there;  move the second head to the left twice;  move the third head to the right twice (note that the 6-th track has already been read at the beginning). One cannot read the tracks in 1 second as the 3-rd head is at distance 2 from the 8-th track.",
    "prob_desc_description": "Mad scientist Mike does not use slow hard disks. His modification of a hard drive has not one, but n different heads that can read data in parallel.When viewed from the side, Mike's hard drive is an endless array of tracks. The tracks of the array are numbered from left to right with integers, starting with 1. In the initial state the i-th reading head is above the track number hi. For each of the reading heads, the hard drive's firmware can move the head exactly one track to the right or to the left, or leave it on the current track. During the operation each head's movement does not affect the movement of the other heads: the heads can change their relative order; there can be multiple reading heads above any of the tracks. A track is considered read if at least one head has visited this track. In particular, all of the tracks numbered h1, h2, ..., hn have been read at the beginning of the operation.  Mike needs to read the data on m distinct tracks with numbers p1, p2, ..., pm. Determine the minimum time the hard drive firmware needs to move the heads and read all the given tracks. Note that an arbitrary number of other tracks can also be read.",
    "prob_desc_output_spec": "Print a single number — the minimum time required, in seconds, to read all the needed tracks.",
    "prob_desc_input_spec": "The first line of the input contains two space-separated integers n, m (1 ≤ n, m ≤ 105) — the number of disk heads and the number of tracks to read, accordingly. The second line contains n distinct integers hi in ascending order (1 ≤ hi ≤ 1010, hi &lt; hi + 1) — the initial positions of the heads. The third line contains m distinct integers pi in ascending order (1 ≤ pi ≤ 1010, pi &lt; pi + 1) - the numbers of tracks to read. Please, do not use the %lld specifier to read or write 64-bit integers in С++. It is recommended to use the cin, cout streams or the %I64d specifier.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1900,
    "file_name": "train_025.jsonl",
    "code_uid": "5db26c23acf1a71fb4e5d7c85bb41995",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3 4\\n2 5 6\\n1 3 6 8\", \"3 3\\n1 2 3\\n1 2 3\", \"1 2\\n165\\n142 200\"]",
    "exec_outcome": "PASSED",
    "source_code": "def can(d,a,b):\n    d1=d\n    mi=a[-1]\n    ma=a[-1]\n    x=len(a)-1\n    y=len(b)-1\n    while x>=0 and y>=0:\n        if b[y]<=mi:\n            if abs(b[y]-ma)<=d1:\n                x-=1\n                if x==-1:\n                    break\n                ma=a[x]\n            else:\n                y-=1\n                mi=a[x]\n                ma=a[x]\n        elif b[y]>=ma:\n            if abs(b[y]-mi)<=d1:\n                x-=1\n                if x==-1:\n                    break\n                ma=a[x]\n            else:\n                y-=1\n                mi=a[x]\n                ma=a[x]\n        else:\n            if abs(ma-mi)+min(abs(b[y]-mi),abs(b[y]-ma))<=d1:\n                x-=1\n                if x==-1:\n                    break\n                ma=a[x]\n            else:\n                y-=1\n                mi=a[x]\n                ma=a[x]\n    return x==-1 \nn,m=map(int,input().split())\ns=list(map(int,input().split()))[::-1]\ns1=list(map(int,input().split()))[::-1]\nhigh=(10**10)*3\nlow=0\nwhile high-low>1:\n    mid=(high+low)//2\n    if can(mid,s1,s):\n        high=mid\n    else:\n        low=mid\nif can(low,s1,s):\n    print(low)\nelse:\n    print(high)\n    ",
    "prob_desc_created_at": "1379172600",
    "tags": [
        "two pointers",
        "binary search"
    ],
    "hidden_unit_tests": ""
}