{
    "prob_desc_time_limit": "3 seconds",
    "prob_desc_sample_outputs": "[\"6\", \"9\"]",
    "src_uid": "ca22cf92727a38fbb3c085b9362602db",
    "prob_desc_notes": "NoteThe figure below shows one of possible division into pairs in the first test. If you connect universities number 1 and 6 (marked in red) and universities number 2 and 5 (marked in blue) by using the cable, the total distance will equal 6 which will be the maximum sum in this example.   ",
    "prob_desc_description": "Treeland is a country in which there are n towns connected by n - 1 two-way road such that it's possible to get from any town to any other town. In Treeland there are 2k universities which are located in different towns. Recently, the president signed the decree to connect universities by high-speed network.The Ministry of Education understood the decree in its own way and decided that it was enough to connect each university with another one by using a cable. Formally, the decree will be done! To have the maximum sum in the budget, the Ministry decided to divide universities into pairs so that the total length of the required cable will be maximum. In other words, the total distance between universities in k pairs should be as large as possible. Help the Ministry to find the maximum total distance. Of course, each university should be present in only one pair. Consider that all roads have the same length which is equal to 1. ",
    "prob_desc_output_spec": "Print the maximum possible sum of distances in the division of universities into k pairs.",
    "prob_desc_input_spec": "The first line of the input contains two integers n and k (2 ≤ n ≤ 200 000, 1 ≤ k ≤ n / 2) — the number of towns in Treeland and the number of university pairs. Consider that towns are numbered from 1 to n.  The second line contains 2k distinct integers u1, u2, ..., u2k (1 ≤ ui ≤ n) — indices of towns in which universities are located.  The next n - 1 line contains the description of roads. Each line contains the pair of integers xj and yj (1 ≤ xj, yj ≤ n), which means that the j-th road connects towns xj and yj. All of them are two-way roads. You can move from any town to any other using only these roads. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 3",
    "lang_cluster": "Python",
    "difficulty": 1800,
    "file_name": "train_021.jsonl",
    "code_uid": "bca5d4900ad1b57488a9095c876c7b89",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"7 2\\n1 5 6 2\\n1 3\\n3 2\\n4 5\\n3 7\\n4 3\\n4 6\", \"9 3\\n3 2 1 6 5 9\\n8 9\\n3 2\\n2 7\\n3 4\\n7 6\\n4 5\\n2 1\\n2 8\"]",
    "exec_outcome": "PASSED",
    "source_code": "from collections import defaultdict\nfrom sys import stdin\n\ndef put(): return map(int, stdin.readline().split())\n\ndef dfs():\n    s = [(1,0)]\n    ans = 0\n    vis = [0]*(n+1)\n    while s:\n        i,p = s.pop()\n        if vis[i]==0:\n            vis[i]=1\n            s.append((i,p))\n            for j in tree[i]:\n                if j!=p:\n                    s.append((j,i))\n        elif vis[i]==1:\n            vis[i]=2\n            for j in tree[i]:\n                if j != p:\n                    mark[i]+= mark[j]\n            ans += min(mark[i], 2*k - mark[i])\n    print(ans)\n        \n\n\n\n\nn,k = put()\nl = list(put())\n\nedge = defaultdict()\ntree = [[] for i in range(n+1)]\nmark = [0]*(n+1)\nfor i in l:\n    mark[i]=1\nfor _ in range(n-1):\n    x,y = put()\n    tree[x].append(y)\n    tree[y].append(x)\ndfs()",
    "prob_desc_created_at": "1469205300",
    "tags": [
        "dp",
        "dfs and similar",
        "trees",
        "graphs"
    ],
    "hidden_unit_tests": ""
}