{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1\", \"2\", \"3\"]",
    "src_uid": "be12bb8148708f9ad3dc33b83b55eb1e",
    "prob_desc_notes": "NoteIn the first sample, Vasya may transfer 5 from the first bank to the third.In the second sample, Vasya may first transfer 1 from the third bank to the second, and then 1 from the second to the first.In the third sample, the following sequence provides the optimal answer:   transfer 1 from the first bank to the second bank;  transfer 3 from the second bank to the third;  transfer 6 from the third bank to the fourth. ",
    "prob_desc_description": "There are n banks in the city where Vasya lives, they are located in a circle, such that any two banks are neighbouring if their indices differ by no more than 1. Also, bank 1 and bank n are neighbours if n &gt; 1. No bank is a neighbour of itself.Vasya has an account in each bank. Its balance may be negative, meaning Vasya owes some money to this bank.There is only one type of operations available: transfer some amount of money from any bank to account in any neighbouring bank. There are no restrictions on the size of the sum being transferred or balance requirements to perform this operation.Vasya doesn't like to deal with large numbers, so he asks you to determine the minimum number of operations required to change the balance of each bank account to zero. It's guaranteed, that this is possible to achieve, that is, the total balance of Vasya in all banks is equal to zero.",
    "prob_desc_output_spec": "Print the minimum number of operations required to change balance in each bank to zero.",
    "prob_desc_input_spec": "The first line of the input contains a single integer n (1 ≤ n ≤ 100 000) — the number of banks. The second line contains n integers ai ( - 109 ≤ ai ≤ 109), the i-th of them is equal to the initial balance of the account in the i-th bank. It's guaranteed that the sum of all ai is equal to 0.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2100,
    "file_name": "train_005.jsonl",
    "code_uid": "be3bb3fb2c2e380dd22fb88535cc0744",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n5 0 -5\", \"4\\n-1 0 1 0\", \"4\\n1 2 3 -6\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(input())\nb = list(map(int, input().split()))\n\nfrom collections import Counter\nfrom itertools import accumulate\ncum = list(accumulate(b))\ncnt = Counter(cum)\nprint (n - cnt.most_common(1)[0][1])\n",
    "prob_desc_created_at": "1463416500",
    "tags": [
        "data structures",
        "constructive algorithms",
        "sortings",
        "greedy"
    ],
    "hidden_unit_tests": ""
}