{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"4\", \"-1\"]",
    "src_uid": "986a7d97e62856d5301d5a70ea01466a",
    "prob_desc_notes": "NoteIn the first sample, Dima and Inna play the first two notes at volume 1 (1 + 1 = 2, the condition holds), they should play the last note at volumes 1 and 2. Sereja's total joy equals: 1·1 + 1·1 + 1·2 = 4.In the second sample, there is no such pair (x, y), that 1 ≤ x, y ≤ 2, x + y = 5, so Dima and Inna skip a note. Sereja's total joy equals -1.",
    "prob_desc_description": "Inna is a great piano player and Dima is a modest guitar player. Dima has recently written a song and they want to play it together. Of course, Sereja wants to listen to the song very much. A song is a sequence of notes. Dima and Inna want to play each note at the same time. At that, they can play the i-th note at volume v (1 ≤ v ≤ ai; v is an integer) both on the piano and the guitar. They should retain harmony, so the total volume with which the i-th note was played on the guitar and the piano must equal bi. If Dima and Inna cannot play a note by the described rules, they skip it and Sereja's joy drops by 1. But if Inna and Dima play the i-th note at volumes xi and yi (xi + yi = bi) correspondingly, Sereja's joy rises by xi·yi. Sereja has just returned home from the university and his current joy is 0. Help Dima and Inna play the song so as to maximize Sereja's total joy after listening to the whole song!",
    "prob_desc_output_spec": "In a single line print an integer — the maximum possible joy Sereja feels after he listens to a song.",
    "prob_desc_input_spec": "The first line of the input contains integer n (1 ≤ n ≤ 105) — the number of notes in the song. The second line contains n integers ai (1 ≤ ai ≤ 106). The third line contains n integers bi (1 ≤ bi ≤ 106).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": null,
    "file_name": "train_010.jsonl",
    "code_uid": "04f7c7be2cc7cf865aab50cdb415240a",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"3\\n1 1 2\\n2 2 3\", \"1\\n2\\n5\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = input()\nvolumes = map(int, raw_input().split())\ntots = map(int, raw_input().split())\nans = 0\nfor i in xrange(n):\n    a = volumes[i]\n    b = tots[i]\n    if(2*a < b or b/2 == 0):\n        ans += -1\n    else:\n        ans += (b/2) * (b-b/2)\nprint ans",
    "prob_desc_created_at": "1392132600",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}