{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"-1 -1 -1 -1 -1 -1 1 1 -1 -1 2\", \"-1 -1 1 1 -1 -1 1 1 1 -1 1\"]",
    "src_uid": "80182142a917c19da8d8d405973b410d",
    "prob_desc_notes": "NoteIn the first example, the text in the editor will take the following form:  (^  ( ^  (a ^  (a  ^  (ab  ^  (ab   ^  (ab)   ^  (ab)  ^  (a))  ^  (a)) ^  (()) ^ ",
    "prob_desc_description": "The development of a text editor is a hard problem. You need to implement an extra module for brackets coloring in text.Your editor consists of a line with infinite length and cursor, which points to the current character. Please note that it points to only one of the characters (and not between a pair of characters). Thus, it points to an index character. The user can move the cursor left or right one position. If the cursor is already at the first (leftmost) position, then it does not move left.Initially, the cursor is in the first (leftmost) character.Also, the user can write a letter or brackets (either (, or )) to the position that the cursor is currently pointing at. A new character always overwrites the old value at that position.Your editor must check, whether the current line is the correct text. Text is correct if the brackets in them form the correct bracket sequence.Formally, correct text (CT) must satisfy the following rules:   any line without brackets is CT (the line can contain whitespaces);  If the first character of the string — is (, the last — is ), and all the rest form a CT, then the whole line is a CT;  two consecutively written CT is also CT. Examples of correct texts: hello(codeforces), round, ((i)(write))edi(tor)s, ( me). Examples of incorrect texts: hello)oops(, round), ((me).The user uses special commands to work with your editor. Each command has its symbol, which must be written to execute this command.The correspondence of commands and characters is as follows:   L — move the cursor one character to the left (remains in place if it already points to the first character);  R — move the cursor one character to the right;  any lowercase Latin letter or bracket (( or )) — write the entered character to the position where the cursor is now. For a complete understanding, take a look at the first example and its illustrations in the note below.You are given a string containing the characters that the user entered. For the brackets coloring module's work, after each command you need to:  check if the current text in the editor is a correct text;  if it is, print the least number of colors that required, to color all brackets. If two pairs of brackets are nested (the first in the second or vice versa), then these pairs of brackets should be painted in different colors. If two pairs of brackets are not nested, then they can be painted in different or the same colors. For example, for the bracket sequence ()(())()() the least number of colors is $$$2$$$, and for the bracket sequence (()(()())())(()) — is $$$3$$$.Write a program that prints the minimal number of colors after processing each command.",
    "prob_desc_output_spec": "In a single line print $$$n$$$ integers, where the $$$i$$$-th number is:   $$$-1$$$ if the line received after processing the first $$$i$$$ commands is not valid text,  the minimal number of colors in the case of the correct text. ",
    "prob_desc_input_spec": "The first line contains an integer $$$n$$$ ($$$1 \\le n \\le 10^6$$$) — the number of commands.  The second line contains $$$s$$$ — a sequence of commands. The string $$$s$$$ consists of $$$n$$$ characters. It is guaranteed that all characters in a string are valid commands.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "PyPy 2",
    "lang_cluster": "Python",
    "difficulty": 2100,
    "file_name": "train_067.jsonl",
    "code_uid": "cc10f2df5e5cf3174338471fef618ad3",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"11\\n(RaRbR)L)L(\", \"11\\n(R)R(R)Ra)c\"]",
    "exec_outcome": "PASSED",
    "source_code": "from __future__ import print_function,division\nimport sys\nn =int(input())\naf=[]\nd={'(':1,')':-1,' ':0}\ncu=0\nlo=20\nN=2**20\ns=[[0]*(2**k) for k in range(lo,-1,-1)]\nmi=[[0]*(2**k) for k in range(lo,-1,-1)]\nma=[[0]*(2**k) for k in range(lo,-1,-1)]\nl=[0]*N\nfor k in raw_input():\n    if k=='L':\n        if cu:\n            cu-=1\n    elif (k=='R'):\n        cu+=1\n    else:\n        if not(k in d):\n            k=' '\n        s[0][cu]=d[k]\n        h=1\n        cuh=cu\n        while h<=lo:\n            cuh//=2\n            s[h][cuh]=s[h-1][2*cuh]+s[h-1][2*cuh+1]\n            h+=1\n        h=1\n        cuh=cu\n        while h<=lo:\n            cuh//=2\n            mi[h][cuh]=min(mi[h-1][2*cuh],s[h-1][2*cuh]+mi[h-1][2*cuh+1])\n            h+=1\n        h=1\n        cuh=cu\n        while h<=lo:\n            cuh//=2\n            ma[h][cuh]=max(ma[h-1][2*cuh],s[h-1][2*cuh]+ma[h-1][2*cuh+1])\n            h+=1\n    af.append(ma[-1][0] if mi[-1][0]==0 and s[-1][0]==0 else -1)\nprint(\" \".join(map(str,af)))        \n\"\"\"af=[]\np=0\nn=int(input())\n\nN=10**6\nl=[' ']*N\ncog=[True]*N\ncod=[True]*N\nmid=[0]*N\ns=0\nh=0\nm=0\nd={'(':1,')':-1,' ':0}\n\nfor k in raw_input():\n    if k=='L':\n        if p:\n            h-d[l[p]]\n            p-=1\n            mid[p]=((h-s)>=0 and mid[p+1])\n    elif (k=='R'):\n        p+=1\n        h+=d[l[p]]\n        cog[p]=(cog[p-1] and h>=0)\n    else :\n        if not(k in d):\n            k=' '\n        x=d[k]-d[l[p]]\n        s+=x\n        h+=x\n        l[p]=k\n    #if\n\nprint(\"\\n\".join(map(str,af)))\"\"\"\n",
    "prob_desc_created_at": "1575038100",
    "tags": [
        "data structures",
        "implementation"
    ],
    "hidden_unit_tests": ""
}