{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"$2,012.00\", \"$0.00\", \"($0.00)\", \"($12,345,678.90)\"]",
    "src_uid": "c704c5fb9e054fab1caeab534849901d",
    "prob_desc_notes": "NotePay attention to the second and third sample tests. They show that the sign of a number in the financial format (and consequently, the presence or absence of brackets) is determined solely by the sign of the initial number. It does not depend on the sign of the number you got after translating the number to the financial format.",
    "prob_desc_description": "For some time the program of rounding numbers that had been developed by the Codeforces participants during one of the previous rounds, helped the citizens of Far Far Away to convert numbers into a more easily readable format. However, as time went by, the economy of the Far Far Away developed and the scale of operations grew. So the King ordered to found the Bank of Far Far Away and very soon even the rounding didn't help to quickly determine even the order of the numbers involved in operations. Besides, rounding a number to an integer wasn't very convenient as a bank needed to operate with all numbers with accuracy of up to 0.01, and not up to an integer.The King issued yet another order: to introduce financial format to represent numbers denoting amounts of money. The formal rules of storing a number in the financial format are as follows:   A number contains the integer part and the fractional part. The two parts are separated with a character \".\" (decimal point).  To make digits in the integer part of a number easier to read, they are split into groups of three digits, starting from the least significant ones. The groups are separated with the character \",\" (comma). For example, if the integer part of a number equals 12345678, then it will be stored in the financial format as 12,345,678  In the financial format a number's fractional part should contain exactly two digits. So, if the initial number (the number that is converted into the financial format) contains less than two digits in the fractional part (or contains no digits at all), it is complemented with zeros until its length equals 2. If the fractional part contains more than two digits, the extra digits are simply discarded (they are not rounded: see sample tests).  When a number is stored in the financial format, the minus sign is not written. Instead, if the initial number had the minus sign, the result is written in round brackets.  Please keep in mind that the bank of Far Far Away operates using an exotic foreign currency — snakes ($), that's why right before the number in the financial format we should put the sign \"$\". If the number should be written in the brackets, then the snake sign should also be inside the brackets. For example, by the above given rules number 2012 will be stored in the financial format as \"$2,012.00\" and number -12345678.9 will be stored as \"($12,345,678.90)\".The merchants of Far Far Away visited you again and expressed much hope that you supply them with the program that can convert arbitrary numbers to the financial format. Can you help them?",
    "prob_desc_output_spec": "Print the number given in the input in the financial format by the rules described in the problem statement.",
    "prob_desc_input_spec": "The input contains a number that needs to be converted into financial format. The number's notation length does not exceed 100 characters, including (possible) signs \"-\" (minus) and \".\" (decimal point). The number's notation is correct, that is:    The number's notation only contains characters from the set {\"0\" – \"9\", \"-\", \".\"}.  The decimal point (if it is present) is unique and is preceded and followed by a non-zero quantity on decimal digits  A number cannot start with digit 0, except for a case when its whole integer part equals zero (in this case the integer parts is guaranteed to be a single zero: \"0\").  The minus sign (if it is present) is unique and stands in the very beginning of the number's notation  If a number is identically equal to 0 (that is, if it is written as, for example, \"0\" or \"0.000\"), than it is not preceded by the minus sign.  The input data contains no spaces.  The number's notation contains at least one decimal digit. ",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1200,
    "file_name": "train_010.jsonl",
    "code_uid": "1804266ce908e1129fc309a3998e358d",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2012\", \"0.000\", \"-0.00987654321\", \"-12345678.9\"]",
    "exec_outcome": "PASSED",
    "source_code": "import math, re, sys, string, operator, functools, fractions, collections\nsys.setrecursionlimit(10**7)\nRI=lambda x=' ': list(map(int,input().split(x)))\nRS=lambda x=' ': input().rstrip().split(x)\ndX= [-1, 1, 0, 0,-1, 1,-1, 1]\ndY= [ 0, 0,-1, 1, 1,-1,-1, 1]\nmod=int(1e9+7)\neps=1e-6\npi=math.acos(-1.0)\nMAX=100\n#################################################\ns=RS()[0]\nst=0\nif s[0]=='-':\n    st=1\ns=s[st:].split('.')\ni,f=\"0\",\"0\"\ni=s[0]\nif len(s)>1:\n    f=s[1]\ni=i[::-1]\nf=f[::-1]\nans='$'+(','.join([i[j:j+3] for j in range(0,len(i),3)]))[::-1]\nans+= '.'+f.zfill(2)[::-1][:2]\nif st:\n    ans='('+ans+')'\nprint(ans)\n",
    "prob_desc_created_at": "1326380700",
    "tags": [
        "implementation",
        "strings"
    ],
    "hidden_unit_tests": ""
}