{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"3\\n2 4 3\", \"4\\n2 4 3 5\"]",
    "src_uid": "7f61b1d0e8294db74d33a6b6696989ad",
    "prob_desc_notes": "NoteThe sequence from the answer to the first sample test is actually correct.If the unknown number is not divisible by one of the sequence numbers, it is equal to 1.If the unknown number is divisible by 4, it is 4.If the unknown number is divisible by 3, then the unknown number is 3.Otherwise, it is equal to 2. Therefore, the sequence of questions allows you to guess the unknown number. It can be shown that there is no correct sequence of questions of length 2 or shorter.",
    "prob_desc_description": "Vasya and Petya are playing a simple game. Vasya thought of number x between 1 and n, and Petya tries to guess the number.Petya can ask questions like: \"Is the unknown number divisible by number y?\".The game is played by the following rules: first Petya asks all the questions that interest him (also, he can ask no questions), and then Vasya responds to each question with a 'yes' or a 'no'. After receiving all the answers Petya should determine the number that Vasya thought of.Unfortunately, Petya is not familiar with the number theory. Help him find the minimum number of questions he should ask to make a guaranteed guess of Vasya's number, and the numbers yi, he should ask the questions about.",
    "prob_desc_output_spec": "Print the length of the sequence of questions k (0 ≤ k ≤ n), followed by k numbers — the questions yi (1 ≤ yi ≤ n). If there are several correct sequences of questions of the minimum length, you are allowed to print any of them.",
    "prob_desc_input_spec": "A single line contains number n (1 ≤ n ≤ 103).",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1500,
    "file_name": "train_019.jsonl",
    "code_uid": "166cc32161c164191f410bde6605fcf7",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4\", \"6\"]",
    "exec_outcome": "PASSED",
    "source_code": "n=input()\nl=[i for i in xrange(n+1)]\n#print l\nz=[]\nfor i in xrange(2,n+1):\n    if l[i]!=1:\n        z.append(i)\n        for j in xrange(i+1,n+1):\n            if l[j]%l[i]==0:\n                l[j]/=l[i]\nprint len(z)\nfor i in z:\n    print i,\nprint",
    "prob_desc_created_at": "1441902600",
    "tags": [
        "number theory",
        "math"
    ],
    "hidden_unit_tests": ""
}