{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1 2\", \"0 1\", \"3 1\"]",
    "src_uid": "d3bdb328e4d37de374cb3201c2a86eee",
    "prob_desc_notes": "NoteThe simple cycle is a cycle that doesn't contain any vertex twice.",
    "prob_desc_description": "After Vitaly was expelled from the university, he became interested in the graph theory.Vitaly especially liked the cycles of an odd length in which each vertex occurs at most once.Vitaly was wondering how to solve the following problem. You are given an undirected graph consisting of n vertices and m edges, not necessarily connected, without parallel edges and loops. You need to find t — the minimum number of edges that must be added to the given graph in order to form a simple cycle of an odd length, consisting of more than one vertex. Moreover, he must find w — the number of ways to add t edges in order to form a cycle of an odd length (consisting of more than one vertex). It is prohibited to add loops or parallel edges.Two ways to add edges to the graph are considered equal if they have the same sets of added edges.Since Vitaly does not study at the university, he asked you to help him with this task.",
    "prob_desc_output_spec": "Print in the first line of the output two space-separated integers t and w — the minimum number of edges that should be added to the graph to form a simple cycle of an odd length consisting of more than one vertex where each vertex occurs at most once, and the number of ways to do this.",
    "prob_desc_input_spec": "The first line of the input contains two integers n and m ( — the number of vertices in the graph and the number of edges in the graph. Next m lines contain the descriptions of the edges of the graph, one edge per line. Each edge is given by a pair of integers ai, bi (1 ≤ ai, bi ≤ n) — the vertices that are connected by the i-th edge. All numbers in the lines are separated by a single space. It is guaranteed that the given graph doesn't contain any loops and parallel edges. The graph isn't necessarily connected.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2000,
    "file_name": "train_022.jsonl",
    "code_uid": "7d1726ad951b396535227c8f1de213b7",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"4 4\\n1 2\\n1 3\\n4 2\\n4 3\", \"3 3\\n1 2\\n2 3\\n3 1\", \"3 0\"]",
    "exec_outcome": "PASSED",
    "source_code": "n, m = [int(x) for x in input().split()]\nE = {i:[] for i in range(n)}\nfor i in range(m):\n    u, v = [int(x)-1 for x in input().split()]\n    E[v].append(u)\n    E[u].append(v)\n\ndef dfs():\n    visited = [False for i in range(n)]\n    colour = [0 for i in range(n)]\n    ans = 0\n    for v in range(n):\n        if visited[v]: continue\n        stack = [(v, 0)]\n        part = [0, 0]\n        while stack:\n            node, c = stack.pop()\n            if not visited[node]:\n                part[c] += 1\n                visited[node] = True\n                colour[node] = c\n                stack.extend((u,c^1) for u in E[node])\n            elif c != colour[node]:\n                return (0, 1)\n        ans += (part[0]*(part[0] - 1) + part[1]*(part[1] - 1)) // 2\n    return (1, ans)\n\nif m == 0:\n    print(3, n*(n-1)*(n-2)//6)\nelif max(len(E[v]) for v in E) == 1:\n    print(2, m*(n-2))\nelse:\n    ans = dfs()\n    print(ans[0], ans[1])\n\n        \n\n    \n",
    "prob_desc_created_at": "1435676400",
    "tags": [
        "combinatorics",
        "graphs",
        "dfs and similar",
        "math"
    ],
    "hidden_unit_tests": ""
}