{
    "prob_desc_time_limit": "1 second",
    "prob_desc_sample_outputs": "[\"1 4\\n2 3\"]",
    "src_uid": "0ac2a0954fe43d66eac32072c8ea5070",
    "prob_desc_notes": "NoteThe sample shows Gerald's actions if he has two brothers. In this case, his bags contain 1, 2, 3 and 4 candies. He can give the bags with 1 and 4 candies to one brother and the bags with 2 and 3 to the other brother.",
    "prob_desc_description": "Gerald has n younger brothers and their number happens to be even. One day he bought n2 candy bags. One bag has one candy, one bag has two candies, one bag has three candies and so on. In fact, for each integer k from 1 to n2 he has exactly one bag with k candies. Help him give n bags of candies to each brother so that all brothers got the same number of candies.",
    "prob_desc_output_spec": "Let's assume that Gerald indexes his brothers with numbers from 1 to n. You need to print n lines, on the i-th line print n integers — the numbers of candies in the bags for the i-th brother. Naturally, all these numbers should be distinct and be within limits from 1 to n2. You can print the numbers in the lines in any order.  It is guaranteed that the solution exists at the given limits.",
    "prob_desc_input_spec": "The single line contains a single integer n (n is even, 2 ≤ n ≤ 100) — the number of Gerald's brothers.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 1000,
    "file_name": "train_007.jsonl",
    "code_uid": "b8f473c98f173f579bb0bfc3731e888c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = int(raw_input())\n\nk = 1\nm = []\nfor i in xrange(n):\n    a = range(k, k+n/2)\n    b = range(n**2-k-n/2+2, n**2-k+2)\n    print ' '.join(map(str, a+b))\n    k += n/2\n    \n\n\n\n\n\n\n\n\n\n\n\n",
    "prob_desc_created_at": "1374913800",
    "tags": [
        "implementation"
    ],
    "hidden_unit_tests": ""
}