{
    "prob_desc_time_limit": "1 секунда",
    "prob_desc_sample_outputs": "[\"2\", \"3\"]",
    "src_uid": "6610f504d5232c81146c59411f513d9d",
    "prob_desc_notes": "ПримечаниеВ первом примере Вася получит два подарка — за первые три положительные оценки и за следующую тройку положительных оценок соответственно.",
    "prob_desc_description": "Родители Васи хотят, чтобы он как можно лучше учился. Поэтому если он получает подряд три положительные оценки («четвёрки» или «пятёрки»), они дарят ему подарок. Соответственно, оценки «единица», «двойка» и «тройка» родители Васи считают плохими. Когда Вася получает подряд три хорошие оценки, ему сразу вручают подарок, но для того, чтобы получить ещё один подарок, ему вновь надо получить подряд ещё три хорошие оценки.Например, если Вася получит подряд пять «четвёрок» оценок, а потом «двойку», то ему дадут только один подарок, а вот если бы «четвёрок» было уже шесть, то подарков было бы два. За месяц Вася получил n оценок. Вам предстоит посчитать количество подарков, которые получил Вася. Оценки будут даны именно в том порядке, в котором Вася их получал. ",
    "prob_desc_output_spec": "Выведите одно целое число — количество подарков, полученных Васей.",
    "prob_desc_input_spec": "В первой строке входных данных следует целое положительное число n (3 ≤ n ≤ 1000) — количество оценок, полученных Васей. Во второй строке входных данных следует последовательность из n чисел a1, a2, ..., an (1 ≤ ai ≤ 5) — оценки, полученные Васей. Оценки заданы в том порядке, в котором Вася их получил. ",
    "prob_desc_output_to": "стандартный вывод",
    "prob_desc_input_from": "стандартный ввод",
    "lang": "Python 2",
    "lang_cluster": "Python",
    "difficulty": 800,
    "file_name": "train_018.jsonl",
    "code_uid": "89b974ba5acecd7cf54b0a7e741f2ea8",
    "prob_desc_memory_limit": "256 мегабайт",
    "prob_desc_sample_inputs": "[\"6\\n4 5 4 5 4 4\", \"14\\n1 5 4 5 2 4 4 5 5 4 3 4 5 5\"]",
    "exec_outcome": "PASSED",
    "source_code": "n = input()\ns = raw_input().split()\nk = 0\nt = 0\n\nfor i in s:\n    if (int(i) > 3):\n        k += 1\n    else:\n        k = 0\n    if (k >= 3):\n        k = 0\n        t += 1\nprint t\n",
    "prob_desc_created_at": "1458799200",
    "tags": [],
    "hidden_unit_tests": ""
}