{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"YES\\n1 2 5 6 3 7 4 8\", \"YES\\n2 3 4 6 7 8 10 11 12 1 5 9\"]",
    "src_uid": "02f5b0bf9147ef1a1fa8a76e59fab1a8",
    "prob_desc_notes": "Note(1) To be extremely accurate, we should note that the amount of server memory is 1 GiB = 1024 MiB and processes require 100 MiB RAM where a gibibyte (GiB) is the amount of RAM of 230 bytes and a mebibyte (MiB) is the amount of RAM of 220 bytes.In the first sample test the network uses two servers, each of which initially has four launched processes. In accordance with the rules of replication, each of the processes must be destroyed and twice run on another server. One of the possible answers is given in the statement: after applying rules 1 and 2 the first server will have 2 old running processes, and the second server will have 8 (4 old and 4 new) processes. After we apply rules 5 and 6, both servers will have 6 running processes (2 old and 4 new). After we apply rules 3 and 7, both servers will have 7 running processes (1 old and 6 new), and after we apply rules 4 and 8, each server will have 8 running processes. At no time the number of processes on a single server exceeds 9.In the second sample test the network uses three servers. On each server, three processes are replicated into two processes on the same server, and the fourth one is replicated in one process for each of the two remaining servers. As a result of applying rules 2, 3, 4, 6, 7, 8, 10, 11, 12 each server would have 7 processes (6 old and 1 new), as a result of applying rules 1, 5, 9 each server will have 8 processes. At no time the number of processes on a single server exceeds 9.",
    "prob_desc_description": "A Large Software Company develops its own social network. Analysts have found that during the holidays, major sporting events and other significant events users begin to enter the network more frequently, resulting in great load increase on the infrastructure.As part of this task, we assume that the social network is 4n processes running on the n servers. All servers are absolutely identical machines, each of which has a volume of RAM of 1 GB = 1024 MB (1). Each process takes 100 MB of RAM on the server. At the same time, the needs of maintaining the viability of the server takes about 100 more megabytes of RAM. Thus, each server may have up to 9 different processes of social network.Now each of the n servers is running exactly 4 processes. However, at the moment of peak load it is sometimes necessary to replicate the existing 4n processes by creating 8n new processes instead of the old ones. More formally, there is a set of replication rules, the i-th (1 ≤ i ≤ 4n) of which has the form of ai → (bi, ci), where ai, bi and ci (1 ≤ ai, bi, ci ≤ n) are the numbers of servers. This means that instead of an old process running on server ai, there should appear two new copies of the process running on servers bi and ci. The two new replicated processes can be on the same server (i.e., bi may be equal to ci) or even on the same server where the original process was (i.e. ai may be equal to bi or ci). During the implementation of the rule ai → (bi, ci) first the process from the server ai is destroyed, then appears a process on the server bi, then appears a process on the server ci.There is a set of 4n rules, destroying all the original 4n processes from n servers, and creating after their application 8n replicated processes, besides, on each of the n servers will be exactly 8 processes. However, the rules can only be applied consecutively, and therefore the amount of RAM of the servers imposes limitations on the procedure for the application of the rules.According to this set of rules determine the order in which you want to apply all the 4n rules so that at any given time the memory of each of the servers contained at most 9 processes (old and new together), or tell that it is impossible.",
    "prob_desc_output_spec": "If the required order of performing rules does not exist, print \"NO\" (without the quotes). Otherwise, print in the first line \"YES\" (without the quotes), and in the second line — a sequence of 4n numbers from 1 to 4n, giving the numbers of the rules in the order they are applied. The sequence should be a permutation, that is, include each number from 1 to 4n exactly once. If there are multiple possible variants, you are allowed to print any of them.",
    "prob_desc_input_spec": "The first line of the input contains integer n (1 ≤ n ≤ 30 000) — the number of servers of the social network. Next 4n lines contain the rules of replicating processes, the i-th (1 ≤ i ≤ 4n) of these lines as form ai, bi, ci (1 ≤ ai, bi, ci ≤ n) and describes rule ai → (bi, ci). It is guaranteed that each number of a server from 1 to n occurs four times in the set of all ai, and eight times among a set that unites all bi and ci.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 2600,
    "file_name": "train_058.jsonl",
    "code_uid": "e6411907beef1756684f539c68ca4e1f",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"2\\n1 2 2\\n1 2 2\\n1 2 2\\n1 2 2\\n2 1 1\\n2 1 1\\n2 1 1\\n2 1 1\", \"3\\n1 2 3\\n1 1 1\\n1 1 1\\n1 1 1\\n2 1 3\\n2 2 2\\n2 2 2\\n2 2 2\\n3 1 2\\n3 3 3\\n3 3 3\\n3 3 3\"]",
    "exec_outcome": "PASSED",
    "source_code": "from collections import deque\nimport random\n\n\nclass CodeforcesTask566BSolution:\n    def __init__(self):\n        self.result = ''\n        self.n = 0\n        self.rules = []\n\n    def read_input(self):\n        self.n = int(input())\n        self.rules = [[int(x) for x in input().split(\" \")] + [y + 1] for y in range(self.n * 4)]\n\n    def process_task(self):\n\n        loads = [4] * self.n\n        random.shuffle(self.rules)\n        to_use = deque(self.rules)\n        order = []\n        res = True\n        ba = 0\n        while to_use and res:\n            moving = to_use.popleft()\n            loads[moving[0] - 1] -= 1\n            if loads[moving[1] - 1] < 9 and loads[moving[2] - 1] < 9 + (-1 if moving[2] == moving[1] else 0):\n                ba = 0\n                loads[moving[1] - 1] += 1\n                loads[moving[2] - 1] += 1\n                order.append(moving[3])\n            else:\n                ba += 1\n                loads[moving[0] - 1] += 1\n                to_use.append(moving)\n            if ba > self.n * 12:\n                res = False\n        self.result = \"NO\" if not res else f\"YES\\n{' '.join([str(x) for x in order])}\"\n\n    def get_result(self):\n        return self.result\n\n\nif __name__ == \"__main__\":\n    Solution = CodeforcesTask566BSolution()\n    Solution.read_input()\n    Solution.process_task()\n    print(Solution.get_result())\n",
    "prob_desc_created_at": "1437898500",
    "tags": [
        "constructive algorithms",
        "greedy"
    ],
    "hidden_unit_tests": ""
}