{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"1\\n2\\n0\\n3\\n1\"]",
    "src_uid": "a9143235c8e2b6b188ea3fc8a90f0c80",
    "prob_desc_notes": "NoteLet's analyze the test cases of the example.In the first test case, you can paint the bottom left pixel and the top right pixel (which share the same color) into the color r, so all pixels have this color.In the second test case, two moves are enough:  paint both top pixels, which have the same color c, into the color b;  paint the bottom left pixel into the color b. In the third test case, all pixels already have the same color.In the fourth test case, you may leave any of the pixels unchanged, and paint all three other pixels into the color of that pixel in three moves.In the fifth test case, you can paint both top pixels into the color x.",
    "prob_desc_description": "You have an image file of size $$$2 \\times 2$$$, consisting of $$$4$$$ pixels. Each pixel can have one of $$$26$$$ different colors, denoted by lowercase Latin letters.You want to recolor some of the pixels of the image so that all $$$4$$$ pixels have the same color. In one move, you can choose no more than two pixels of the same color and paint them into some other color (if you choose two pixels, both should be painted into the same color).What is the minimum number of moves you have to make in order to fulfill your goal?",
    "prob_desc_output_spec": "For each test case, print one integer — the minimum number of moves you have to make so that all $$$4$$$ pixels of the image have the same color.",
    "prob_desc_input_spec": "The first line contains one integer $$$t$$$ ($$$1 \\le t \\le 1000$$$) — the number of test cases. Each test case consists of two lines. Each of these lines contains two lowercase letters of Latin alphabet without any separators, denoting a row of pixels in the image.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 800,
    "file_name": "train_090.jsonl",
    "code_uid": "dd59bd6e14cc7d1110fe5f9e732ecc90",
    "prob_desc_memory_limit": "512 megabytes",
    "prob_desc_sample_inputs": "[\"5\\n\\nrb\\n\\nbr\\n\\ncc\\n\\nwb\\n\\naa\\n\\naa\\n\\nab\\n\\ncd\\n\\nyy\\n\\nxx\"]",
    "exec_outcome": "PASSED",
    "source_code": "n=int(input())\r\nf=[]\r\n\r\nfor i in range(n):\r\n    a = (list)(map(str , input()))\r\n    b = (list)(map(str , input()))\r\n    sa=set(a)\r\n    sb=set(b)\r\n    s=sa.union(sb)\r\n    e=len(s)-1\r\n    f.append(e)\r\nprint(*f,sep='\\n')",
    "prob_desc_created_at": "1661610900",
    "tags": [
        "greedy",
        "implementation"
    ],
    "hidden_unit_tests": ""
}