{
    "prob_desc_time_limit": "2 seconds",
    "prob_desc_sample_outputs": "[\"12.000000\\n11.000000\\n10.000000\\n9.000000\\n8.000000\", \"-1\"]",
    "src_uid": "65fea461d3caa5a932d1e2c13e99a59e",
    "prob_desc_notes": null,
    "prob_desc_description": "A group of n merry programmers celebrate Robert Floyd's birthday. Polucarpus has got an honourable task of pouring Ber-Cola to everybody. Pouring the same amount of Ber-Cola to everybody is really important. In other words, the drink's volume in each of the n mugs must be the same.Polycarpus has already began the process and he partially emptied the Ber-Cola bottle. Now the first mug has a1 milliliters of the drink, the second one has a2 milliliters and so on. The bottle has b milliliters left and Polycarpus plans to pour them into the mugs so that the main equation was fulfilled.Write a program that would determine what volume of the drink Polycarpus needs to add into each mug to ensure that the following two conditions were fulfilled simultaneously:   there were b milliliters poured in total. That is, the bottle need to be emptied;  after the process is over, the volumes of the drink in the mugs should be equal. ",
    "prob_desc_output_spec": "Print a single number \"-1\" (without the quotes), if there is no solution. Otherwise, print n float numbers c1, c2, ..., cn, where ci is the volume of the drink to add in the i-th mug. Print the numbers with no less than 6 digits after the decimal point, print each ci on a single line. Polycarpus proved that if a solution exists then it is unique. Russian locale is installed by default on the testing computer. Make sure that your solution use the point to separate the integer part of a real number from the decimal, not a comma.",
    "prob_desc_input_spec": "The first line contains a pair of integers n, b (2 ≤ n ≤ 100, 1 ≤ b ≤ 100), where n is the total number of friends in the group and b is the current volume of drink in the bottle. The second line contains a sequence of integers a1, a2, ..., an (0 ≤ ai ≤ 100), where ai is the current volume of drink in the i-th mug.",
    "prob_desc_output_to": "standard output",
    "prob_desc_input_from": "standard input",
    "lang": "Python 3",
    "lang_cluster": "Python",
    "difficulty": 1100,
    "file_name": "train_029.jsonl",
    "code_uid": "5d018348eca4cf8eb9a3129ef2388b1c",
    "prob_desc_memory_limit": "256 megabytes",
    "prob_desc_sample_inputs": "[\"5 50\\n1 2 3 4 5\", \"2 2\\n1 100\"]",
    "exec_outcome": "PASSED",
    "source_code": "x=[int(i) for i in input().split()]\nn=x[0]\ny=[int(i) for i in input().split()]\nif x[1]<max(y)*n-sum(y):\n    print(-1)\n    raise SystemExit\n\nfor i in range(n):\n    s=x[1]/n-y[i]++sum(y)/n\n    print('%.6f'% s)\n",
    "prob_desc_created_at": "1333897500",
    "tags": [
        "math"
    ],
    "hidden_unit_tests": ""
}